{
  "query_id": 1,
  "query": "!awnmower tires without rims",
  "positive_passages": [
    {
      "docid": 1049092,
      "title": "2 Pack 10-Inch Tires and Wheels 4.10/3.50-4 Replacement Utility Tires for Dolly, Hand Truck, Gorilla Cart, Generator, Lawn Mower, Garden Wagon With 5/8-Inch Axle Borehole and Double Sealed Bearings",
      "text": "Product Description Read more Read more All-purpose Utility The Ram-Pro’s ten inch, ready to install Air Tire Wheels is the best replacement for your hand truck tires and wheels. It offers easy installation and optimum effort reducing performance. The only effort you need to make is to remove the old tires before sliding in the new ones and closing them with clips, nuts or cotter pins. That’s a perfectly installed and proper functioning hand truck without any hesitation or frustration. Superior Quality The high-quality heavy duty rubber will last very long. The air stem is on the outside so you can easily inflate the tires if needed. The double sealed bearings will evenly distribute the load on your vehicle and help to balance the loud noise evenly thereby making you push less and easier. The reduction in noise levels further helps to reduce stress levels. High End Specification The Ram-Pro Air Tires size is ten inches high and three inches wide with a hole diameter of 5/8 inches. The hub depth of the tires is 1-3/4 inches with double sealed bearings. With such high-end specifications, it can withstand a load capacity of 300 lbs. (approximately 136 Kgs). The pressure per square inch rating is 30 per tire. The tube type is a 2 ply 4.10/3.5-4. These air-filled tires are designed with raised grips to make your drive the smoothest possible one. Numerous Applications The air tires can be used for hand trucks, lawn mowers, yard wagons, air compressors, power washers, child's wagons, shopping carts, wood chippers, snow blowers, dollies, go karts, golf carts, tricycles, and much more. This assembly has proven to be ideal for air compressors, dollies, generators, pressure washers and various other auxiliary utility equipment. Read more Read more "
    },
    {
      "docid": 314519,
      "title": "MaxAuto 13x5.00-6 Lawn Mower Tires with Rim 13x5.00-6 Tire and Wheel 13x5-6 NHS Tire 13x5x6 Pneumatic Tire, 3\" Centered Hub, 3/4\" Bushings",
      "text": "From the brand Previous page MaxAuto is a thriving brand which has been committed to meeting customer needs with high-quality tires. Our lineup include tires applied in Lawn & Garden, Agriculture, Golf Cart, ATV/UTV, ST Trailer, light truck, etc. We've obtained such certification as US DOT(2000),EU ECE(2006),Middle East SASO. The testing center has passed the CNAS(2017), German TÜV(2018), to ensure that all of our products are manufactured with the same quality standards. Zero Turn Mower Tire Wheel Kit Visit the Store Riding Mower Tire & Wheel Kit Visit the Store Riding Mower Tire & Wheel Kit Visit the Store Riding Mower Tire & Wheel Kit Visit the Store Next page Product Description How to Measure a Tire? Tire Diameter Tire Diameter: 13.09 inch Yellow Steel Pneumatic Tires Hub Length -Through center of the hub Hub Length: 3.00 inch Centered Hub Bushing -Measure inside diameter of opening Bushing size / Bore size /Axle size: 3/4 inch Grease fitting Tire Width Tire Width: 4.56 inch Rim Diameter: 6.00 inch Read more 1.What tire size number do I need? Check the sidewall of your existing tire for the tire size number. 2.What bearing/Bushing size do I need? Measure the inside diameter of the bearing or bushing on your existing wheel or the outside diameter of the axle it will be mounted on 3. What hub length do I need? Measure the distance from the outside of one bearing/bushing to the outside of the other on your existing wheel. Tips: if your tape measure is too wide to fit through the bearing/bushing-place a pen or pencil through the bearing bushing and then measure that length. 4. Do I need a centered or offset hub? A. Centered(symmetrical)=both sides of the hub on your existing wheel stick out the same distance and you can mount or install it either way. B. Offset=one side of the hub on your existing wheels sticks out farther than the other and this impacts how you mount or install it. How to find correct replacement tire and rim for your lawn mowers? Tire Specifications: Tire size:13x5.00-6 Tire Type: Pneumatic Tires Tire Diameter:13.09\" Tire Width:4.56\" Load Capacity:300lbs Rim/Wheel Specifications: Tire Width: 4.56 inch Rim Diameter: 6.00 inch Bushings size / Bore size /Axle size: 3/4 inch Grease fitting Hub Length: 3.00 inch Centered Hub Before to purchase, please check your existing tire sidewall for tire, hub and bushing size to ensure proper replacement fit. 1.Check your existing tire sidewall for tire, hub and bushing size to ensure proper replacement fit. 2.what tire size number do I need? 3.What Bearing/Bushing size do I need? 4.Do I need a centered or offset hub? 5.what hub length do I need? Read more 13X5.00-6 16X6.50-8 15X6.00-6 20X8.00-8 Hub Type Centered Hub Offset Hub Offset Hub Offset Hub Hub Length 3\" 3\" 3\" 3.5\" Bearing/Bushing Size 3/4\" 3/4\" 3/4\" 3/4\" Rim Color Yellow Yellow Yellow Yellow Max Load 300Lbs 615Lbs 595Lbs 965Lbs Grease Fitting ✓ ✓ ✓ ✖ Air Valve ✓ ✓ ✓ ✓ "
    },
    {
      "docid": 689593,
      "title": "NEIKO 20601A 14.5” Steel Tire Spoons Tool Set, Tire Tools Include 3 Piece Tire Spoons, 3 Piece Rim Protector, Valve Tool, 6 Piece Valve Cores, Motorcycle Tire Changer, Dirt Bike Tire Levers",
      "text": "Product Description 20601A Neiko Tire Spoons Rim Protector and Valve Tool Set is the perfect tool for any mechanics, homeowners, or DIY-ers! Whether you’re working on a car or motorcycle, this complete package of tools is great for removing damaged tires. The set not only includes one, but three flexible rim guards to prevent any damage to the rims while using the tire spoons. As an added BONUS, the set includes 6 Brass Schrader Valve Cores for convenience. Product Features: - Tire spoons are constructed of high quality Hardened Steel-Iron for ultimate durability/strength - Chrome polish finish that protects the tool from rust/corrosion and allows for hassle-free cleaning - Curved tips allow for easy insertion to any and all applications - Extra long length lever at 14.5 inches to easily prop out damaged tires without using extra force - Ergonomic, contoured, rubberized groove handle provides a natural non-slip grip while reducing hand fatigue and maximizing leverage power - 4 point valve tool with mouth side for attachments of various bits, deflation needle side that can be used to deflate the needle or remove stuck rocks in tire grooves, valve core side for quick removal and installation of valve core stems, and the screw thread side to easily clean the threads of the wheel stems Product Description 20601A Neiko Tire Spoons Rim Protector and Valve Tool Set is the perfect tool for any mechanics, homeowners, or DIY-ers! Whether you’re working on a car or motorcycle, this complete package of tools is great for removing damaged tires. The set not only includes one, but three flexible rim guards to prevent any damage to the rims while using the tire spoons. As an added BONUS, the set includes 6 Brass Schrader Valve Cores for convenience. Product Features: - Tire spoons are constructed of high quality Hardened Steel-Iron for ultimate durability/strength - Chrome polish finish that protects the tool from rust/corrosion and allows for hassle-free cleaning - Curved tips allow for easy insertion to any and all applications - Extra long length lever at 14.5 inches to easily prop out damaged tires without using extra force - Ergonomic, contoured, rubberized groove handle provides a natural non-slip grip while reducing hand fatigue and maximizing leverage power - 4 point valve tool with mouth side for attachments of various bits, deflation needle side that can be used to deflate the needle or remove stuck rocks in tire grooves, valve core side for quick removal and installation of valve core stems, and the screw thread side to easily clean the threads of the wheel stemsFrom the manufacturer Read more Premium Tire Changing Tool Kit Quality Construction The hardened steel iron construction through out the lever shaft to the curved tips, yield the ultimate in strength and durability that gives this tool set supreme effectiveness when tire changing. What's Included: 3 Piece - Hardend Steel-Iron Tire Spoon Levers 3 Piece - Rim Protectors 1 Piece - 4-Way Valve Tool 6 Piece - Brass Schrader Valve Cores Read more Rust Resistant With a polished chrome finish, you don't need to worry about your tire spoons getting rust on them. Longer Reach At 14.5 inches long, you can gain the leverage and utilize the force needed on your tires with ease! Ergonomics The rubber grip is ergonomically designed for comfort and control, and allows you to maximize your leverage. 4-Way Valve Tool and 6 Valve Cores Included With the 4-Way valve tool, you have a clean thread, valve core remover, deflation needle and tapping mouth, all-in-one, in addition to 6 brass valve cores all included. Read more Read more "
    },
    {
      "docid": 717649,
      "title": "2PK 13x5.00-6 13x5.00x6 13x5x6 13x5-6 2PLY Turf Mower Tractor Tire with Gray Rim",
      "text": ""
    },
    {
      "docid": 1397156,
      "title": "(Set of 2) 15x6.00-6 Husqvarna/Poulan Tire Wheel Assy .75\" Bearing (Because we supply a precision ball bearing the shaft must be clean and straight for them to fit properly)",
      "text": "Product Description 15x6.00-6 Husqvarna Replacement Assemblies Replacement Part Numbers These assemblies are aftermarket replacements for the following Husqvarna/Poulan Tire and wheel numbers: 532106732 106732x645 106732x643 106732x417 532141446 532138336 532125102 5321122073 Technical Specifications Tire OD 14.96\" Tire Size 15x6.00-6 Ply 4 Ply Radial Tubeless Hub Diameter 0.75 Inches Max PSI 30 PSI Precision Bearings We have upgraded the OE Wheels with Precision Bearings. Therefore, it is not necessary for you to grease the wheel. Additionally, The precision bearings offer a better quality wheel. Durable Tires Our tires are extremely durable and provide consumers with a great value due to the quality of the rubber compound. Our tires are made of a mixture of Natural and Synthetic rubber. Deep Lugged Tread Provides stronger grip Deeper tread = longer tire life Enables better traction control in less than ideal conditions. Lightweight Wheels Our all aluminum construction enables the customer to enjoy the benefits of not just a strong wheel, but a lightweight wheel as well. Read more "
    },
    {
      "docid": 1095149,
      "title": "MaxAuto 2 Pcs 16x6.50-8 Lawn Mower Tire for Garden Tractors Riding Mowers, 4PR, Tubeless",
      "text": "From the brand Previous page MaxAuto is a thriving brand which has been committed to meeting customer needs with high-quality tires. Our lineup include tires applied in Lawn & Garden, Agriculture, Golf Cart, ATV/UTV, ST Trailer, light truck, etc. We've obtained such certification as US DOT(2000),EU ECE(2006),Middle East SASO. The testing center has passed the CNAS(2017), German TÜV(2018), to ensure that all of our products are manufactured with the same quality standards. Lawn Mower Tires Visit the Store Lawn Mower Tires Visit the Store Lawn Mower Tires Visit the Store Lawn Mower Tires Visit the Store Lawn Mower Tires Visit the Store Next page Product Description About MaxAuto Brand >>Focus on high-quality speciality tire manufacturer In 1997, we began to invest in the development and production of ATV tires. Since then, we continue to expand our technical capabilities, production capacity and research and development. With a comprehensive range of applications and broad product line, and an annual output of 80 million sets, we highlight our industry leadership in the speciality tire and continue to maintain our innovation and creativity. >>Our Advantage We offer the best quality - worldwide. All major production technology and machines own designs; we have established production bases around the world. America, Australia, New Zealand and Asia This is how we ensure that all our products the same quality standards worldwide. How to Read a Tire? Tire Specifications: 1. Material: Rubber 2. Tire Size: 16X6.50-8 3. Load Range: Max. 620lbs@28psi 4. Tire Type: Tubeless 5. Rim Width: 5.375\" 6. SW: 165mm / 6.50\" 7. OD: 410mm / 16.14\" 8. Rating: 4 PLY 9. Tread Depth: 7.1mm/ 0.28\" 10. Pattern: P332 16X6.50-8 P512 16X6.50-8 P332 16X6.50-8 P328 16X6.50-8 P508 Ply Rating 4PR 4PR 4PR 4PR Tread Depth(mm) 5.5mm 7.1mm 12mm 4mm Max Load(Lbs) 615lbs 620lbs 615lbs 620lbs PSI 28 28 28 28 Why Choose Our Tire? The role of unique pattern design Increase the tire and the ground friction; Reduce tire noise to enhance comfort; For the tire cooling, drainage; Improve vehicle handling performance; The advantages of our service 1.Our factory has the professional R&D team and strong production capacity. We strictly check every product. We aims to manufacture premium tires. 2.Seller Fulfilled Prime. The advantages of our brand tires 1.Our tires adopt a special rubber formula, wear resistance, anti-aging and heat resistance than other brands of tires 2.Unique pattern design make your car in a variety of road safety and ease of driving. "
    },
    {
      "docid": 341130,
      "title": "Dr.Roc Tire Spoon Lever Dirt Bike Lawn Mower Motorcycle Tire Changing Tools with Durable Bag 3 Tire Irons 2 Rim Protectors 1 Valve Stems Set TR412 TR413",
      "text": "Product Description Easy tire spoons to change your motorcycle,dirtbike,lawn mower,garden tractor,kayak transporter and other small tires like wheel barrow tires etc Specifications: Length:11\" (280mm) Weight:480g Finish: Beautiful polished chrome finish Useful tire tool to change the tire of motorcycles/dirt bikes/lawn mower/atv and other small tires like wheel barrow tires Easy Grip Handle:Nice handles,nice distinction from most other levers,Anti-skid Anti- hand Materials: Heavy duty weather and rust-resistant strong automotive grade drop forged steel Useful motorcycle tire changing tools:11\"(280mm) ,set of 3 tire irons .Ensure works great on atv,motorcycle,dirtbike tires,removing and reinstalling small tires with minimal fuss Being chromed and smooth rounded edges on the tire spoons ensure the tire bead to roll off the rim,without pinching your tire and the rim Very Solidly Built:Even strong enough to break the bead on your tire Product Description Easy tire spoons to change your motorcycle,dirtbike,lawn mower,garden tractor,kayak transporter and other small tires like wheel barrow tires etc Specifications: Length:11\" (280mm) Weight:480g Finish: Beautiful polished chrome finish Useful tire tool to change the tire of motorcycles/dirt bikes/lawn mower/atv and other small tires like wheel barrow tires Easy Grip Handle:Nice handles,nice distinction from most other levers,Anti-skid Anti- hand Materials: Heavy duty weather and rust-resistant strong automotive grade drop forged steel Useful motorcycle tire changing tools:11\"(280mm) ,set of 3 tire irons .Ensure works great on atv,motorcycle,dirtbike tires,removing and reinstalling small tires with minimal fuss Being chromed and smooth rounded edges on the tire spoons ensure the tire bead to roll off the rim,without pinching your tire and the rim Very Solidly Built:Even strong enough to break the bead on your tire"
    },
    {
      "docid": 911618,
      "title": "MARASTAR 21446-2PK 15x6.00-6\" Front Tire Assembly Replacement-Craftsman Mower, Pack of 2",
      "text": "Product Description Marastar's 2 Pack 15x6 00-6 air filled (pneumatic) front tire & wheel assembly is the perfect replacement for Craftsman riding mowers with 15x6 00-6 tires (Check your existing tires sidewall). you don't need to change out an old tube or visit a professional tire shop, simply replace the entire old or damaged tire & wheel assembly with this one. Marastar’s easy to install Replacement comes with a tube-type 4-Ply rated tire with turf Saver tread pre-mounted on dark gray powder-coated steel wheel with a 3” centered hub length, high-quality oil impregnated bushings installed & a grease fitting. Tire repair & replacement made easy - also included 3 x 0. 08” thick washers & an extra e-clip to make this the practical tire & wheel solution for Craftsman mowers with 15x6 00-6 front tires. Product Description Marastar's 2 Pack 15x6 00-6 air filled (pneumatic) front tire & wheel assembly is the perfect replacement for Craftsman riding mowers with 15x6 00-6 tires (Check your existing tires sidewall). you don't need to change out an old tube or visit a professional tire shop, simply replace the entire old or damaged tire & wheel assembly with this one. Marastar’s easy to install Replacement comes with a tube-type 4-Ply rated tire with turf Saver tread pre-mounted on dark gray powder-coated steel wheel with a 3” centered hub length, high-quality oil impregnated bushings installed & a grease fitting. Tire repair & replacement made easy - also included 3 x 0. 08” thick washers & an extra e-clip to make this the practical tire & wheel solution for Craftsman mowers with 15x6 00-6 front tires.From the manufacturer MARASTAR'S 15x6.00-6 air filled (pneumatic) front tire and wheel assembly is the perfect replacement for Craftsman Riding mowers with 15x6.00-6 tires (check your existing tires sidewall). You don’t need to change out an old tube or visit a professional tire shop, simply replace the entire old or damaged tire and wheel assembly with this one. Marastar’s easy to install replacement comes with a tube-type 4 ply rated tire with Turf Saver tread pre-mounted on dark gray powder-coated steel wheel with a 3” centered hub length, high-quality oil impregnated bushings installed and a grease fitting. Tire repair and replacement made easy - also included 3 x 0.08” thick washers and an extra e-clip to make this the practical tire and wheel solution for Craftsman mowers with 15x6.00-6 front tires. Read more "
    },
    {
      "docid": 831070,
      "title": "15x6.00-6\" Front Tire Assembly Replacement for 100 and 300 Series John Deere Riding Mowers - 2 pack",
      "text": "Product Description With Marastar’s 2 Pack - 15x6.00-6 air filled (pneumatic) front tire and wheel replacements for John Deere 100 and 300 series riding mowers you don’t need to insert a tube or use a professional tire shop; Simply replace the entire tire and wheel assemblies with these 4 ply rated tires that comes with Multi-Trac tread and are pre-mounted on yellow powder-coated steel wheels with 3” offset hub length, high-quality oil impregnated bushings installed and a grease fitting. Marastar has solved the hassle and costly task of repairing your John Deere’s riding mower tires by also including 1 x 1/4 wide sintered iron spacers, 2 x 0.08” thick washers and an extra e-clip to make this an easy install replacement option for D100 and D300 Series mowers.Marastar is a wholly-owned subsidiary of the Carlstar Group, a global manufacturer of original equipment and aftermarket specialty tires and wheels for the agriculture, construction, outdoor power equipment, powersports and high-speed trailer markets. The diverse portfolio of solutions are offered under several leading brands, including Carlisle tires and wheels, ITP tires and wheels, as well as Cragar, Black Rock and Unique wheels. Product Description With Marastar’s 2 Pack - 15x6.00-6 air filled (pneumatic) front tire and wheel replacements for John Deere 100 and 300 series riding mowers you don’t need to insert a tube or use a professional tire shop; Simply replace the entire tire and wheel assemblies with these 4 ply rated tires that comes with Multi-Trac tread and are pre-mounted on yellow powder-coated steel wheels with 3” offset hub length, high-quality oil impregnated bushings installed and a grease fitting. Marastar has solved the hassle and costly task of repairing your John Deere’s riding mower tires by also including 1 x 1/4 wide sintered iron spacers, 2 x 0.08” thick washers and an extra e-clip to make this an easy install replacement option for D100 and D300 Series mowers.Marastar is a wholly-owned subsidiary of the Carlstar Group, a global manufacturer of original equipment and aftermarket specialty tires and wheels for the agriculture, construction, outdoor power equipment, powersports and high-speed trailer markets. The diverse portfolio of solutions are offered under several leading brands, including Carlisle tires and wheels, ITP tires and wheels, as well as Cragar, Black Rock and Unique wheels.From the manufacturer #21423 #21424 #21428 #21456 #21426 #21427 For Tire Replacement 20 x 10.00-8 20 x 8.00-8 18 x 8.50-8 16 x 6.5-8 15 x 6.00-6 15 x 6.00-6 Use Mower - Rear Tire Mower-Rear Tire Mower - Rear Tire Mower - Front Tire Mower - Front Tire Mower - Front Tire Tire Diameter x Width 19.5 x 9.7 19.4 x 9.3 17.5 x 8.3 16.1 x 6.5 14.8 x 6.2 14.1 x 5.8 Hub 3.5\" offset 3.5\" offset 4 x 4 bolt 3\" centered 3\" offset 3\" offset Bore 3/4\" bore with 3/16\" keyway 3/4\" bore with 3/16\" keyway 4 lug 3/4\" bushing 3/4\" sintered bushing 3/4\" sintered bushing Tire Type Tubeless 4 ply Pneumatic Tubeless 4 ply Pneumatic Tubeless 4 ply Pnuematic Tubeless 4 ply Pneumatic 4 ply Pneumatic Tubeless 4 ply Pneumatic Wheel Yellow Steel Yellow Steel Yellow Steel Yellow Steel Yellow Steel Yellow Steel Capacity 1,200 lbs 965 lbs 825 lbs 615 lbs 570 lbs 400 lbs E-Clip Included - - - Replacement Assembly Tire for John Deere Riding Mowers John Deere Riding Mower Replacement Assembly Tires. You don’t need to insert a tube or visit a professional tire shop, simply replace the entire old or damaged tire and wheel assembly with this one. Marastar’s easy install replacement comes with a 4 ply rated tire with Multi-Trac tread pre-mounted on yellow powder-coated steel wheel Tire repair and replacement made easy! Marastar is a wholly-owned subsidiary of the Carlstar Group, a global manufacturer of original equipment and aftermarket specialty tires and wheels for the agriculture, construction, outdoor power equipment, powersports and high-speed trailer markets.Check your existing tire size/hub/bushing to ensure correct match for new tire. Read more "
    },
    {
      "docid": 1624211,
      "title": "Honda HRR Wheel Kit (2 Front 44710-VL0-L02ZB, 2 Back 42710-VE2-M02ZE)",
      "text": "Product Description Honda HRR Wheel Kit, Set of 4 Wheels. Product Description Honda HRR Wheel Kit, Set of 4 Wheels."
    },
    {
      "docid": 116997,
      "title": "Honda 44710-VG3-010 Front Wheels, (Set of 2)",
      "text": "Product Description Honda Front Wheels (Set of 2) PLEASE NOTE: Check your owner's manual to be sure 44710-VL0-L02ZB, 44710-VG3-000 is the correct replacement part for your mower model. Consult owner's manual for proper part number identification and proper installation. Product Description Honda Front Wheels (Set of 2) PLEASE NOTE: Check your owner's manual to be sure 44710-VL0-L02ZB, 44710-VG3-000 is the correct replacement part for your mower model. Consult owner's manual for proper part number identification and proper installation."
    },
    {
      "docid": 1399124,
      "title": "Carlisle Turf Saver Lawn & Garden Tire - 15X6-6 A",
      "text": "Product Description With its classic square shouldered design, the Turf Saver tire is the market leader for residential riding lawn mowers worldwide. The flat profile and chevron tread provide excellent traction. Its turf-friendly design and breadth of line make it versatile in both application and fitment. Product Description With its classic square shouldered design, the Turf Saver tire is the market leader for residential riding lawn mowers worldwide. The flat profile and chevron tread provide excellent traction. Its turf-friendly design and breadth of line make it versatile in both application and fitment.From the manufacturer Carlisle Turf Saver Lawn & Garden Tire - 15X6-6 A With its classic square shouldered design, the Turf Saver tire is the market leader for residential riding lawn mowers worldwide. The flat profile and chevron tread provide excellent traction. Its turf-friendly design and breadth of line make it versatile in both application and fitment. Product highlights: Square shoulders for increased stability Flat profile Chevron tread for enhanced traction Read more "
    },
    {
      "docid": 1035122,
      "title": "Oregon Universal Replacement Wheel 7-Inch x 1.50-Inch Diamond Tread (72-107)",
      "text": "Product Description Oregon replacement parts are built to meet or exceed OEM standards, creating an opportunity for you to maintain your mower each season with high quality replacement parts at a lower price. Product Description Oregon replacement parts are built to meet or exceed OEM standards, creating an opportunity for you to maintain your mower each season with high quality replacement parts at a lower price.From the brand Previous page Chainsaws, Chains, and Combos Visit the Store Sharpening and Essentials Visit the Store Blades and Trimmer Line Visit the Store Next page  "
    },
    {
      "docid": 932695,
      "title": "American Lawn Mower Company 1204-14 14-Inch 4-Blade Push Reel Lawn Mower, Red",
      "text": "Product Description Product Description American Lawn Mower Company 14-Inch 4-Blade Push Reel Lawn Mower is a green alternative to gas-powered lawnmowers. Moreover, this lawn mower is easy to use and does not emit fumes. It can cut your lawn in a precise scissor-like motion that will not shred your grass to make your lawn appear better. This reel lawn mower has a low maintenance, hassle-free design that only requires to be sharpened at least once every 3-5 years. Perfect for youths over the age of 13 and compact yards. When you buy it, you won’t have to worry about fuel, maintenance, and repairs that make this push blade mower a smart choice. From the Manufacturer Our brands are committed to a non-carbon foot print products and that has not changed since 1895. No fumes, no start up hassle! No spark plugs to foul or engines to clog up. They are good for the environment and your lawn. We provide the quality you need at the price that you want. Check out our product line, we offer the tools you will need to take care of all your lawn, garden, and winter needs. We have spent the last 120 years and we will continue to spend the next 120 years keeping America green. Product Description Product Description American Lawn Mower Company 14-Inch 4-Blade Push Reel Lawn Mower is a green alternative to gas-powered lawnmowers. Moreover, this lawn mower is easy to use and does not emit fumes. It can cut your lawn in a precise scissor-like motion that will not shred your grass to make your lawn appear better. This reel lawn mower has a low maintenance, hassle-free design that only requires to be sharpened at least once every 3-5 years. Perfect for youths over the age of 13 and compact yards. When you buy it, you won’t have to worry about fuel, maintenance, and repairs that make this push blade mower a smart choice. From the Manufacturer Our brands are committed to a non-carbon foot print products and that has not changed since 1895. No fumes, no start up hassle! No spark plugs to foul or engines to clog up. They are good for the environment and your lawn. We provide the quality you need at the price that you want. Check out our product line, we offer the tools you will need to take care of all your lawn, garden, and winter needs. We have spent the last 120 years and we will continue to spend the next 120 years keeping America green.From the manufacturer American Lawn Mower is committed to innovating planet-conscious lawn mowers for your outdoor needs. Since 1895, we have been creating lawn mowers, gardening cultivators, tillers, and other essential outdoor tools. For a greener environment, we aim to lessen the carbon footprint of day to day gardening activities. Opting for our products that do not emit harmful fumes can help our environment in the long run. Our products have a low-maintenance design that will save customers money on upkeep. Our 125 years of experience in designing and innovating greener product options can promise the quality and reliability of our products. Push manual lawn mower that is versatile enough to cut grass yet lightweight and maneuverable Quiet and planet-conscious lawnmower with a sturdy blade that can last for years The American Lawn Mower 14\" 4-Blade Push Reel Lawn Mower is an easy-to-use mechanical lawn mower that will cut grass up to 4 inches tall. The mower is easy to assemble and has blades that can be adjusted to help cut grass to the users' desired length. The durable cushioned handle is comfortable and gives users a perfect grip when in motion. The American Lawn Mower Reel Mower produces powerful cutting action without emitting harmful fumes into the environment. The planet-conscious mower is lightweight, low maintenance, and will make mowing the lawn easy. Versatile and non-powered lawn mower for every home Easy assembly and ease of use, maneuverability, lightweight The American Lawn Mower 14\" 4-Blade Push Reel Lawn Mower is a manual lawn mower that is easy to maneuver and can be assembled in less than ten minutes. The cushioned handles allow users to comfortably push the mower around the lawn. The mower is friendly to all age groups, even children can mow the lawn. After use the lightweight lawn mower can easily be carried up a few steps to the porch or stored in the shed. Years of value The American Lawn Mower 14\" 4-Blade Reel Mower is low maintenance, safe to use, and is made of sturdy material that will last for years. American Lawn Mower Push Reel Lawn mower only requires users sharpen the mower blades every 3-5 years. Forget about the regular maintenance that non-manual lawn mowers require this lawn mower is planet-conscious and will last for years. Natural, green, pollution/emission-free, noise-free American Lawn Mower provides users with green options that are quiet and emission-free. Choosing to use a natural push mower provides a form of exercise to users, and is better for their health. The American Lawn Mower Reel Mower produces powerful cutting action without emitting harmful fumes into the environment. Users can now mow their lawn and protect the environment at the same time Ideal for grass length of up to 4 inches The American Lawn Mower 14\" 4-Blade Push Reel Lawn Mower is a mechanical lawn mower that can cut grass up to 4 inches tall. The blades on this reel mower can be adjusted from 1” to 1.75” depending on preference. After using the American Lawn Mower 14\" 4-Blade Push Reel Lawn Mower, the even scissor action cut will leave your lawn looking better. Read more 1204-14 1304-14 1415-16 1815-18 Cutting Width 14 in. 14 in. 16 in. 18 in. Cutting Height 0.5-1.75 in. 1-2.25 in. 0.5-2.5 in. 1-2.75 in. Blades 4 5 5 5 Wheel Size 8.5 in. 10 in. 10 in. 10 in. Tool Free Assembly ✓ ✓ ✓ ✓ Weight 20 lbs 22.5 lbs 25 lbs 27 lbs Handle Style T-Handle T-Handle T-Handle Loop Handle "
    },
    {
      "docid": 580389,
      "title": "Craftsman 532403111 Mower Front Drive Wheels (Pack of 2)",
      "text": "Product Description (2) AYP Craftsman Mower Front Drive Wheels for 194231X460 NEW Product Description Brand New - Unused Parts Genuine, OEM, AYP Product Includes 2 Front Drive Wheels Item Specifications: Manufactured by Oregon to fit Craftsman AYP is the OEM manufacturer of Craftsman products Replaces part number 194231X427 8\" x 1.75\" Fits Craftsman models: 917376091 917370441 917379470 917376531 917371650 917376391 917255540 917254470 917254501 917254502 917254381 917254570 917254571 917254572 917254590 917254591 917364250 917370400 917370401 917370410 917370411 917370412 917370413 917370414 917370415 917370430 917370431 917370432 917370433 917370434 917370600 917370601 Product Description (2) AYP Craftsman Mower Front Drive Wheels for 194231X460 NEW Product Description Brand New - Unused Parts Genuine, OEM, AYP Product Includes 2 Front Drive Wheels Item Specifications: Manufactured by Oregon to fit Craftsman AYP is the OEM manufacturer of Craftsman products Replaces part number 194231X427 8\" x 1.75\" Fits Craftsman models: 917376091 917370441 917379470 917376531 917371650 917376391 917255540 917254470 917254501 917254502 917254381 917254570 917254571 917254572 917254590 917254591 917364250 917370400 917370401 917370410 917370411 917370412 917370413 917370414 917370415 917370430 917370431 917370432 917370433 917370434 917370600 917370601"
    }
  ],
  "negative_passages": [
    {
      "docid": 689593,
      "title": "NEIKO 20601A 14.5” Steel Tire Spoons Tool Set, Tire Tools Include 3 Piece Tire Spoons, 3 Piece Rim Protector, Valve Tool, 6 Piece Valve Cores, Motorcycle Tire Changer, Dirt Bike Tire Levers",
      "text": "Product Description 20601A Neiko Tire Spoons Rim Protector and Valve Tool Set is the perfect tool for any mechanics, homeowners, or DIY-ers! Whether you’re working on a car or motorcycle, this complete package of tools is great for removing damaged tires. The set not only includes one, but three flexible rim guards to prevent any damage to the rims while using the tire spoons. As an added BONUS, the set includes 6 Brass Schrader Valve Cores for convenience. Product Features: - Tire spoons are constructed of high quality Hardened Steel-Iron for ultimate durability/strength - Chrome polish finish that protects the tool from rust/corrosion and allows for hassle-free cleaning - Curved tips allow for easy insertion to any and all applications - Extra long length lever at 14.5 inches to easily prop out damaged tires without using extra force - Ergonomic, contoured, rubberized groove handle provides a natural non-slip grip while reducing hand fatigue and maximizing leverage power - 4 point valve tool with mouth side for attachments of various bits, deflation needle side that can be used to deflate the needle or remove stuck rocks in tire grooves, valve core side for quick removal and installation of valve core stems, and the screw thread side to easily clean the threads of the wheel stems Product Description 20601A Neiko Tire Spoons Rim Protector and Valve Tool Set is the perfect tool for any mechanics, homeowners, or DIY-ers! Whether you’re working on a car or motorcycle, this complete package of tools is great for removing damaged tires. The set not only includes one, but three flexible rim guards to prevent any damage to the rims while using the tire spoons. As an added BONUS, the set includes 6 Brass Schrader Valve Cores for convenience. Product Features: - Tire spoons are constructed of high quality Hardened Steel-Iron for ultimate durability/strength - Chrome polish finish that protects the tool from rust/corrosion and allows for hassle-free cleaning - Curved tips allow for easy insertion to any and all applications - Extra long length lever at 14.5 inches to easily prop out damaged tires without using extra force - Ergonomic, contoured, rubberized groove handle provides a natural non-slip grip while reducing hand fatigue and maximizing leverage power - 4 point valve tool with mouth side for attachments of various bits, deflation needle side that can be used to deflate the needle or remove stuck rocks in tire grooves, valve core side for quick removal and installation of valve core stems, and the screw thread side to easily clean the threads of the wheel stemsFrom the manufacturer Read more Premium Tire Changing Tool Kit Quality Construction The hardened steel iron construction through out the lever shaft to the curved tips, yield the ultimate in strength and durability that gives this tool set supreme effectiveness when tire changing. What's Included: 3 Piece - Hardend Steel-Iron Tire Spoon Levers 3 Piece - Rim Protectors 1 Piece - 4-Way Valve Tool 6 Piece - Brass Schrader Valve Cores Read more Rust Resistant With a polished chrome finish, you don't need to worry about your tire spoons getting rust on them. Longer Reach At 14.5 inches long, you can gain the leverage and utilize the force needed on your tires with ease! Ergonomics The rubber grip is ergonomically designed for comfort and control, and allows you to maximize your leverage. 4-Way Valve Tool and 6 Valve Cores Included With the 4-Way valve tool, you have a clean thread, valve core remover, deflation needle and tapping mouth, all-in-one, in addition to 6 brass valve cores all included. Read more Read more "
    },
    {
      "docid": 1117073,
      "title": "Kenda Schwinn Tire",
      "text": "Product Description The Kenda K23 S-6 tire is a great replacement tire for older 3-speed Schwinn bicycles. 26\" x 1 3/8\" x 1 1/4\" (37-597 ISO) size. This is an obscure size found on some Schwinn bicycles from the 1960's and 70's. This tire is NOT compatible with 26\" x 1 3/8\" (590 ISO) rims, nor with 26\" (559 ISO) mountain bike rims. Match the ISO measurement on the sidewall of your current tire for proper compatability. Product Description The Kenda K23 S-6 tire is a great replacement tire for older 3-speed Schwinn bicycles. 26\" x 1 3/8\" x 1 1/4\" (37-597 ISO) size. This is an obscure size found on some Schwinn bicycles from the 1960's and 70's. This tire is NOT compatible with 26\" x 1 3/8\" (590 ISO) rims, nor with 26\" (559 ISO) mountain bike rims. Match the ISO measurement on the sidewall of your current tire for proper compatability.From the manufacturer KENDA. DESIGNED FOR YOUR JOURNEY On the road, on the trail or on the racetrack, you can count on Kenda quality. Our tires are engineered for performance and value across a wide range of interests and applications. See why Kenda is the right choice. It's your move. "
    },
    {
      "docid": 507005,
      "title": "NEIKO 20600A Tire Spoon Levers, Repair Tool Kit, 11 1/2-Inch Hardened Steel Irons, 2 Rim Protectors, 5-Piece Tire Levers Set, Tire Changing Tool, Small Tire Tools",
      "text": "Product Description NEIKO presents our Tire Spoon Levers for all your tire-replacement needs! This 5-piece set comes with 3 tire spoons and 2 rim protectors. Each spoon has a polished chrome finish that makes the metal easy to insert into your tires, and each rim protector in this car and motorcycle tool kit is made with a flexible polypropylene material that protects your rims. Our tire spoons save you frustration while changing a tire because of the minimal amount of force and energy required to use them. The contoured and rubberized handle on each spoon allows a firm grip and prevents fatigue to your hands. To use, place the rim protectors over your rims on the section of tire you’re working on and insert the spoons to leverage the rubber tire off the rim. A brass-grommet hanging bag is included with the kit for easy storage. You can transport these car and bike tire levers easily from job to job, and you can hang these tire tools in your garage when they’re not being used. Removing damaged tires is simple and efficient when you have the right kit, and these tire spoons make that process quick and painless. Whether you need this car and motorcycle tire-changer kit to replace old tires or you just need new equipment for your automotive tool collection, NEIKO has your back with our durable, dependable, and strong tools. Product Description NEIKO presents our Tire Spoon Levers for all your tire-replacement needs! This 5-piece set comes with 3 tire spoons and 2 rim protectors. Each spoon has a polished chrome finish that makes the metal easy to insert into your tires, and each rim protector in this car and motorcycle tool kit is made with a flexible polypropylene material that protects your rims. Our tire spoons save you frustration while changing a tire because of the minimal amount of force and energy required to use them. The contoured and rubberized handle on each spoon allows a firm grip and prevents fatigue to your hands. To use, place the rim protectors over your rims on the section of tire you’re working on and insert the spoons to leverage the rubber tire off the rim. A brass-grommet hanging bag is included with the kit for easy storage. You can transport these car and bike tire levers easily from job to job, and you can hang these tire tools in your garage when they’re not being used. Removing damaged tires is simple and efficient when you have the right kit, and these tire spoons make that process quick and painless. Whether you need this car and motorcycle tire-changer kit to replace old tires or you just need new equipment for your automotive tool collection, NEIKO has your back with our durable, dependable, and strong tools.From the manufacturer Read more Premium Quality Construction Prying Power and Efficiency Tire spoons are constructed from hardened steel for ultimate durability and strength to give you more value by making the job a breeze. The curved tips allow for easy insertion for quick and efficient tire repair. Easy to Clean With a polished chrome finish, each tire spoon provides a beautiful finish that is easy to wipe and clean off any residual dirt or grime. The finish also facilitates non-marring while repairing your tires. Convenient Storage Each kit contains a storage bag, so you can quickly organize your tire spoons while featuring hanging grommets to allow you to store on peg board walls with hooks when not in use. What's Included: 3 Pcs of Hardened Steel Tire Spoon Levers 2 Pcs of Rim Protector Sheaths 1 Pc of a Hanging Grommet Storage Bag Read more Product Highlights Superior Leverage The long length of each tire spoon allows you to easily prop out damaged tires without putting in extra work. These tire levers are engineered to remove tires, so let them work for you! Flexible Rim Protector Sheaths Each set includes two rim guards that are made out of flexible, yet durable polypropylene that will prevent any damage to your wheels/rims to save you dollars. Ergonomic Handles The tire lever spoons come equipped with a soft rubberized handle that provides a comfortable and secure grip allowing for leverage and maximum force output. Read more Here's the Breakdown: Motorcyle Tire Use Yes Dirt Bike Tire Use Yes Lawn Mower Tire Use Yes Garden Tractor Tire Use Yes Kayak Transporter Tire Use Yes Bicycle Tire Use Yes Other Small Tire Use Yes "
    },
    {
      "docid": 341130,
      "title": "Dr.Roc Tire Spoon Lever Dirt Bike Lawn Mower Motorcycle Tire Changing Tools with Durable Bag 3 Tire Irons 2 Rim Protectors 1 Valve Stems Set TR412 TR413",
      "text": "Product Description Easy tire spoons to change your motorcycle,dirtbike,lawn mower,garden tractor,kayak transporter and other small tires like wheel barrow tires etc Specifications: Length:11\" (280mm) Weight:480g Finish: Beautiful polished chrome finish Useful tire tool to change the tire of motorcycles/dirt bikes/lawn mower/atv and other small tires like wheel barrow tires Easy Grip Handle:Nice handles,nice distinction from most other levers,Anti-skid Anti- hand Materials: Heavy duty weather and rust-resistant strong automotive grade drop forged steel Useful motorcycle tire changing tools:11\"(280mm) ,set of 3 tire irons .Ensure works great on atv,motorcycle,dirtbike tires,removing and reinstalling small tires with minimal fuss Being chromed and smooth rounded edges on the tire spoons ensure the tire bead to roll off the rim,without pinching your tire and the rim Very Solidly Built:Even strong enough to break the bead on your tire Product Description Easy tire spoons to change your motorcycle,dirtbike,lawn mower,garden tractor,kayak transporter and other small tires like wheel barrow tires etc Specifications: Length:11\" (280mm) Weight:480g Finish: Beautiful polished chrome finish Useful tire tool to change the tire of motorcycles/dirt bikes/lawn mower/atv and other small tires like wheel barrow tires Easy Grip Handle:Nice handles,nice distinction from most other levers,Anti-skid Anti- hand Materials: Heavy duty weather and rust-resistant strong automotive grade drop forged steel Useful motorcycle tire changing tools:11\"(280mm) ,set of 3 tire irons .Ensure works great on atv,motorcycle,dirtbike tires,removing and reinstalling small tires with minimal fuss Being chromed and smooth rounded edges on the tire spoons ensure the tire bead to roll off the rim,without pinching your tire and the rim Very Solidly Built:Even strong enough to break the bead on your tire"
    },
    {
      "docid": 1013313,
      "title": "Carlisle X Trac ATV Bias Tire - 15x5.00-6 (without RIM)",
      "text": "Product Description Carlisle X Trac ATV Bias Tire - 15x5.00-6 (without RIM) Product Description Carlisle X Trac ATV Bias Tire - 15x5.00-6 (without RIM)"
    },
    {
      "docid": 150187,
      "title": "Mophorn Tire Mount Demount Tool 22.5\" to 24.5\" Tire Changer Steel Bead Breaker Extra Bead Keeper Tubeless Truck Manual Tire Changing Tools for Car Repairing(Blue)",
      "text": "From the brand Professional Tire Change Tools VEVOR offers different tire changing tools covering wider tire sizes, choose the right tools Previous page Premium Tough Quality Cost-effective Products Fast & Secure Transport 24/7 Attentive Support Good Helper In Life Repair the tires at home for daily maintenance, or use the bead breaker to solve unexpected problems when on the road Tire Bead Breaker Visit the Store Next page Product Description 3 PCS Tire Mount & Demount Tools 22.5\"-24\" Tires & Heavy-duty Construction & Easy to Operate Nothing is worse than being stranded in the middle of nowhere. Our tire change tools can let you change heavy tires easily and quickly. It can accommodate the majority of sizes of tires, so you don't need to worry about compatibility. Drop-forged 40Mn and powder-coated Q235B construction make it friction-proof and crush-proof. In addition, the detailed design will improve the user's experience. With the help of the tire mount and demount tools, you can get back on the road again in no time. Perfectly fit for 22.5\"-24\" Hubs Solid Construction for a Solid Change Operate without Sweat Ergonomic Designs for Comfort Key Features Accommodate with Most Tires This truck tire changer is designed for hubs measuring 22.5-inch to 24.5-inch in diameter. It can fit most tires in the market, such as trucks, coaches, and trailers. Strong to Any Challenge Our tire changer is constructed of rust-proof drop-forged 40Mn and powder-coated Q235B, offering you optimized strength and maximum durability. 3 PCS Tires Mount Demount Tool With our 3 PCS tire changer set, you don't need to lift the rim to remove the bottom bead, helping you loosen the tire bead from the rim without breaking a sweat. Read more "
    },
    {
      "docid": 1581692,
      "title": "Dr.Roc 14.5 inch Perfect Leverage Tire Spoon Lever Iron Tool Kit Motorcycle Dirt Bike Lawn Mower Professional Tire Changing Tool with Durable Bag 3 PCS Tire Spoons with Tire Valve Stem TR412 TR413",
      "text": "Product Description Dr.Roc 14.5\" Tire Spoon Lever Tool-The Best Tire Iron For Tire Changing The best motorcycle tire changing tools in the market,also it is fit for atv tires,dirt bike tire,lawn mower tire,tractor tire ,kayak transporter, snow blower and other small tires like wheel barrow tires etc Specifications: Length:14.5\" (370mm) Weight:580g Finish: Beautiful polished chrome finish Use to Change the tire of motorcycles/dirtbike/lawn mower and other small tires like wheel barrow tires Easy Grip Handle Tire changing tool:Nice handles,nice distinction from most other tire levers,Anti-skid Anti- hand Materials: Heavy duty weather and rust-resistant strong automotive grade drop forged steel Useful Tire Tool:14.5\"(370mm) ,set of 3 tire removal tools.Ensure works great on atv tires,motorcycle tires and dirt bike tires,remove and reinstall motorcycle tires with minimal fuss Being chromed and smooth rounded edges on the tire spoons ensure the tire bead to roll off the rim,without pinching your tire and the rim Very Solidly Built Tire Iron set:Even strong enough to break the bead on your tire Why Dr.Roc 14.5\" Tire Lever: Our 14.5\" Tire Iron Set overcome almost all defects of other tire lever,such as: 1. Comparing with 11\"( 280mm) Tool:Our tire spoons provide better leverage to change tires 2. Comparing with flat Tire Lever Tool:our tire irons will not be bent and pinching your tire and rim 3. Comparing with most of other tools:The handle is more easy ,more friendly and strong Product Description Dr.Roc 14.5\" Tire Spoon Lever Tool-The Best Tire Iron For Tire Changing The best motorcycle tire changing tools in the market,also it is fit for atv tires,dirt bike tire,lawn mower tire,tractor tire ,kayak transporter, snow blower and other small tires like wheel barrow tires etc Specifications: Length:14.5\" (370mm) Weight:580g Finish: Beautiful polished chrome finish Use to Change the tire of motorcycles/dirtbike/lawn mower and other small tires like wheel barrow tires Easy Grip Handle Tire changing tool:Nice handles,nice distinction from most other tire levers,Anti-skid Anti- hand Materials: Heavy duty weather and rust-resistant strong automotive grade drop forged steel Useful Tire Tool:14.5\"(370mm) ,set of 3 tire removal tools.Ensure works great on atv tires,motorcycle tires and dirt bike tires,remove and reinstall motorcycle tires with minimal fuss Being chromed and smooth rounded edges on the tire spoons ensure the tire bead to roll off the rim,without pinching your tire and the rim Very Solidly Built Tire Iron set:Even strong enough to break the bead on your tire Why Dr.Roc 14.5\" Tire Lever: Our 14.5\" Tire Iron Set overcome almost all defects of other tire lever,such as: 1. Comparing with 11\"( 280mm) Tool:Our tire spoons provide better leverage to change tires 2. Comparing with flat Tire Lever Tool:our tire irons will not be bent and pinching your tire and rim 3. Comparing with most of other tools:The handle is more easy ,more friendly and strong"
    },
    {
      "docid": 1340952,
      "title": "Growler Tire 26 x 2.125 Inch Tire Replacement Kits with or Without Inner Tubes. Includes Tools. Fits Bicycles with 26 x 1.75 or 26 x 2.125 Rim or Wheels.",
      "text": "Product Description Eastern Bikes Premium Tire Kit for 26 Inch Wheels and Rims. Multi Surface Tread Pattern is an Ideal Replacement For Street, Packed Gravel , Hybrid , Beach Cruiser , Road , City , Commuter and Urban MTB Bike Use. Available in 1 or 2 Pack Repair Kits with or without Inner Tubes , and Installation Tools. Fits 26 inch x 1.75 – 2.125 inch Wheelset and Rim Size. Product Description Eastern Bikes Premium Tire Kit for 26 Inch Wheels and Rims. Multi Surface Tread Pattern is an Ideal Replacement For Street, Packed Gravel , Hybrid , Beach Cruiser , Road , City , Commuter and Urban MTB Bike Use. Available in 1 or 2 Pack Repair Kits with or without Inner Tubes , and Installation Tools. Fits 26 inch x 1.75 – 2.125 inch Wheelset and Rim Size."
    },
    {
      "docid": 151288,
      "title": "Growler Tire 26 x 2.125 Inch Tire Replacement Kits with or Without Inner Tubes. Includes Tools. Fits Bicycles with 26 x 1.75 or 26 x 2.125 Rim or Wheels.",
      "text": "Product Description Eastern Bikes Premium Tire Kit for 26 Inch Wheels and Rims. Multi Surface Tread Pattern is an Ideal Replacement For Street, Packed Gravel , Hybrid , Beach Cruiser , Road , City , Commuter and Urban MTB Bike Use. Available in 1 or 2 Pack Repair Kits with or without Inner Tubes , and Installation Tools. Fits 26 inch x 1.75 – 2.125 inch Wheelset and Rim Size. Product Description Eastern Bikes Premium Tire Kit for 26 Inch Wheels and Rims. Multi Surface Tread Pattern is an Ideal Replacement For Street, Packed Gravel , Hybrid , Beach Cruiser , Road , City , Commuter and Urban MTB Bike Use. Available in 1 or 2 Pack Repair Kits with or without Inner Tubes , and Installation Tools. Fits 26 inch x 1.75 – 2.125 inch Wheelset and Rim Size."
    },
    {
      "docid": 1143956,
      "title": "Nuetech Tubliss Gen 2.0 (Tubeless) Tire System 18''",
      "text": "Product Description It's hard to find a good balance between the traction of low tire pressure and reducing the risk of pinch flats. Many riders opt for heavy tubes or mousses, but the Nuetech Tubliss Gen 2.0 Tire System is a relatively new solution that uses a clever design to eliminate pinch flats, bad traction, and tubes entirely. The Tubliss System works by replacing your conventional inner tube with a smaller, higher pressure insert that hugs the inside of your rim. This creates two separate pressure areas inside your tire. One area inside the high pressure insert, and another lower-pressure area that fills the rest of your tire where your old tube used to be. Inflate the high-pressure insert and it locks the bead in place, forming a seal against the rim and acting like a bumper that protects the rim from impact. With the high-pressure insert filled, the lower-pressure area can be inflated like a traditional tubeless tire you would find on a car. With the Tubliss Tire System installed there are no tubes to pinch, plug kits are a more viable repair option, and you can run much lower psi without your bead rolling off since the high pressure air chamber will still have it locked down. Plenty of riders swear by the Tubliss System and for many enduro, GNCC, or off-road riders it's a great alternative to a traditional setup. Watch our video above for more detailed information on the Nuetech Tubliss Gen 2.0 Tire System and see if it will work for you. Product Description It's hard to find a good balance between the traction of low tire pressure and reducing the risk of pinch flats. Many riders opt for heavy tubes or mousses, but the Nuetech Tubliss Gen 2.0 Tire System is a relatively new solution that uses a clever design to eliminate pinch flats, bad traction, and tubes entirely. The Tubliss System works by replacing your conventional inner tube with a smaller, higher pressure insert that hugs the inside of your rim. This creates two separate pressure areas inside your tire. One area inside the high pressure insert, and another lower-pressure area that fills the rest of your tire where your old tube used to be. Inflate the high-pressure insert and it locks the bead in place, forming a seal against the rim and acting like a bumper that protects the rim from impact. With the high-pressure insert filled, the lower-pressure area can be inflated like a traditional tubeless tire you would find on a car. With the Tubliss Tire System installed there are no tubes to pinch, plug kits are a more viable repair option, and you can run much lower psi without your bead rolling off since the high pressure air chamber will still have it locked down. Plenty of riders swear by the Tubliss System and for many enduro, GNCC, or off-road riders it's a great alternative to a traditional setup. Watch our video above for more detailed information on the Nuetech Tubliss Gen 2.0 Tire System and see if it will work for you."
    },
    {
      "docid": 932091,
      "title": "Shaluoman WR8 Tarmac Wheel with Tires for HPI Rally Off-Road WR8 Tyres Pack of 4 Black",
      "text": "Product Description Description: Name:Wheel Rim & Rubber Tires Rubber Tires : Outer Diameter: 80 mm Tyres Wide:35mm Plastic Materials Wheel Rims: Inner Diameter: 53 mm Wheel Drive Hex: 12 mm Have foam inserts Note Front and Rear the size is the same Tires, rims without adhesive, You can be split. Package Contents: Quantity: tires x4pcs+wheel x4pcs Product Description Description: Name:Wheel Rim & Rubber Tires Rubber Tires : Outer Diameter: 80 mm Tyres Wide:35mm Plastic Materials Wheel Rims: Inner Diameter: 53 mm Wheel Drive Hex: 12 mm Have foam inserts Note Front and Rear the size is the same Tires, rims without adhesive, You can be split. Package Contents: Quantity: tires x4pcs+wheel x4pcs"
    },
    {
      "docid": 41624,
      "title": "Nuetech Tubliss Tubeless Tire System Gen 2 21\" Wheel Mx Offroad Dirt bike 21",
      "text": "Product Description Tube replacement kit for tube-type motorcycle tiresHigh pressure rim lock and seal secures the entire tire bead to the rimFull circumference pneumatic rim lock completely eliminates the use of a conventional tubeAllows you to run a low tire pressure (as low as 10 psi) which dramatically improves tractionPinched tubes and flats are over; even if you get a tire puncture, the bead stays seated to the rim100 psi inner bladder clamps the entire bead and side wall of the tire to the rimProvides full bead lock performance around the full circumference of the rimProtects the rim from dings and dents by holding the tire firmly and making the sidewalls stay upright and absorb the full impactSeal is formed against the inside of the tire itself, not the rimHolds the tire firmly and makes the sidewalls stay upright and absorb the full impact, unlike bending and deflection you get with conventional tubesWill even work with the most dented, dinged, or tweaked rimSecures the bead so securely that it allows a low tire pressure for improved straight line traction without the risk of a pinch flat or tire bead slippageVirtually flat proof when used with a tire sealantSealants works directly on the Product Description Tube replacement kit for tube-type motorcycle tiresHigh pressure rim lock and seal secures the entire tire bead to the rimFull circumference pneumatic rim lock completely eliminates the use of a conventional tubeAllows you to run a low tire pressure (as low as 10 psi) which dramatically improves tractionPinched tubes and flats are over; even if you get a tire puncture, the bead stays seated to the rim100 psi inner bladder clamps the entire bead and side wall of the tire to the rimProvides full bead lock performance around the full circumference of the rimProtects the rim from dings and dents by holding the tire firmly and making the sidewalls stay upright and absorb the full impactSeal is formed against the inside of the tire itself, not the rimHolds the tire firmly and makes the sidewalls stay upright and absorb the full impact, unlike bending and deflection you get with conventional tubesWill even work with the most dented, dinged, or tweaked rimSecures the bead so securely that it allows a low tire pressure for improved straight line traction without the risk of a pinch flat or tire bead slippageVirtually flat proof when used with a tire sealantSealants works directly on the"
    },
    {
      "docid": 912582,
      "title": "RTX, Steel Rim, New Aftermarket Wheel, 15X6, 5X114.3, 67.1, 45, black finish X45567",
      "text": "Product Description This NEW aftermarket Steel Rim / Wheel is perfect for replacement wheel, spare tire / rim or full wheel swap. Black RTX Steel Rim. Diameter: 15in, width: 6in, bolt pattern: 5-114.3, center bore: 67.1, offset: +45 (positive offset), Load Range 525kg / 1157lbs. This rim / wheel fits 15\" tires. Please check the tire size you will be installing on this rim prior to purchase.***This listing is for a single wheel. If you need a full set of four (4) rims, you need to buy four (4) items. *Compatibility with the OEM wheel covers is not guaranteed. *These rims are centered by the studs, they are lugcentric not hubcentric (oversized center hole for most applications)*** All RTX steel rims / wheels are tested and approved to meet or exceed Certified Quality Standards. Product Description This NEW aftermarket Steel Rim / Wheel is perfect for replacement wheel, spare tire / rim or full wheel swap. Black RTX Steel Rim. Diameter: 15in, width: 6in, bolt pattern: 5-114.3, center bore: 67.1, offset: +45 (positive offset), Load Range 525kg / 1157lbs. This rim / wheel fits 15\" tires. Please check the tire size you will be installing on this rim prior to purchase.***This listing is for a single wheel. If you need a full set of four (4) rims, you need to buy four (4) items. *Compatibility with the OEM wheel covers is not guaranteed. *These rims are centered by the studs, they are lugcentric not hubcentric (oversized center hole for most applications)*** All RTX steel rims / wheels are tested and approved to meet or exceed Certified Quality Standards."
    },
    {
      "docid": 494544,
      "title": "RTX, Steel Rim, New Aftermarket Wheel, 15X6, 5X100, 54.1, 39, black finish X45921",
      "text": "Product Description This NEW aftermarket Steel Rim / Wheel is perfect for replacement wheel, spare tire / rim or full wheel swap. Black RTX Steel Rim. Diameter: 15in, width: 6in, bolt pattern: 5-100, center bore: 54.1, offset: +39 (positive offset), Load Range 550kg / 1213lbs. This rim / wheel fits 15\" tires. Please check the tire size you will be installing on this rim prior to purchase.***This listing is for a single wheel. If you need a full set of four (4) rims, you need to buy four (4) items. *Compatibility with the OEM wheel covers is not guaranteed. *These rims are centered by the studs, they are lugcentric not hubcentric (oversized center hole for most applications)*** All RTX steel rims / wheels are tested and approved to meet or exceed Certified Quality Standards. Product Description This NEW aftermarket Steel Rim / Wheel is perfect for replacement wheel, spare tire / rim or full wheel swap. Black RTX Steel Rim. Diameter: 15in, width: 6in, bolt pattern: 5-100, center bore: 54.1, offset: +39 (positive offset), Load Range 550kg / 1213lbs. This rim / wheel fits 15\" tires. Please check the tire size you will be installing on this rim prior to purchase.***This listing is for a single wheel. If you need a full set of four (4) rims, you need to buy four (4) items. *Compatibility with the OEM wheel covers is not guaranteed. *These rims are centered by the studs, they are lugcentric not hubcentric (oversized center hole for most applications)*** All RTX steel rims / wheels are tested and approved to meet or exceed Certified Quality Standards."
    },
    {
      "docid": 476,
      "title": "lovermusic 4PCS 1/16 RC Crawler Truck Off Roader Rubber Tires and Rims, 3.35x1.65inch Rock Climbing Tires",
      "text": "Product Description Feature: 1.The tire is mainly made of plastic and rubber, the product is of good quality, durable, not easy to damage, and has a long service life. 2.The diameter of the tire including the tread is 85mm, the width is 42mm, the inner diameter is 52mm, and the adapter is 12mm. 3.It is convenient and quick to use and install, and it is a good replacement to replace old and broken products, saving you money and time in repairing model cars. 4.The product has good compatibility and has lasting and effective performance. Replacing the old does not affect the overall use effect. It is suitable for various RC 1:16 model cars. 5.The installation is simple and convenient, without too many complicated installation steps, it can be installed according to your needs, and it is suitable for the model car you need. Specifications: Material: Plastic & Rubber Color: Black Inner Dia:5.2cm/2.05inch Thickness:4.2cm/1.65inch Outer Dia:8.5cm/3.35inch(Including tread) Dia:8cm/3.15inch(Does not include tread) Weight: 172g Package include: 4 x RC Car Wheel Rims & Tyres Product Description Feature: 1.The tire is mainly made of plastic and rubber, the product is of good quality, durable, not easy to damage, and has a long service life. 2.The diameter of the tire including the tread is 85mm, the width is 42mm, the inner diameter is 52mm, and the adapter is 12mm. 3.It is convenient and quick to use and install, and it is a good replacement to replace old and broken products, saving you money and time in repairing model cars. 4.The product has good compatibility and has lasting and effective performance. Replacing the old does not affect the overall use effect. It is suitable for various RC 1:16 model cars. 5.The installation is simple and convenient, without too many complicated installation steps, it can be installed according to your needs, and it is suitable for the model car you need. Specifications: Material: Plastic & Rubber Color: Black Inner Dia:5.2cm/2.05inch Thickness:4.2cm/1.65inch Outer Dia:8.5cm/3.35inch(Including tread) Dia:8cm/3.15inch(Does not include tread) Weight: 172g Package include: 4 x RC Car Wheel Rims & Tyres"
    },
    {
      "docid": 797667,
      "title": "Tire Mounting & Demounting Liquid Lubricant Tack & Bead Sealing Lube for Cars, Bikes, Trucks, ATV, Camper Wheels - Reduce Rim Sliding, Rust - Super Slick Liquid Lubrication, Leak Detector (1 Gallon)",
      "text": "Product Description This liquid tire changing lubricant is formulated to greatly reduce friction and bead damage, which can happen when you are prying your car's tire off from the rim. Enjoy excellent tack and bead sealing with this tire-changing lubricant. It helps to change tools slide under your tire, smoothly breaking it free from the rim while protecting against scuffs and damage. Just apply the solution using a brush or spray it on. It will also ensure that your tire beads sit perfectly on the rim, saving you time and effort whenever your car's wheels need to be changed. Read more Read more 1 Gallon 2 Gallon Ready to Use ✓ ✓ Premium Quality ✓ ✓ Made in USA ✓ ✓ "
    },
    {
      "docid": 1263135,
      "title": "18x8.50-8 GTX OEM Golf Cart BLACK Wheels and Golf Cart Tires Combo - Set of 4",
      "text": "Product Description Fits all EZGO, Yamaha and Club Car carts without a lift kit! Clean up the look of your cart or replace those damaged rims today. This wheel and tire combo kit will perfectly replace your OEM golf cart wheels. Features a universal 8\" BLACK steel wheel and 18x8.5-8 size tires. Just mount on and go! The 18x8.5-8\" tire provides great traction in the rain or shine. This combo is the best choice for original equipment (OEM) replacement on golf carts. TECH SPECS: Tire size: 18x8.5-8 Tire height (ground to top of tire): 18 inches DOT Approved? YES Turf Safe? YES Ply Rating: 4 ply Load Rating: 815 lbs @ 22 PSI Wheel Offset: Centered (3.5 + 3.5) Bolt Pattern: 4x4 (101.6mm) Product Description Fits all EZGO, Yamaha and Club Car carts without a lift kit! Clean up the look of your cart or replace those damaged rims today. This wheel and tire combo kit will perfectly replace your OEM golf cart wheels. Features a universal 8\" BLACK steel wheel and 18x8.5-8 size tires. Just mount on and go! The 18x8.5-8\" tire provides great traction in the rain or shine. This combo is the best choice for original equipment (OEM) replacement on golf carts. TECH SPECS: Tire size: 18x8.5-8 Tire height (ground to top of tire): 18 inches DOT Approved? YES Turf Safe? YES Ply Rating: 4 ply Load Rating: 815 lbs @ 22 PSI Wheel Offset: Centered (3.5 + 3.5) Bolt Pattern: 4x4 (101.6mm)"
    },
    {
      "docid": 1045196,
      "title": "GLOBACT RC Tires for 1/10 Short Course Truck Tires for Traxxas Slash 4x4 2WD HSP Tamiya HPI Kyosho Redcat AXIAL RC4WD Model Car（4Pcs/Set） Replace 5883/5883A",
      "text": "Product Description 4Pcs 1/10 Wear-resistant Crush-resistant Short Course Truck Tyres for Traxxas HSP Tamiya HPI Kyosho RC Model Car. Features: High Crush-resistant, made of high quality rubber and durable in use,High Wear-resistant Suit for 1:10 Short Course Truck Traxxas HSP Tamiya HPI Kyosho RC Model Car The tire and wheel can be dissembled separately This is an accessory product for Traxxas HPS HPI RC Car . If any question, please tell us without hesitation Specifications: 4Pcs/Set 1/10 Short Course Truck Tyres. Wheel Rim Diameter: 74mm Wheel Rim Drive Hex: 12mm Nut Fixed Hole: 4mm Tyre Material: Rubber Tyre Diameter: 108mm Tyre Width: 43mm Tyre Weight: 105g/1pcs Package information: Package size: 21 * 21 * 4 cm / 8.2 * 8.2 * 1.6 in Package weight: 441g / 15.5 oz Adhesive taps package Note: there's some little error from human measuring. Package list: 4Pcs * Short Course Truck Tyres Note: Before using the tire, the tire should be fixed with glue to avoid separation of the tire from the wheel hub during use. Product Description 4Pcs 1/10 Wear-resistant Crush-resistant Short Course Truck Tyres for Traxxas HSP Tamiya HPI Kyosho RC Model Car. Features: High Crush-resistant, made of high quality rubber and durable in use,High Wear-resistant Suit for 1:10 Short Course Truck Traxxas HSP Tamiya HPI Kyosho RC Model Car The tire and wheel can be dissembled separately This is an accessory product for Traxxas HPS HPI RC Car . If any question, please tell us without hesitation Specifications: 4Pcs/Set 1/10 Short Course Truck Tyres. Wheel Rim Diameter: 74mm Wheel Rim Drive Hex: 12mm Nut Fixed Hole: 4mm Tyre Material: Rubber Tyre Diameter: 108mm Tyre Width: 43mm Tyre Weight: 105g/1pcs Package information: Package size: 21 * 21 * 4 cm / 8.2 * 8.2 * 1.6 in Package weight: 441g / 15.5 oz Adhesive taps package Note: there's some little error from human measuring. Package list: 4Pcs * Short Course Truck Tyres Note: Before using the tire, the tire should be fixed with glue to avoid separation of the tire from the wheel hub during use."
    },
    {
      "docid": 369964,
      "title": "ELITEWHEELS Road Bike Carbon Wheels 700c Clincher 38/50/60/88mm Carbon Wheelset Tubeless Ready Cycling Wheel U Shape",
      "text": "Product Description RIM Details For 27mm width wheels,they can fit 25C-28C tires,the best match would be 25C tires. Rim Finish: UD Matte Rim Braking Surface: UD Rim Type: Tubeless Compatible Clincher Rim Size: 700C Rim Depth: 38mm 40mm 45mm 50mm 60mm 88mm Rim inner Width: 15.6mm 17mm 18.5mm 19.5mm Rim outer Width: 25mm 27mm 28mm 29mm Rim Holes:front 20 holes + rear 24 holes HUB Details Hub: P08 Front:QR/100mm Rear:QR/130mm 20-24H Cassette body: For SHIMAN0 9/10/11 speed Spokes AND Nipples Spoke: pillar 1423 spoke: Black Nipple:pillar nipple Black Other Details Max recommend rider weight:130KG Max recommend tyre pressure: 140PSI Weight of wheelset(excluding skewers): 50mm depth 25mm width: Clincher/Tubeless:1594±30g / Tubular:1494±30g 88mm depth 25mm width: Clincher/Tubeless:2034±30g / Tubular:1954±30g 38mm depth 27mm width: Clincher/Tubeless:1564±30g / Tubular:1464±30g 50mm depth 27mm width: Clincher/Tubeless:1664±30g / Tubular:1564±30g 60mm depth 28mm width: Clincher/Tubeless:1754±30g / Tubular:1664±30g 45mm depth 28mm width: Clincher/Tubeless:1638±30g / Tubular:1538±30g 35mm depth 28mm width: Clincher/Tubeless:1571±30g / Tubular:1471±30g 40mm depth 29mm width: Clincher/Tubeless:1631±30g Front 60mm -Rear 88mm /25 Width: Clincher/Tubeless:1864±30g Accessories: Brake Pads Rim tape Quick Release We have 1000 Days warranty service including return policy 1): Product packaging breakage 2): Product you received and description do not match 3): Product collisions 4): Accessory parts loss Product Description RIM Details For 27mm width wheels,they can fit 25C-28C tires,the best match would be 25C tires. Rim Finish: UD Matte Rim Braking Surface: UD Rim Type: Tubeless Compatible Clincher Rim Size: 700C Rim Depth: 38mm 40mm 45mm 50mm 60mm 88mm Rim inner Width: 15.6mm 17mm 18.5mm 19.5mm Rim outer Width: 25mm 27mm 28mm 29mm Rim Holes:front 20 holes + rear 24 holes HUB Details Hub: P08 Front:QR/100mm Rear:QR/130mm 20-24H Cassette body: For SHIMAN0 9/10/11 speed Spokes AND Nipples Spoke: pillar 1423 spoke: Black Nipple:pillar nipple Black Other Details Max recommend rider weight:130KG Max recommend tyre pressure: 140PSI Weight of wheelset(excluding skewers): 50mm depth 25mm width: Clincher/Tubeless:1594±30g / Tubular:1494±30g 88mm depth 25mm width: Clincher/Tubeless:2034±30g / Tubular:1954±30g 38mm depth 27mm width: Clincher/Tubeless:1564±30g / Tubular:1464±30g 50mm depth 27mm width: Clincher/Tubeless:1664±30g / Tubular:1564±30g 60mm depth 28mm width: Clincher/Tubeless:1754±30g / Tubular:1664±30g 45mm depth 28mm width: Clincher/Tubeless:1638±30g / Tubular:1538±30g 35mm depth 28mm width: Clincher/Tubeless:1571±30g / Tubular:1471±30g 40mm depth 29mm width: Clincher/Tubeless:1631±30g Front 60mm -Rear 88mm /25 Width: Clincher/Tubeless:1864±30g Accessories: Brake Pads Rim tape Quick Release We have 1000 Days warranty service including return policy 1): Product packaging breakage 2): Product you received and description do not match 3): Product collisions 4): Accessory parts loss"
    },
    {
      "docid": 928410,
      "title": "BOKA Wheel Brush No Scratches 17in Long Soft Bristle Wheel Tire Rim Brush Kit Easy Reach Rim Tire Detailing Brush Car Washing Brushes for Cleaning Wheels,Exhaust Tips,Motorcycle(Upgraded Version)",
      "text": "Product Description BOKA Tire Wheel Brush - No Scratches No need the high pressure washer, just only a bucket water with our wheel tire brush and soap for clean your wheel rims by hand. Wheels are never easy to clean for their intricate design, cramped space,and heavy contamination. Our car wheel & rim brush is perfect tool for cleaning deep inside wheels. Helps with cleaning hard to reach areas,like brake caliper, spoke backs, and wheel wells. BOKA's rim brush is more durable, safe to use on all wheel types, and even easy to clean. Premium Wheel Detailing Brush The perfect brush for delicate wheel rims 1.BOKA Car Wheel Rim Brush Kit is the perfect brush for deep cleaning wheels and other compact areas. 2.All wheel parts require specialty cleaning tools that are different than those for paintwork and glass. 3.Use the our wheel cleaning brush to gently scrub dirt and grime without harming sensitive wheel finishes. 4.The 17’’ car washing brush slips deep into alloy wheels and custom rims for a complete wheel cleaning detail. 5.Easily agitate and remove brake dust, dirt, grease, and grime from wheels and rims. Why choose us? Easily cleans deep inside wheels, exhaust tips, engine bays, and more. Made with soft synthetic bristles for a scratch-free shine. Soft plastic handle and knuckle guard protect hands and wheels from scratches. Read more Easy Reach Wheel And Rim Detailing Brush This flexible brush is great for cleaning between wheel spokes, the area between the rotor and the inside of the wheel, and any other tough to reach areas. MULTI-PURPOSE USE Cars, Trucks, Motorcycles, Bicycles, RVs, Boats, Wheels, Rims, Spokes, Grills, Engine Bays, Exhaust Tips, Bumpers, Vents ... Cleaning Those Hard to Reach Spots on The Engine Easily clean away brake dust, dirt, oil, road grime, and much more Protect Your Hand Rubber rings between the handle and hair which can protect the users hand to avoid hurt when cleaning the deep rims Read more Wheel Brush Car Wash Sponge Mitt Tire Applicator Buffer Drill Attachment Use for Wheel, Tire Wheel, Tire, Lug Nut, Engine Bay Applicator tire, Tire dressing Car Polishing, Waxing, Buffing "
    },
    {
      "docid": 112817,
      "title": "Carlisle Super Lug 13/5-6 A",
      "text": "Product Description Whenever the situation calls for superior traction the Carlisle Super Lug is tire for the job. The Super Lug's aggressive tread is great for any terrain from grass to dirt to woods. Whether its for lawn mowers, tillers, garden tractors, or snow throwers the Carlisle Super Lug is the tire best suited when rugged traction is needed. Product Description Whenever the situation calls for superior traction the Carlisle Super Lug is tire for the job. The Super Lug's aggressive tread is great for any terrain from grass to dirt to woods. Whether its for lawn mowers, tillers, garden tractors, or snow throwers the Carlisle Super Lug is the tire best suited when rugged traction is needed."
    },
    {
      "docid": 474090,
      "title": "Golf 18x8.50-8 GTX OEM Golf Cart BEIGE Wheels and Golf Cart Tires Combo - Set of 4",
      "text": "Product Description Fits all EZGO, Yamaha and Club Car carts without a lift kit! Clean up the look of your cart or replace those damaged rims today. Smooth riding OEM replacement set This wheel and tire combo kit will perfectly replace your OEM golf cart wheels. Features a universal 8\" BEIGE steel wheel and 18x8.5-8 size tires. Just mount on and go! The 18x8.5-8\" tire provides great traction in the rain or shine. This combo is the best choice for original equipment (OEM) replacement on golf carts. TECH SPECS: Tire size: 18x8.5-8 Tire height (ground to top of tire): 18 inches DOT Approved? YES Turf Safe? YES Ply Rating: 4 ply Load Rating: 1,000 lbs @ 20 PSI Wheel Offset: Centered (3.5 + 3.5) Bolt Pattern: 4x4 (101.6mm) Product Description Fits all EZGO, Yamaha and Club Car carts without a lift kit! Clean up the look of your cart or replace those damaged rims today. Smooth riding OEM replacement set This wheel and tire combo kit will perfectly replace your OEM golf cart wheels. Features a universal 8\" BEIGE steel wheel and 18x8.5-8 size tires. Just mount on and go! The 18x8.5-8\" tire provides great traction in the rain or shine. This combo is the best choice for original equipment (OEM) replacement on golf carts. TECH SPECS: Tire size: 18x8.5-8 Tire height (ground to top of tire): 18 inches DOT Approved? YES Turf Safe? YES Ply Rating: 4 ply Load Rating: 1,000 lbs @ 20 PSI Wheel Offset: Centered (3.5 + 3.5) Bolt Pattern: 4x4 (101.6mm)"
    },
    {
      "docid": 1154492,
      "title": "Zipp Unisex's 303 Carbon Clincher Tubeless Disc Brake 177D Rear 24 Spokes Convertible IncludesQuick Release and 12X135/142mm Through Axle Caps Wheel, Black Decal, 650C SRAM",
      "text": "Product Description Zip: without limits road bikes are going where they've never gone before, are expected to do more, And are Being ridden harder than ever. At the same time disc brakes are rewriting the rules of what's possible with rim design. For this New era, The Zip 303 fire crest tubeless Disc-Brake wheel set sets the new standard. With an all-new disc-specific, tubeless rim, The 303 fire crest carbon clincher is now Internally 21mm Wide and Faster Than ever. Designed from the start as a tubeless rim, The 303 fire crest features a rim bed Made with internal ridges to lock The tires bead in place, ensuring secure performance, even when ridden at lower tire pressures. A new Carbon fibre layup keeps weight low while maintaining the 303S legendary durability. The rims lightweight design allows the 303 To glide up the steepest climbs while our robust 77/177D hub set, keep the wheels stiff and responsive. Things to remember Aero, durable, light weight, tubeless 77/177 hub set thru-axle compatible features and benefits fire crest rim technology provides world class handling and stability 77/177D hub set, with its best-in-class durability and improved bearing protection, all with no pre-load adjustment needed Aero performance, durable and light weight to ensure compatibility with any bike, our Versatile 77/177D hubs come with swappable end caps to work with qtrs. and thru-axles ISO 4210 compliant. See declaration of conformity for details. Specifications Size (wheels): 650B, 700Crim construction: carbon tire compatibility: clincher tubeless ready brake compatibility: disc (6-bolt)rim - Inside width: 21Mmrim profile: symmetrical rim finish: UD fibre, adhesive de Ca ls colour (decal): Black, blue, white nipple material: aluminium spoke type: cx-ray - black spoke count: 24spoke pattern: 2 cross driver body type: Campagnolo, SRAM XDR, SRAM/Shimano road axle type (wheels): ta 12x142Bearings: cartridge - Carbon steel driver mechanism: 3 pawls leaf spring. Product Description Zip: without limits road bikes are going where they've never gone before, are expected to do more, And are Being ridden harder than ever. At the same time disc brakes are rewriting the rules of what's possible with rim design. For this New era, The Zip 303 fire crest tubeless Disc-Brake wheel set sets the new standard. With an all-new disc-specific, tubeless rim, The 303 fire crest carbon clincher is now Internally 21mm Wide and Faster Than ever. Designed from the start as a tubeless rim, The 303 fire crest features a rim bed Made with internal ridges to lock The tires bead in place, ensuring secure performance, even when ridden at lower tire pressures. A new Carbon fibre layup keeps weight low while maintaining the 303S legendary durability. The rims lightweight design allows the 303 To glide up the steepest climbs while our robust 77/177D hub set, keep the wheels stiff and responsive. Things to remember Aero, durable, light weight, tubeless 77/177 hub set thru-axle compatible features and benefits fire crest rim technology provides world class handling and stability 77/177D hub set, with its best-in-class durability and improved bearing protection, all with no pre-load adjustment needed Aero performance, durable and light weight to ensure compatibility with any bike, our Versatile 77/177D hubs come with swappable end caps to work with qtrs. and thru-axles ISO 4210 compliant. See declaration of conformity for details. Specifications Size (wheels): 650B, 700Crim construction: carbon tire compatibility: clincher tubeless ready brake compatibility: disc (6-bolt)rim - Inside width: 21Mmrim profile: symmetrical rim finish: UD fibre, adhesive de Ca ls colour (decal): Black, blue, white nipple material: aluminium spoke type: cx-ray - black spoke count: 24spoke pattern: 2 cross driver body type: Campagnolo, SRAM XDR, SRAM/Shimano road axle type (wheels): ta 12x142Bearings: cartridge - Carbon steel driver mechanism: 3 pawls leaf spring."
    },
    {
      "docid": 1280092,
      "title": "18x8.50-8 GTX OEM Golf Cart Wheels and Golf Cart Tires Combo - Set of 4 (18x8.5-8, White)",
      "text": "Product Description Fits all EZGO, Yamaha and Club Car carts without a lift kit! Clean up the look of your cart or replace those damaged rims today This smooth riding OEM replacement set from high-performance manufacturer Steeleng This wheel and tire combo kit will perfectly replace your OEM golf cart wheels. Features a universal 8\" white steel wheel and 18x8.5-8 size tires. Just mount on and go! The 18x8.5-8\" tire provides great traction in the rain or shine. This combo is the best choice for original equipment (OEM) replacement on golf carts. TECH SPECS: Tire size: 18x8.5-8 Tire height (ground to top of tire): 18 inches DOT Approved? YES Turf Safe? YES Ply Rating: 4 ply Load Rating: 1,000 lbs @ 20 PSI Wheel Offset: Centered (3.5 + 3.5) Bolt Pattern: 4x4 (101.6mm) Product Description Fits all EZGO, Yamaha and Club Car carts without a lift kit! Clean up the look of your cart or replace those damaged rims today This smooth riding OEM replacement set from high-performance manufacturer Steeleng This wheel and tire combo kit will perfectly replace your OEM golf cart wheels. Features a universal 8\" white steel wheel and 18x8.5-8 size tires. Just mount on and go! The 18x8.5-8\" tire provides great traction in the rain or shine. This combo is the best choice for original equipment (OEM) replacement on golf carts. TECH SPECS: Tire size: 18x8.5-8 Tire height (ground to top of tire): 18 inches DOT Approved? YES Turf Safe? YES Ply Rating: 4 ply Load Rating: 1,000 lbs @ 20 PSI Wheel Offset: Centered (3.5 + 3.5) Bolt Pattern: 4x4 (101.6mm)"
    },
    {
      "docid": 34103,
      "title": "Carlisle Wheel Barrow Wheelbarrow Tire - 4.80-8",
      "text": "Product Description Wheelbarrow Product Description Wheelbarrow"
    },
    {
      "docid": 1084863,
      "title": "CHIEN RONG 1.5 HP Tire Machine Tire Changer Wheel Changers Machine Balancer Rim Clamp Combo 580-680 12\"-21\" / 12 Month Warranty",
      "text": "Product Description We will contact you for delivery confirmation after you place the order Plz leave us a reachable phone number for delivery - We may charge $100 for remote area delivery Tire Changer 560 Product Description: DUAL TURNTABLE FOOT PETAL, MORE CONVENIENTLY TO OPERATE!! - Rim clamping outside: 10\" - 18\" - Rim clamping inside: 12\" - 21\" - Motor Horsepower 1.5 HP Strong Motor - The bird bead is designed with protector and claws are lifetime warranty - Maximum Tire Diameter: 37\" (960mm) - Maximum wheel Width 12\" - Bead Break force 5600 lbs. pneumatic piston - Operating pressure 120-145 psi (8-10 bar) - Voltage 110V only - Includes 4 clamp protectors and Steel mount head(shown in picture) - 500 lbs. Shipping Weight - Blue Powder Coat Finish Wheel Balancer 680 Product Description: Self includes: - Hardware Handging Kits on the side of the device. - Preset to American standard measurements. - Rim diameter: 10\" - 24\" - Rim width: 1.5\" - 20\" - Max. wheel diameter: 44\"(1117mm) - Max. wheel weight: 155 lb - cycle time: 4-7 seconds - Balancing accuracy: -1g to +1g - Noise: <70 dB - Power supply: 110/220V, 50/60HZ - Max. Power: 180-250W - Preset to American Standard Measurements - Standard Dynamic Mode, Static Mode, ALU 1-3 Mode, Motorcycle Mode - includes 4 centering cones - includes Quick Release Wing Nut - includes all accessories shown in the pictures - Blue Powder Coat Finish This DOES NOT INCLUDE the motorcycle adapter shows in the picture: - Rim clamping outside 6\"-15\" - Rim clamping inside 8\"-17\" Product Description We will contact you for delivery confirmation after you place the order Plz leave us a reachable phone number for delivery - We may charge $100 for remote area delivery Tire Changer 560 Product Description: DUAL TURNTABLE FOOT PETAL, MORE CONVENIENTLY TO OPERATE!! - Rim clamping outside: 10\" - 18\" - Rim clamping inside: 12\" - 21\" - Motor Horsepower 1.5 HP Strong Motor - The bird bead is designed with protector and claws are lifetime warranty - Maximum Tire Diameter: 37\" (960mm) - Maximum wheel Width 12\" - Bead Break force 5600 lbs. pneumatic piston - Operating pressure 120-145 psi (8-10 bar) - Voltage 110V only - Includes 4 clamp protectors and Steel mount head(shown in picture) - 500 lbs. Shipping Weight - Blue Powder Coat Finish Wheel Balancer 680 Product Description: Self includes: - Hardware Handging Kits on the side of the device. - Preset to American standard measurements. - Rim diameter: 10\" - 24\" - Rim width: 1.5\" - 20\" - Max. wheel diameter: 44\"(1117mm) - Max. wheel weight: 155 lb - cycle time: 4-7 seconds - Balancing accuracy: -1g to +1g - Noise: <70 dB - Power supply: 110/220V, 50/60HZ - Max. Power: 180-250W - Preset to American Standard Measurements - Standard Dynamic Mode, Static Mode, ALU 1-3 Mode, Motorcycle Mode - includes 4 centering cones - includes Quick Release Wing Nut - includes all accessories shown in the pictures - Blue Powder Coat Finish This DOES NOT INCLUDE the motorcycle adapter shows in the picture: - Rim clamping outside 6\"-15\" - Rim clamping inside 8\"-17\""
    },
    {
      "docid": 1031826,
      "title": "Steelman Rubber Booted Valve Stem Puller/Installer Auto Tool, Off-Set Pivoting Head, Threaded Head, Non-Slip Grip",
      "text": "Product Description The Steelman Rubber Booted Valve Stem Puller/Installer transforms installing and removing valve stems into a hassle-free process. Its sleek steel body features a knurled handle to provide a secure, non-slip grip, and an over-molded rubber boot protects wheels and rims from possible damage. The tool's threaded head pivots to provide leverage against the rim of the wheel and is designed to safely navigate most aftermarket wheels and rims. The swivel head screws onto the cap thread for installing and removing valve stems without removing the core. The tool is compatible with all tubeless style tires, from cars and trucks to motorcycles and ATVs. At 12.5 inches long, this puller provides all the leverage necessary to remove stubborn valve stems. Whether you're a professional or home mechanic, you'll come to rely on this time-saving tool. STEELMAN provides a full range of tire repair tools and accessories that meet or exceed industry standards and are sure to meet the needs of any professional or do-it-yourself shop. Our wide selection of tire and wheel servicing tools has everything you need to keep on rolling. STEELMAN is an industry leader in automotive and industrial specialty tools and equipment. We manufacture high-quality, innovative products designed to meet the specific needs of mechanics, contractors, and other working professionals. Our selection of tools includes specialized automotive items like diagnostic devices, inspection lights, maintenance tools, and tire repair supplies, as well as traditional hand tools like torque wrenches and screwdrivers. So whether you are a pro mechanic or a do-it-yourself enthusiast, STEELMAN has the tools you need to get the job done. Product Description The Steelman Rubber Booted Valve Stem Puller/Installer transforms installing and removing valve stems into a hassle-free process. Its sleek steel body features a knurled handle to provide a secure, non-slip grip, and an over-molded rubber boot protects wheels and rims from possible damage. The tool's threaded head pivots to provide leverage against the rim of the wheel and is designed to safely navigate most aftermarket wheels and rims. The swivel head screws onto the cap thread for installing and removing valve stems without removing the core. The tool is compatible with all tubeless style tires, from cars and trucks to motorcycles and ATVs. At 12.5 inches long, this puller provides all the leverage necessary to remove stubborn valve stems. Whether you're a professional or home mechanic, you'll come to rely on this time-saving tool. STEELMAN provides a full range of tire repair tools and accessories that meet or exceed industry standards and are sure to meet the needs of any professional or do-it-yourself shop. Our wide selection of tire and wheel servicing tools has everything you need to keep on rolling. STEELMAN is an industry leader in automotive and industrial specialty tools and equipment. We manufacture high-quality, innovative products designed to meet the specific needs of mechanics, contractors, and other working professionals. Our selection of tools includes specialized automotive items like diagnostic devices, inspection lights, maintenance tools, and tire repair supplies, as well as traditional hand tools like torque wrenches and screwdrivers. So whether you are a pro mechanic or a do-it-yourself enthusiast, STEELMAN has the tools you need to get the job done.From the brand Previous page STEELMAN is an industry leader in high-quality automotive and industrial specialty tools for mechanics, contractors, and other working professionals. Our selection of innovative tools includes diagnostic devices, inspection lights, maintenance tools, tire repair supplies, and traditional hand tools. Whether you are a pro mechanic or a do-it-yourself enthusiast, STEELMAN has the tools you need to get the job done. How we got our start? Since 1986, STEELMAN has developed specialty products for professionals in the automotive and construction industries. Proudly based in Las Vegas, NV, STEELMAN continues its commitment to quality and innovation. What makes our product unique? STEELMAN tools deliver professional performance at an accessible cost. Whether it be a wrench or a tire buffer, a STEELMAN tool is durable and designed for first-class performance. Why we love what we do? Our product team takes satisfaction in engineering tools that make work easier. We develop tools that transform the way professionals get the job done. Steelman Tools Storefront Visit the Store Next page  "
    },
    {
      "docid": 1174143,
      "title": "AR-PRO 700x23C/25C/28C/32C Road Bike Tires and Tube Replacement with 48mm Presta Valve (Set of 2) - Shock Proof and Explosion Proof Road Bike Inner Tubes",
      "text": "Product Description High-Quality Road Bike Tires and Inner Tubes for All-Season Use It all starts with high-quality rubber. Designed specifically for road bikes, this replacement tire uses dual-compound tread to ensure optimum grip and wear resistance. The dual-compound is evenly molded into a thick rubber tread and casing to provide excellent resistance to cuts and punctures. The tube can withstand high PSIs (up to 120psi!) and remain airtight, removing the need for constant reinflation. Made from high-quality, durable, and weatherproof butyl rubber, this inner tube is thick yet stretchable. More important than its thickness, each inner tube is evenly molded, ensuring that there are no thin spots that will weaken and deform the inner tube as it expands. Dependable 42mm Presta Valve Stems Presta valves offer both convenience and security. Specifically designed for high-performance tires and wheels, these valves are thinner and lighter. Its thin frame only requires a 6mm hole in the road bike's rim, improving the rim's strength and performance. As a standard centered valve, the valve stem seats securely on the walls of the inner tubes, preventing leaks from the valve junction. Also, the valve's 42mm (1.8 inches) length makes on-the-spot inflation a breeze. The varying lengths of Presta valves ensure that there's enough length poking out (at least 1.5 inches) from the rim for ease in attaching a pump. The brass reinforcement on the valve stem's body also makes the valve more rigid and secure, especially as you'll need to screw and unscrew a small part, the valve nut to open and close the valve during inflation. Air loss is minimal with the valve stem caps providing additional protection not only from leaks but also from debris. The AR-PRO Quality Guarantee Our line of replacement road bike tires and inner tubes are must-haves for serious and casual road bike owners alike. Product Description High-Quality Road Bike Tires and Inner Tubes for All-Season Use It all starts with high-quality rubber. Designed specifically for road bikes, this replacement tire uses dual-compound tread to ensure optimum grip and wear resistance. The dual-compound is evenly molded into a thick rubber tread and casing to provide excellent resistance to cuts and punctures. The tube can withstand high PSIs (up to 120psi!) and remain airtight, removing the need for constant reinflation. Made from high-quality, durable, and weatherproof butyl rubber, this inner tube is thick yet stretchable. More important than its thickness, each inner tube is evenly molded, ensuring that there are no thin spots that will weaken and deform the inner tube as it expands. Dependable 42mm Presta Valve Stems Presta valves offer both convenience and security. Specifically designed for high-performance tires and wheels, these valves are thinner and lighter. Its thin frame only requires a 6mm hole in the road bike's rim, improving the rim's strength and performance. As a standard centered valve, the valve stem seats securely on the walls of the inner tubes, preventing leaks from the valve junction. Also, the valve's 42mm (1.8 inches) length makes on-the-spot inflation a breeze. The varying lengths of Presta valves ensure that there's enough length poking out (at least 1.5 inches) from the rim for ease in attaching a pump. The brass reinforcement on the valve stem's body also makes the valve more rigid and secure, especially as you'll need to screw and unscrew a small part, the valve nut to open and close the valve during inflation. Air loss is minimal with the valve stem caps providing additional protection not only from leaks but also from debris. The AR-PRO Quality Guarantee Our line of replacement road bike tires and inner tubes are must-haves for serious and casual road bike owners alike."
    },
    {
      "docid": 578930,
      "title": "4 Pack Car Wheel Cleaner Brush Kit with Short Handle, Car Tire Cleaning Brush Set Include Wheel Brush, Detail Brush, Rim Brush, Tire Brush for Washing wheel of Car, Motorcycle, Truck, SUV, RV, Vehicle",
      "text": "Product Description Read more Tire Brush Non-slip handle Thick bristles Rubber edge provides protection Suitable for cleaning tires and other stubborn stains Wheel Brush Non-slip handle Long extra soft bristles Rubber edge provides protection Suitable for cleaning the surface of wheels and other ordinary stains Rim Brush Non-slip handle Short fine bristles Double wire ring brush head Suitable for cleaning of rims, exhaust pipes and other narrow spaces Detail Brush Non-slip handle Short extra soft bristles Slim brush head Suitable for deep cleaning of crevices and edges Read more Read more "
    },
    {
      "docid": 1642336,
      "title": "jiuwu 12mm Hub Wheel Rim and Tires 1:10 Off-Road RC Car Buggy Tyre with Foam Inserts Black Pack of 4",
      "text": "Product Description JIUWU 12mm Hub Wheel Rim & Tires 1/10 Off-Road RC Car Buggy Tyre w/ Foam Inserts Black Pack of 4 Note: 1. Please check the size caefully before buying it. 2. You need to screw tightly when intall the wheel to the model toy. The huge impact will make the drive hex broken easily when the toy car run fast. 100% New and high quality It is suitable for RC 1 :10 Off-road car, Truck, Monster Truck, Bigfoot, HSP 94108 /94111 /94188 It is durable and waterproof Please Note: Front tires and rear tires size is same Tires, rims without adhesive, You can be split. So you need to glue them together by yourself. Have foam inside Package Included: 4 x Tires & wheels Tires : Max Diameter: 130mm/ 5.11\" Inner Diameter: 71mm/ 2.79\" Diameter of the Axle Hole: 4.2mm/ 0.16\" Outer Dia of the Axle Hole: 13.5mm/ 0.53\" Wide: 64mm/ 2.51\" Wheel Drive Hex: 12mm/ 0.47\" Wheel Spokes: 7 Material: Plastic + Rubber Tread Pattern: Gravel pattern Color: Black Tires + Black Wheel Rim "
    },
    {
      "docid": 70956,
      "title": "FANSPRO 4 Pack of 16 Inch Bike Tube 16x1.75 16x1.95 16x2.10 16x2.125 Heavy Duty Bicycle Tube with 2 Tire Levers,32mm Schrader Valve Premium Quality Butyl Inner Tube",
      "text": "Product Description 16 x 1.75-2.125 Heavy Duty Bike Inner Tubes,4 Pack with 2 Tire Levers 18 x 1.75-2.125 Heavy Duty Bike Inner Tubes,4 Pack with 2 Tire Levers 20 x 1.75-2.125 Heavy Duty Bike Inner Tubes,4 Pack with 2 Tire Levers 24 x 1.75-2.125 Heavy Duty Bike Inner Tubes,6 Pack with 2 Tire Levers 26 x 1.75-2.125 Heavy Duty Bike Inner Tubes,6 Pack with 2 Tire Levers 700 x 23-25c Road Bike Inner Tubes,6 Pack with 2 Tire Levers SIZE 16x1.75-2.125 18x1.75-2.125 20x1.75-2.125 24x1.75-2.125 26x1.75-2.125 700 x 23-25c QTY 4 4 4 6 6 6 VALVE TYPE Schrader Value 32mm Schrader Value 32mm Schrader Value 32mm Schrader Value 48mm Schrader Value 48mm Presta Value 60mm MATERIAL 100% butyl rubber 100% butyl rubber 100% butyl rubber 100% butyl rubber 100% butyl rubber 100% butyl rubber FANS BIKE FANS LIFE Fans bike and enjoy life, thank you for choosing us FANSPRO BICYCLE TUBE ABOUT US As a professional bicycle tube seller,we continuously work on the further development of our products and We offer variety of bicycle tubes like 12\" 16\" 18\" 20\" 24\" 26\" 27.5\" 29 \" 700c,there is always one for you if you need to purchase bicycle tubes.Furthermore, every day we do our very best to satisfy you as our customer. We are willing to take responsibility for any issues when the tube are used. 100% butyl rubber good quality and long service life have a complete range of models long stem value each tube is packaged individually in protective cellophane easy to install Read more Press the valve and deflate the inner tube completely. Insert one tire lever into the wheel rim and pry up the edge of the tire (be careful to avoid piercing the inner tube), and then pry the inner edge of the tire out of the wheel rim; make the wheel rim rotate by one eighth of a turn and then repeat the above-mentioned process while keeping the first tire lever in the original position. Now insert the second tire lever and slide it to separate a single side of the tire from the wheel rim. Detach the tire and the inner tube completely, and check if there is any broken stones or sharp objects left in the tire, and clear those things up if any. Read more Put an inner tube in (please noted that the new inner tube should be inflated with a little bit air to keep a tubular shape before it is installed). Please make sure that the whole inner tube is installed evenly without any protrusion. Start from the valve and put the left side of the tire into the wheel rim with your thumb, and you may also use the tire lever to put the tire back. When both the inner tube and the tire have been installed in the rim, inflate the inner tube with 10PSI air and then check whether the inner tube has been locked in the rim properly and, if so, continue to inflate the inner tube to the standard pressure. Read more "
    },
    {
      "docid": 1324327,
      "title": "For 10-16 Volkswagen Jetta 17 Inch Painted Silver Aluminum Rim - OE Direct Replacement - Road Ready Car Wheel",
      "text": "Product Description FEATURES FITS DETAILS - ✓Fits: 2010 2011 2012 2013 2014 2015 2016 Volkswagen Jetta ITEM SPECIFICATIONS - ✓Size- 16\"x6.5\"; ✓Bolt Pattern: 5x112mm or 5x4.41\" ✓Offset: 50mm; ✓Center-Bore: 57.1mm; PRODUCT DESCRIPTION ONE SIZE DOES NOT FIT ALL Are you asking yourself: \"Will this rim fit my tire?\" Every tire will have a number that will end in R13, R14, R15, etc. This number will indicate what size rims your vehicle requires. For example: ✓ R14 = 14\" Tire (fits a 14\" rim) ✓ R15 = 15\" Tire (fits a 15\" rim) ✓ R16 = 16\" Tire (fits a 16\" rim) ✓ R17 = 17\" Tire (fits a 17\" rim) ✓ R18 = 18\" Tire (fits a 18\" rim) ✓ R19 = 19\" Tire (fits a 19\" rim) ✓ R20 = 20\" Tire (fits a 20\" rim) WHY BUY FROM US ✓ Free Shipping - Any order placed within the continental US is shipped free of charge. ✓ Hassle-Free Returns - If you get your wheel & it doesn't fit just right or you just so happen to have buyers remorse, we'll give you a 100% refund. ✓ Customer Service - Communication is key and we believe that. Contact us today and we guarantee a 24 hour response time and our wheel experts can handle any questions you may have. Product Description FEATURES FITS DETAILS - ✓Fits: 2010 2011 2012 2013 2014 2015 2016 Volkswagen Jetta ITEM SPECIFICATIONS - ✓Size- 16\"x6.5\"; ✓Bolt Pattern: 5x112mm or 5x4.41\" ✓Offset: 50mm; ✓Center-Bore: 57.1mm; PRODUCT DESCRIPTION ONE SIZE DOES NOT FIT ALL Are you asking yourself: \"Will this rim fit my tire?\" Every tire will have a number that will end in R13, R14, R15, etc. This number will indicate what size rims your vehicle requires. For example: ✓ R14 = 14\" Tire (fits a 14\" rim) ✓ R15 = 15\" Tire (fits a 15\" rim) ✓ R16 = 16\" Tire (fits a 16\" rim) ✓ R17 = 17\" Tire (fits a 17\" rim) ✓ R18 = 18\" Tire (fits a 18\" rim) ✓ R19 = 19\" Tire (fits a 19\" rim) ✓ R20 = 20\" Tire (fits a 20\" rim) WHY BUY FROM US ✓ Free Shipping - Any order placed within the continental US is shipped free of charge. ✓ Hassle-Free Returns - If you get your wheel & it doesn't fit just right or you just so happen to have buyers remorse, we'll give you a 100% refund. ✓ Customer Service - Communication is key and we believe that. Contact us today and we guarantee a 24 hour response time and our wheel experts can handle any questions you may have."
    },
    {
      "docid": 1186802,
      "title": "Airshot Tubeless Tire Inflator 1.15l",
      "text": "Product Description + Leak-proof and reliable threaded valves; + Simple and highly efficient operation; + Flow control; + Preparation with standard pump with presta valve tip; + The special valve tip to make your Tubeless tyres slammed every time! Here is an innovation that will make it talk about it and {{{site}} offers you exclusively ! This Airhot compressor pump from the brand of the same name is an amazing tool for fitting Tubeless tyres. It's simple, but you had to think about this: this pump plays the role of a compressor without really being one, and allows you to mount your tubeless tyres in an instant, at home or even on the field. A special nozzle for presta valve (taking the place of the shell) increases the volume of air and ensures the success of your Tubeless mounts. The operation is simple: you pressurize the AirHOT pump with your usual pump, up to 9 bar (130 psi). Then you use the stored pressure when you need it. The very high air flow inflates and slams your Tubeless assembly in seconds. An accessory that has everything to become a must-have. Product Description + Leak-proof and reliable threaded valves; + Simple and highly efficient operation; + Flow control; + Preparation with standard pump with presta valve tip; + The special valve tip to make your Tubeless tyres slammed every time! Here is an innovation that will make it talk about it and {{{site}} offers you exclusively ! This Airhot compressor pump from the brand of the same name is an amazing tool for fitting Tubeless tyres. It's simple, but you had to think about this: this pump plays the role of a compressor without really being one, and allows you to mount your tubeless tyres in an instant, at home or even on the field. A special nozzle for presta valve (taking the place of the shell) increases the volume of air and ensures the success of your Tubeless mounts. The operation is simple: you pressurize the AirHOT pump with your usual pump, up to 9 bar (130 psi). Then you use the stored pressure when you need it. The very high air flow inflates and slams your Tubeless assembly in seconds. An accessory that has everything to become a must-have."
    },
    {
      "docid": 437072,
      "title": "Carlisle Wheel Barrow Wheelbarrow Tire - 4.00-6",
      "text": "Product Description The Carlisle brand of specialty tires and wheels provides a comprehensive product portfolio for lawn and garden, ATV/ UTV, trailers/haulers, agriculture, construction, industrial, and tube/flap market segments. Driven by ingenuity and innovation, our Carlisle branded tires deliver utility for your workday and performance for your adventures. Wheel Diameter - 13.6. Product Description The Carlisle brand of specialty tires and wheels provides a comprehensive product portfolio for lawn and garden, ATV/ UTV, trailers/haulers, agriculture, construction, industrial, and tube/flap market segments. Driven by ingenuity and innovation, our Carlisle branded tires deliver utility for your workday and performance for your adventures. Wheel Diameter - 13.6.From the manufacturer Read more Carlisle Wheel Barrow Wheelbarrow Tire - 4.00-6 "
    },
    {
      "docid": 1176007,
      "title": "Aeromax Alloy Wheelset Road Bike Comp 700c Wheels",
      "text": "Product Description AEROMAX 700C ROAD COMP WHEELESET NEW / HAND-BUILT / SHIPS IN 24hrs DETAILS: Wheels come with rim strips and skewers Serviceable Vuelta Ball Bearing hubs Hand Built Every wheel is stressed 3 times Every spoke is tension tested with a DT Swiss Gauge These 700c clincher wheels are great for around town, daily training rides or racing. Comparable wheels sell in bikes shops around the country for $275 to $300 SPECIFICATIONS: Type-Road Color: Black Normal quick release skewered hubs 24 spoke aero double wall alloy rims, machined sidewalls satin finish Type: Clincher, tubed Bearing type: Ball/Cone3 Stainless Steel Black aero 3.0mm spokes Patented spoke pattern Drilled for Presta valve Rim Width: 20mm (outer width) Rim Width: 13.7mm (inner width) Rim Height: 29.3mm Spacing: front 100mm, rear 130mm Weight: Front 1020g / Rear 1190g COMPATIBILITY NOTES: Fits 700c tires - from 700 x 18 up to 700 x 42, but not a guarantee, this is just a range of tires. Please consult your local bike mechanic if you are not familiar with what size tire you should use with your bike - the second number is the width, the first refers to the diameter. How wide a tire you can install depends on what type of clearance your frame has between the seat stays and brake arms. For rim brakes only - does not have mounts for disc brake rotors. Not intended for use with 27\" wheeled frames. They will fit, but 700c wheels are smaller in diameter than 27\" and the brake pads will not touch the rim's braking surface. Conversions are possible with brakes with longer reach arms. Tire Compatibility: 700c Clincher, tubed Shimano/SRAM Road Cassettes: 7 thru 10 Speed1 Shimano Mountain Cassettes: 7 thru 11 Speed1 SRAM Mountain Cassettes: 7 thru 10 Speed1 Fork Compatibility: 700C, Quick Release (9MM) x 100mm2 Frame compatibility: 700C, Quick Release (10mm) x 130mm2 NOTES: Does not include adapters, nor is it convertible to any other axle type Ball / Cone type hubs are the most common type of hub on planet Product Description AEROMAX 700C ROAD COMP WHEELESET NEW / HAND-BUILT / SHIPS IN 24hrs DETAILS: Wheels come with rim strips and skewers Serviceable Vuelta Ball Bearing hubs Hand Built Every wheel is stressed 3 times Every spoke is tension tested with a DT Swiss Gauge These 700c clincher wheels are great for around town, daily training rides or racing. Comparable wheels sell in bikes shops around the country for $275 to $300 SPECIFICATIONS: Type-Road Color: Black Normal quick release skewered hubs 24 spoke aero double wall alloy rims, machined sidewalls satin finish Type: Clincher, tubed Bearing type: Ball/Cone3 Stainless Steel Black aero 3.0mm spokes Patented spoke pattern Drilled for Presta valve Rim Width: 20mm (outer width) Rim Width: 13.7mm (inner width) Rim Height: 29.3mm Spacing: front 100mm, rear 130mm Weight: Front 1020g / Rear 1190g COMPATIBILITY NOTES: Fits 700c tires - from 700 x 18 up to 700 x 42, but not a guarantee, this is just a range of tires. Please consult your local bike mechanic if you are not familiar with what size tire you should use with your bike - the second number is the width, the first refers to the diameter. How wide a tire you can install depends on what type of clearance your frame has between the seat stays and brake arms. For rim brakes only - does not have mounts for disc brake rotors. Not intended for use with 27\" wheeled frames. They will fit, but 700c wheels are smaller in diameter than 27\" and the brake pads will not touch the rim's braking surface. Conversions are possible with brakes with longer reach arms. Tire Compatibility: 700c Clincher, tubed Shimano/SRAM Road Cassettes: 7 thru 10 Speed1 Shimano Mountain Cassettes: 7 thru 11 Speed1 SRAM Mountain Cassettes: 7 thru 10 Speed1 Fork Compatibility: 700C, Quick Release (9MM) x 100mm2 Frame compatibility: 700C, Quick Release (10mm) x 130mm2 NOTES: Does not include adapters, nor is it convertible to any other axle type Ball / Cone type hubs are the most common type of hub on planet"
    },
    {
      "docid": 1620141,
      "title": "SunF Power.I 25 inch ATV UTV all-terrain Tires 25x8-12 & 25x11-12, 6 PR Front & Rear Set of 4 A033, Tubeless",
      "text": "Product Description Model Description: The SunF A033 is among the worlds most popular footprints. Its aggressive, non directional tread pattern maintains even braking and a smooth ride while providing maximum traction. For more details, see full description. If you have any questions or concerns, please contact us. Tire Specifications: Total Number of Tires: 4 Front Size: 25x8-12 Front QTY: 2 Front Rim Size: 12 x 6.5 Front Ply Rating: 6 Front Diameter: 25 Front Tread Depth: 21 Front Max Load: 638 (290kg) Front Max PSI: 14 Front Weight: 20 Rear Size: 25x11-12 Rear QTY: 2 Rear Rim Size: 12 x 9.0 Rear Ply Rating: 6 Rear Diameter: 25 Rear Tread Depth: 19 Rear Max Load: 737 (335kg) Rear Max PSI: 14 Rear Weight: 28.6 Product Description Model Description: The SunF A033 is among the worlds most popular footprints. Its aggressive, non directional tread pattern maintains even braking and a smooth ride while providing maximum traction. For more details, see full description. If you have any questions or concerns, please contact us. Tire Specifications: Total Number of Tires: 4 Front Size: 25x8-12 Front QTY: 2 Front Rim Size: 12 x 6.5 Front Ply Rating: 6 Front Diameter: 25 Front Tread Depth: 21 Front Max Load: 638 (290kg) Front Max PSI: 14 Front Weight: 20 Rear Size: 25x11-12 Rear QTY: 2 Rear Rim Size: 12 x 9.0 Rear Ply Rating: 6 Rear Diameter: 25 Rear Tread Depth: 19 Rear Max Load: 737 (335kg) Rear Max PSI: 14 Rear Weight: 28.6"
    },
    {
      "docid": 1049092,
      "title": "2 Pack 10-Inch Tires and Wheels 4.10/3.50-4 Replacement Utility Tires for Dolly, Hand Truck, Gorilla Cart, Generator, Lawn Mower, Garden Wagon With 5/8-Inch Axle Borehole and Double Sealed Bearings",
      "text": "Product Description Read more Read more All-purpose Utility The Ram-Pro’s ten inch, ready to install Air Tire Wheels is the best replacement for your hand truck tires and wheels. It offers easy installation and optimum effort reducing performance. The only effort you need to make is to remove the old tires before sliding in the new ones and closing them with clips, nuts or cotter pins. That’s a perfectly installed and proper functioning hand truck without any hesitation or frustration. Superior Quality The high-quality heavy duty rubber will last very long. The air stem is on the outside so you can easily inflate the tires if needed. The double sealed bearings will evenly distribute the load on your vehicle and help to balance the loud noise evenly thereby making you push less and easier. The reduction in noise levels further helps to reduce stress levels. High End Specification The Ram-Pro Air Tires size is ten inches high and three inches wide with a hole diameter of 5/8 inches. The hub depth of the tires is 1-3/4 inches with double sealed bearings. With such high-end specifications, it can withstand a load capacity of 300 lbs. (approximately 136 Kgs). The pressure per square inch rating is 30 per tire. The tube type is a 2 ply 4.10/3.5-4. These air-filled tires are designed with raised grips to make your drive the smoothest possible one. Numerous Applications The air tires can be used for hand trucks, lawn mowers, yard wagons, air compressors, power washers, child's wagons, shopping carts, wood chippers, snow blowers, dollies, go karts, golf carts, tricycles, and much more. This assembly has proven to be ideal for air compressors, dollies, generators, pressure washers and various other auxiliary utility equipment. Read more Read more "
    },
    {
      "docid": 772375,
      "title": "RTX, Steel Rim, New Aftermarket Wheel, 15X5.5, 4X100, 54.1, 45, black finish X40957",
      "text": "Product Description This NEW aftermarket Steel Rim / Wheel is perfect for replacement wheel, spare tire / rim or full wheel swap. Black RTX Steel Rim. Diameter: 15in, width: 5.5in, bolt pattern: 4-100, center bore: 54.1, offset: +45 (positive offset), Load Range 500kg / 1102lbs. This rim / wheel fits 15\" tires. Please check the tire size you will be installing on this rim prior to purchase.***This listing is for a single wheel. If you need a full set of four (4) rims, you need to buy four (4) items. *Compatibility with the OEM wheel covers is not guaranteed. *These rims are centered by the studs, they are lugcentric not hubcentric (oversized center hole for most applications)*** All RTX steel rims / wheels are tested and approved to meet or exceed Certified Quality Standards. Product Description This NEW aftermarket Steel Rim / Wheel is perfect for replacement wheel, spare tire / rim or full wheel swap. Black RTX Steel Rim. Diameter: 15in, width: 5.5in, bolt pattern: 4-100, center bore: 54.1, offset: +45 (positive offset), Load Range 500kg / 1102lbs. This rim / wheel fits 15\" tires. Please check the tire size you will be installing on this rim prior to purchase.***This listing is for a single wheel. If you need a full set of four (4) rims, you need to buy four (4) items. *Compatibility with the OEM wheel covers is not guaranteed. *These rims are centered by the studs, they are lugcentric not hubcentric (oversized center hole for most applications)*** All RTX steel rims / wheels are tested and approved to meet or exceed Certified Quality Standards."
    },
    {
      "docid": 386865,
      "title": "SunF 26x8-12 26x10-12 All Terrain Tires ATV UTV 6 PR POWER I A033 - BUNDLE",
      "text": "Product Description SunF Corporation has dedicated themselves to meeting their customer’s demands and needs. SunF develops and manufactures a wide variety of quality tires in the specialty market. Their line up includes ST trailer, lawn and garden, agriculture, golf cart, ATV Quad Motorcycle, UTV Side by Side, light truck & more! The SunF A033 is among the worlds most popular footprints. Its aggressive, non directional tread pattern maintains even braking and a smooth ride while providing maximum traction. For more details, see full description. If you have any questions or concerns, please contact us. Directional angled knobby tread design great in most terrain with high performance on trails and suitable for desert, mud, dirt and rock applications. Features premium rubber in our hard compound to withstand the harshest racing conditions. A perfect replacement tire for your quad ATV, UTV, Go Kart, Golf Cart or Lawn Mower.Heavy 6 ply rated construction resists punctures and abrasions.Lug depth and pattern offers enhanced skid and traction control, great in cross country or desert conditions. Aggressive shoulder knobs provide superb side bite and traction with added protection to rim and sidewall. Trully a great ALL TERRAIN tire at an affordable price (compared to Bighorn).Rim(s) NOT included. Please see full description for specifications. Contact us with any questions or concerns!Size 1: 26x8-12 | Size 2: 26x10-12 Product Description SunF Corporation has dedicated themselves to meeting their customer’s demands and needs. SunF develops and manufactures a wide variety of quality tires in the specialty market. Their line up includes ST trailer, lawn and garden, agriculture, golf cart, ATV Quad Motorcycle, UTV Side by Side, light truck & more! The SunF A033 is among the worlds most popular footprints. Its aggressive, non directional tread pattern maintains even braking and a smooth ride while providing maximum traction. For more details, see full description. If you have any questions or concerns, please contact us. Directional angled knobby tread design great in most terrain with high performance on trails and suitable for desert, mud, dirt and rock applications. Features premium rubber in our hard compound to withstand the harshest racing conditions. A perfect replacement tire for your quad ATV, UTV, Go Kart, Golf Cart or Lawn Mower.Heavy 6 ply rated construction resists punctures and abrasions.Lug depth and pattern offers enhanced skid and traction control, great in cross country or desert conditions. Aggressive shoulder knobs provide superb side bite and traction with added protection to rim and sidewall. Trully a great ALL TERRAIN tire at an affordable price (compared to Bighorn).Rim(s) NOT included. Please see full description for specifications. Contact us with any questions or concerns!Size 1: 26x8-12 | Size 2: 26x10-12"
    },
    {
      "docid": 52086,
      "title": "RTX, Steel Rim, New Aftermarket Wheel, 18X7, 5X114.3, 71.5, 40, black finish X48827",
      "text": "Product Description This NEW aftermarket Steel Rim / Wheel is perfect for replacement wheel, spare tire / rim or full wheel swap. Black RTX Steel Rim. Diameter: 18in, width: 7in, bolt pattern: 5-114.3, center bore: 71.5, offset: +40 (positive offset). Load Rating 730kg / 1609lbs. This rim / wheel fits 18\" tires. Please check the tire size you will be installing on this rim prior to purchase.***This listing is for a single wheel. If you need a full set of four (4) rims, you need to buy four (4) items. *Compatibility with the OEM wheel covers is not guaranteed. *These rims are centered by the studs, they are lugcentric not hubcentric (oversized center hole for most applications)*** All RTX steel rims / wheels are tested and approved to meet or exceed Certified Quality Standards. Product Description This NEW aftermarket Steel Rim / Wheel is perfect for replacement wheel, spare tire / rim or full wheel swap. Black RTX Steel Rim. Diameter: 18in, width: 7in, bolt pattern: 5-114.3, center bore: 71.5, offset: +40 (positive offset). Load Rating 730kg / 1609lbs. This rim / wheel fits 18\" tires. Please check the tire size you will be installing on this rim prior to purchase.***This listing is for a single wheel. If you need a full set of four (4) rims, you need to buy four (4) items. *Compatibility with the OEM wheel covers is not guaranteed. *These rims are centered by the studs, they are lugcentric not hubcentric (oversized center hole for most applications)*** All RTX steel rims / wheels are tested and approved to meet or exceed Certified Quality Standards."
    },
    {
      "docid": 538543,
      "title": "2-Pack Trailer Tires On Galvanized Wheel Rims 480-8 4.80-8 4.80 x 8 Load C 4 Lug",
      "text": "Product Description Pre-Mounted Trailer Tires & Wheels. 2-Pack Trailer Tires & Rims Bias Ply 480-8 Load C 4-4 Galvanized Conventional 8. Tire Size: 480-8. Aspect Ratio: 8. Section Width: 118. Load Range: C. Tire Weight Rating: 745 Lbs.. Maximum Pressure: 90 PSI. Tire Composition: 6 Ply. Tread Depth: 4/32\". Sidewall Description: BSW. Speed Index: M. Load Index: 71/M. Internal Tire Type: Tubeless. Rim Size: 8\" X 3.75\". Bolt Configuration: 4 Lug 4\" Center. Offset: 0\". Center Bore: 2.83\". Rim Construction: Steel. Rim Style: Conventional. Rim Color: Galvanized. Lug Value Hole: 0.45\". Hub Stud Size/Nut Requirement: 1/2\"-20 60 Degree Cone Nut. Torque Specifications: 50-75 Ft/Lbs.. Warranty: Two Years. Pack Quantity - 2-Pack Product Description Pre-Mounted Trailer Tires & Wheels. 2-Pack Trailer Tires & Rims Bias Ply 480-8 Load C 4-4 Galvanized Conventional 8. Tire Size: 480-8. Aspect Ratio: 8. Section Width: 118. Load Range: C. Tire Weight Rating: 745 Lbs.. Maximum Pressure: 90 PSI. Tire Composition: 6 Ply. Tread Depth: 4/32\". Sidewall Description: BSW. Speed Index: M. Load Index: 71/M. Internal Tire Type: Tubeless. Rim Size: 8\" X 3.75\". Bolt Configuration: 4 Lug 4\" Center. Offset: 0\". Center Bore: 2.83\". Rim Construction: Steel. Rim Style: Conventional. Rim Color: Galvanized. Lug Value Hole: 0.45\". Hub Stud Size/Nut Requirement: 1/2\"-20 60 Degree Cone Nut. Torque Specifications: 50-75 Ft/Lbs.. Warranty: Two Years. Pack Quantity - 2-Pack"
    },
    {
      "docid": 295416,
      "title": "Technic Lego 8pc Wheel and Tire Set (Mindstorms nxt ev3 tyre) 56145 44309",
      "text": "Product Description BRAND NEW LEGO 8pc Technic wheel and tire SET! (4) - LEGO Gray Wheel 30.4mm D. x 20mm without pin holes, with reinforced rim, Original LEGO part number 56145 (4) - LEGO TYRE BLACK (tire) 43.2 x 22 ZR Product Description BRAND NEW LEGO 8pc Technic wheel and tire SET! (4) - LEGO Gray Wheel 30.4mm D. x 20mm without pin holes, with reinforced rim, Original LEGO part number 56145 (4) - LEGO TYRE BLACK (tire) 43.2 x 22 ZR"
    },
    {
      "docid": 748709,
      "title": "SunF 24x8-11 24x10-11 All Terrain Tires ATV UTV 6 PR POWER I A033 - BUNDLE",
      "text": "Product Description SunF Corporation has dedicated themselves to meeting their customer’s demands and needs. SunF develops and manufactures a wide variety of quality tires in the specialty market. Their line up includes ST trailer, lawn and garden, agriculture, golf cart, ATV Quad Motorcycle, UTV Side by Side, light truck & more! The SunF A033 is among the worlds most popular footprints. Its aggressive, non directional tread pattern maintains even braking and a smooth ride while providing maximum traction. For more details, see full description. If you have any questions or concerns, please contact us. Directional angled knobby tread design great in most terrain with high performance on trails and suitable for desert, mud, dirt and rock applications. Features premium rubber in our hard compound to withstand the harshest racing conditions. A perfect replacement tire for your quad ATV, UTV, Go Kart, Golf Cart or Lawn Mower.Heavy 6 ply rated construction resists punctures and abrasions.Lug depth and pattern offers enhanced skid and traction control, great in cross country or desert conditions. Aggressive shoulder knobs provide superb side bite and traction with added protection to rim and sidewall. Trully a great ALL TERRAIN tire at an affordable price (compared to Bighorn).Rim(s) NOT included. Please see full description for specifications. Contact us with any questions or concerns!Size 1: 24x8-11 | Size 2: 24x10-11 Product Description SunF Corporation has dedicated themselves to meeting their customer’s demands and needs. SunF develops and manufactures a wide variety of quality tires in the specialty market. Their line up includes ST trailer, lawn and garden, agriculture, golf cart, ATV Quad Motorcycle, UTV Side by Side, light truck & more! The SunF A033 is among the worlds most popular footprints. Its aggressive, non directional tread pattern maintains even braking and a smooth ride while providing maximum traction. For more details, see full description. If you have any questions or concerns, please contact us. Directional angled knobby tread design great in most terrain with high performance on trails and suitable for desert, mud, dirt and rock applications. Features premium rubber in our hard compound to withstand the harshest racing conditions. A perfect replacement tire for your quad ATV, UTV, Go Kart, Golf Cart or Lawn Mower.Heavy 6 ply rated construction resists punctures and abrasions.Lug depth and pattern offers enhanced skid and traction control, great in cross country or desert conditions. Aggressive shoulder knobs provide superb side bite and traction with added protection to rim and sidewall. Trully a great ALL TERRAIN tire at an affordable price (compared to Bighorn).Rim(s) NOT included. Please see full description for specifications. Contact us with any questions or concerns!Size 1: 24x8-11 | Size 2: 24x10-11"
    },
    {
      "docid": 855530,
      "title": "SunF 28x9-12 28x11-12 ATV UTV Tires 6 PR Tubeless A033 POWER I [Bundle]",
      "text": "Product Description SunF Corporation has dedicated themselves to meeting their customer’s demands and needs. SunF develops and manufactures a wide variety of quality tires in the specialty market. Their line up includes ST trailer, lawn and garden, agriculture, golf cart, ATV Quad Motorcycle, UTV Side by Side, light truck & more! The SunF A033 is among the worlds most popular footprints. Its aggressive, non directional tread pattern maintains even braking and a smooth ride while providing maximum traction. For more details, see full description. If you have any questions or concerns, please contact us. Directional angled knobby tread design great in most terrain with high performance on trails and suitable for desert, mud, dirt and rock applications. Features premium rubber in our hard compound to withstand the harshest racing conditions. A perfect replacement tire for your quad ATV, UTV, Go Kart, Golf Cart or Lawn Mower.Heavy 6 ply rated construction resists punctures and abrasions.Lug depth and pattern offers enhanced skid and traction control, great in cross country or desert conditions. Aggressive shoulder knobs provide superb side bite and traction with added protection to rim and sidewall. Trully a great ALL TERRAIN tire at an affordable price (compared to Bighorn).Rim(s) NOT included. Please see full description for specifications. Contact us with any questions or concerns!Size 1: 28x9-12 | Size 2: 28x11-12 Product Description SunF Corporation has dedicated themselves to meeting their customer’s demands and needs. SunF develops and manufactures a wide variety of quality tires in the specialty market. Their line up includes ST trailer, lawn and garden, agriculture, golf cart, ATV Quad Motorcycle, UTV Side by Side, light truck & more! The SunF A033 is among the worlds most popular footprints. Its aggressive, non directional tread pattern maintains even braking and a smooth ride while providing maximum traction. For more details, see full description. If you have any questions or concerns, please contact us. Directional angled knobby tread design great in most terrain with high performance on trails and suitable for desert, mud, dirt and rock applications. Features premium rubber in our hard compound to withstand the harshest racing conditions. A perfect replacement tire for your quad ATV, UTV, Go Kart, Golf Cart or Lawn Mower.Heavy 6 ply rated construction resists punctures and abrasions.Lug depth and pattern offers enhanced skid and traction control, great in cross country or desert conditions. Aggressive shoulder knobs provide superb side bite and traction with added protection to rim and sidewall. Trully a great ALL TERRAIN tire at an affordable price (compared to Bighorn).Rim(s) NOT included. Please see full description for specifications. Contact us with any questions or concerns!Size 1: 28x9-12 | Size 2: 28x11-12"
    },
    {
      "docid": 217116,
      "title": "4 New 25x8-12 25x10-12 KT MASSFX TIRE SET ATV TIRES 6 PLY 25\" 25x8x12 25x10x12",
      "text": "Product Description Read more Aggressive Raised Tread Dynamic, 1 / 2 inch, raised tread provides unmatched puncture resistance without compromising a smooth ride. Outer side lug design and pattern gives additional grip and traction while protecting the sidewall. Reinforced Sidewall Multiple layers of reinforced rubber combined with an outer rigid lug blueprint enhances the overall design and aesthetic of the SL Offroad Series from Massfx. 6 - Ply Bias Rating With a 6 - Ply Bias rating you get the best of both worlds. Composed of 6 separate layers of reinforced, high-grade rubber, the MASSFX KT Series are thick and durable enough to go over the largest rock or through the roughest trails, without giving up on comfort and longevity. Max Load Rating Max load rating of 390 pounds at a rate of 7-Psi makes these a very versatile and all around well balanced tire. Read more Read more AVAILABLE SIZES Tire Height - Tire Width - Rim Size 25 x 8 - 12 25 x 10 -12 26 x 9 - 12 26 x 11 - 12 MULTIPLE RIM SIZES Availability in multiple rim formats and sizes allows for the KT Series to be included in multiple facets of offroad vehicles and communities. MASSFX - KT SERIES Grade \"A\" Tire One of the few Omnidirectional treads from MASSFX, the KT Series is versatile with endless potential and applications. An alternating A shape with a stippled texture allows for large areas of grip and traction. WHAT DOES 6 - PLY BIAS RATING MEAN? 6 - represents the overall strength rating of the tire based upon the composition of the tire PLY - is used to represent the relative strength of the tire overall. BIAS - refers to the tires classification. Read more Read more Read more MASSFX AT MASSFX GRINDER MASSFX MS MASSFX SL MASSFX VS MASSFX VY Vehicle Type: ATV/UTV/SxS ATV/UTV/SxS ATV/UTV/SxS ATV/UTV/SxS ATV/UTV/SxS ATV/UTV/SxS PLY: 6 PLY 6 PLY 6 PLY 6 PLY 6 PLY 8 PLY Sizes: 27x9-12, 27x11-14 22x7-11, 22x10-9, 24x8-12, 24x10-12, 25x8-12, 25x10-12 25x8-12, 25x10-12, 26x9-12, 26x11-12 25x8-12, 25x10-12, 26x9-12, 26x11-12 23x11-10 30x10-14 Construction: BIAS BIAS BIAS BIAS BIAS BIAS Season: All Season All Season All Season All Season All Season All Season "
    },
    {
      "docid": 573809,
      "title": "2-Pack Trailer Tires On White Rims ST205/75D15 Load C 5 Lug On 5 15 x 5 Wheel",
      "text": "Product Description Pre-Mounted Trailer Tires & Wheels. 2-Pack Trailer Tires & Rims Bias Ply 205/75D15 Load C 5-5\" White Spoke 15\". Tire Size: 205/75D15. Aspect Ratio: 75. Section Width: 205. Load Range: C. Tire Weight Rating: 1820 Lbs.. Maximum Pressure: 50 PSI. Tire Composition: 6 Ply. Tread Depth: 7.8/32\". Sidewall Description: BSW. Speed Index: M. Load Index: 101/97. Internal Tire Type: Tubeless. Rim Size: 15\" X 5\". Bolt Configuration: 5 Lug 5\" Center. Offset: 0\". Center Bore: 3.30\". Rim Construction: Steel. Rim Style: Spoke. Rim Color: White. Wheel Hub Diameter: 6.50\". Lug Value Hole: 0.45\". Hub Stud Size/Nut Requirement: 1/2\"-20 60 Degree Cone Nut. Torque Specifications: 90-120 Ft/Lbs.. Warranty: Two Years. Pack Quantity - 2-Pack Product Description Pre-Mounted Trailer Tires & Wheels. 2-Pack Trailer Tires & Rims Bias Ply 205/75D15 Load C 5-5\" White Spoke 15\". Tire Size: 205/75D15. Aspect Ratio: 75. Section Width: 205. Load Range: C. Tire Weight Rating: 1820 Lbs.. Maximum Pressure: 50 PSI. Tire Composition: 6 Ply. Tread Depth: 7.8/32\". Sidewall Description: BSW. Speed Index: M. Load Index: 101/97. Internal Tire Type: Tubeless. Rim Size: 15\" X 5\". Bolt Configuration: 5 Lug 5\" Center. Offset: 0\". Center Bore: 3.30\". Rim Construction: Steel. Rim Style: Spoke. Rim Color: White. Wheel Hub Diameter: 6.50\". Lug Value Hole: 0.45\". Hub Stud Size/Nut Requirement: 1/2\"-20 60 Degree Cone Nut. Torque Specifications: 90-120 Ft/Lbs.. Warranty: Two Years. Pack Quantity - 2-Pack"
    },
    {
      "docid": 522382,
      "title": "Complete Set of 4 All Terrain ATV UTV Tires 25x8-12 Front & 25x10-12 Rear 6PR Tubeless",
      "text": "Product Description Front Tires ATV UTV Tire Size: 25x8-12 SW: 201 mm OD: 632 mm Rim Width:6.5\" Rim Size: 12 x 6.5 Tread depth: 0.70\"/18mm Ply Rating: 6 Max load:340 lbs@14psi Placement on Vehicle: Left, Right, Front Quantity: 2Pcs Read more Rear Tires ATV UTV Tire Size: 25x10-12 SW:243mm OD:624.8mm Rim Width: 8\" Rim Size: 12 x 8.0 Tread depth: 0.79\"/20mm Ply Rating: 6 Max load: 420 lbs@14psi Placement on Vehicle: Left, Right, Rear Quantity: 2Pcs Read more Fits: Tires can compatible with Arctic Cat Bombardier Can-Am Kawasaki Polaris vehicle and more 2 x Packages Include: 2 x Rear Tires & 2 x Front Tires Shipped in 2 packages, they may not arrive at the same time. "
    },
    {
      "docid": 1482118,
      "title": "Achilles MAG2650202 Desert Hawk UHP Tire- 265/50-20 112V",
      "text": "Product Description Directional tread design - provides good traction for both wet and dry condition. Solid center rib - delivers straight line stability to improve handling. Rim guard protection - provides wheel damage protection. Double wide circumferential grooves - Multiple lateral grooves channel water to reduce the possibility of hydroplaning. Product Description Directional tread design - provides good traction for both wet and dry condition. Solid center rib - delivers straight line stability to improve handling. Rim guard protection - provides wheel damage protection. Double wide circumferential grooves - Multiple lateral grooves channel water to reduce the possibility of hydroplaning.From the manufacturer Read more Read more Strong performance and high fraction will provide maximum experience in handling wet tracks, dry tracks, or even when drifting. Please note not include Rim Directional Tread Design Solid Center Rib Rim Guard Protection Double Wide Grooves Performance Without Compromise The Achilles Desert Hawk UHP tire is a premium quality performance tire for SUVs. Drivers get the best of a long-lasting touring tire combined with a heavy duty truck tire. It has a directional tread design that provides good traction for both wet and dry road conditions, and a solid center rib that delivers straight line stability and improved high speed handling. On the side of the tire there is a rim guard. This raised rib just above the top of where the wheel touches. Provides good traction for both wet and dry condition. Delivers straight line stability to improve handling. Provides wheel damage protection. Multiple lateral grooves channel water to reduce the possibility of hydroplaning. Read more About Achilles Radial Achilles was born out of Indonesia'S tire manufacturer factory, PT. Multistrada Arah Sarana, or MASA. Grown and continued to thrive in global era, MESA building currently owns 55 hectares and 128 hectares areas all located in East Cikarang. Fueled by ambitions, Achilles and Corsa stepped on the gas in market competition. Through quality and reliable products, also equipped with the best services, Achilles produced Passenger Tire, Commercial Tire, Truck and Bus Tire, Competition Tire, and Industrial Tire which are now famous and commonly used in international market. Even winter tires have now been produced for the needs of consumers in northern climates. MASA continuously committed to provide state-of-the-art tires for all consumers. We would like to contribute a sense of confidence and optimism in company's future. Through experienced, wise and visionary management, MASA continued to define a map of automotive tire market trends throughout the world. Read more "
    },
    {
      "docid": 242458,
      "title": "Continental 26\" Bicycle Tube, 1.25\"/1.75\" 42mm Presta Valve , Black",
      "text": "Product Description Those fancy new tires you bought aren't worth much without a great set of inner tubes to keep them inflated. Put the Continental 26\" presta valve tubes in your deep profile rims to shed some grams and keep the air in your tires. Unitube system allows greater compatibility with more tires sizes. Seamless construction eliminates weak points, Mold-cured and vulcanized for uniform roundness and improved reliability at the valve stem insertion. Every tube must pass 100% quality control inspection 42mm Presta valve has a removable valve core. Product Description Those fancy new tires you bought aren't worth much without a great set of inner tubes to keep them inflated. Put the Continental 26\" presta valve tubes in your deep profile rims to shed some grams and keep the air in your tires. Unitube system allows greater compatibility with more tires sizes. Seamless construction eliminates weak points, Mold-cured and vulcanized for uniform roundness and improved reliability at the valve stem insertion. Every tube must pass 100% quality control inspection 42mm Presta valve has a removable valve core.From the manufacturer Presta vs. Schrader Which valve is right for you? Presta valve tubes are most commonly used for road wheels (700c) and on a few MTB wheels as the valves are thin, whereas Schrader valves are more commonly found on MTB wheels as the valve is larger and won't fit through 700c rim valve holes. Conti Touring Bike Tubes The Perfect Tube for the Street Rider A Must have Cycling Essential. Continental Tires follows a simple formula. Mold Cured, seamless extruded and removable valve cores make Conti Tubes a step above the rest. This is the definitive all purpose inner tube and is an excellent replacement inner tube for your road bike. Remember, varying tube types can affect your tyres’ handling characteristics: the Standard tube, available in all dimensions is the best choice for everyday cycling whilst Light & Supersonic varieties give racers the option of lower rotating weight, therefore increasing speed. Read more Duetche Tecknik With more than 100 years’ experience in the development and production of bicycle tires, Continental holds a unique position within the industry. Continental is the only German bicycle tyre manufacturer to produce its tyres in Germany. This drives the engineers toward more innovation, development and revolutionary technologies such as BlackChili ,Vectran, RaceSport and ProTection. The Continental heart and soul is behind the phrase 'Handmade in Germany' and this passion can be reached by every rider when they experience the ultimate performance and definitive reliability of Continental Tyres. Read more "
    },
    {
      "docid": 337570,
      "title": "RTX, Steel Rim, New Aftermarket Wheel, 15X6, 5X100, 57.1, 38, black finish X99130N",
      "text": "Product Description This NEW aftermarket Steel Rim / Wheel is perfect for replacement wheel, spare tire / rim or full wheel swap. Black RTX Steel Rim. Diameter: 15in, width: 6in, bolt pattern: 5-100, center bore: 57.1, offset: +38 (positive offset). This rim / wheel fits 15\" tires. Please check the tire size you will be installing on this rim prior to purchase.***This listing is for a single wheel. If you need a full set of four (4) rims, you need to buy four (4) items. *Compatibility with the OEM wheel covers is not guaranteed. *These rims are centered by the studs, they are lugcentric not hubcentric (oversized center hole for most applications)*** All RTX steel rims / wheels are tested and approved to meet or exceed Certified Quality Standards. Product Description This NEW aftermarket Steel Rim / Wheel is perfect for replacement wheel, spare tire / rim or full wheel swap. Black RTX Steel Rim. Diameter: 15in, width: 6in, bolt pattern: 5-100, center bore: 57.1, offset: +38 (positive offset). This rim / wheel fits 15\" tires. Please check the tire size you will be installing on this rim prior to purchase.***This listing is for a single wheel. If you need a full set of four (4) rims, you need to buy four (4) items. *Compatibility with the OEM wheel covers is not guaranteed. *These rims are centered by the studs, they are lugcentric not hubcentric (oversized center hole for most applications)*** All RTX steel rims / wheels are tested and approved to meet or exceed Certified Quality Standards."
    },
    {
      "docid": 649482,
      "title": "Hobbypark 4-Pack 120mm / 4.7 Inch Outer Diameter Tires & Wheels Foam Inserts 12mm Hex for Traxxas Slash 4x4 2WD 1/10 Short Course Truck",
      "text": "Product Description Note: The tire is not glued on rim. It's mounted on rim with foam inserted; The color of the item may vary slightly due to photography and your own computer Customer Satisfaction Guarantee If you are not 100% completely satisfied with our products, please do not hesitate to contact us to request a refund or exchange! Item: Tires and Plastic Wheels Rims Sets Package Include: 4x Tires and Plastic Wheels Sets (The tire is not glued on rim. It's mounted on rim with foam inserted) Product Description Note: The tire is not glued on rim. It's mounted on rim with foam inserted; The color of the item may vary slightly due to photography and your own computer Customer Satisfaction Guarantee If you are not 100% completely satisfied with our products, please do not hesitate to contact us to request a refund or exchange! Item: Tires and Plastic Wheels Rims Sets Package Include: 4x Tires and Plastic Wheels Sets (The tire is not glued on rim. It's mounted on rim with foam inserted)"
    },
    {
      "docid": 1334900,
      "title": "PFIFF Classic Adult Tricycle, 24 inch wheels, Dark Blue",
      "text": "Product Description Highly versatile and easy to use. Completely aligned for your favorite requirements. Wherever you go, whatever you do, you arrive with ease. Made for transportation! Entirely without tools, you can easily disassemble your PFAU-Tec tricycle to fit in a car. But who needs a car? You can transport up to 20 kg very simply. All PFIFF bicycles and tricycles are designed and made in Germany. Product Description Highly versatile and easy to use. Completely aligned for your favorite requirements. Wherever you go, whatever you do, you arrive with ease. Made for transportation! Entirely without tools, you can easily disassemble your PFAU-Tec tricycle to fit in a car. But who needs a car? You can transport up to 20 kg very simply. All PFIFF bicycles and tricycles are designed and made in Germany.From the manufacturer Read more Extras Rear Rack and Basket Adjustable Seat height Fenders PFIFF | Classic Adult Tricycle Highly versatile and easy to use. Completely aligned for your favorite requirements. Wherever you go, whatever you do, you arrive with ease. Made for transportation! Entirely without tools, you can easily disassemble your PFAU-Tec tricycle to fit in a car. But who needs a car? You can transport up to 20 kg very simply. All PFIFF bicycles and tricycles are designed and made in Germany. Comfortable driving and a cool and stylish look Easily disassembled to fit in a car Read more What is PFIFF and P-Tec? 'PFAU-Tec' stands for quality 'made in Germany'. That means no compromises when it comes to safety. The proven, therapy suitable bicycles / special tricycles for children and adults are produced from the construction to the complete assembly all in-house. This is a clear economic commitment to our region: PFAU-Tec and PFIFF together in Germany and now in the USA. Read more Classic Nexus 3 Tricycle Proven Nexus 3 Tricycle Classic Nexus 3 Transport Tricycle Comfort Tricycle Eco Adult Tricycle Scooter Trike Tricycle Frame / Fork Heavy Duty Tig Welded Steel Frame & Fork with Anti-Corrosive Power Coating Paint Heavy Duty Tig Welded Steel Frame & Fork with Anti-Corrosive Powder Coating Paint Made from Aluminum Heavy Duty Tig Welded Steel Frame & Fork with Anti-Corrosive Powder Coating Paint Steel Step-Through Frame on Steel Fork Heavy Duty Tig Welded Steel Frame & Fork with Anti-Corrosive Powder Coating Paint Wheels / Tires Kenda Multi-Surface Tires, 26” Front & 24” Rear, and Double-Wall Alloy Rims 26” Front & 24” Rear Smooth Tread Reflective Tires, & Double-Wall Alloy Rims Double Wall Alloy Rims & Schwalbe Marathon Plus Reflective Tires Smooth Tread Reflective Tires, & 24” Double-Wall Alloy Rims 24” Tires on Aluminum Rims Schwalbe Reflective Smooth Tread Tires, Double-Wall Aluminum Rims, 16” Front & 20” Rear Drivetrain Shimano Nexus Internal 3 Speed, Alloy Cranks, & Shimano Shifters Shimano Nexus 3 Speed Internal Hub Shimano Nexus Internal 3 Speed Internal Hub 7 Speed Internal Hub with SRAM Twist Shifter 3-Speed Shimano Nexus Internal Hub Internal 5 speed with Reverse Drive Technology Brakes / Cockpit Alloy V-Brakes and Parking Brake, Velo Comfort Saddle, Promax Alloy Adjustable Stem, & Comfort Pedals Alloy V-Brakes & Parking Brake, Comfort Saddle, Alloy Adjustable Stem, Comfort Pedals, & Alloy Cranks Alloy Parts with a Wens Comfort Saddle, Adjustable Stem, V-Brakes, & Aluminum Crank Coaster Brake, Alloy V-Brake, Parking Brake, HUGE Comfort Seat & Grips Front V-Brake, Rear Coaster Brake, Parking Brake, Black Cruiser-Style Handlebar, Comfort Grips, & Non-Slip Pedals with Reflectors Coaster Brake, Alloy V-Brake, Parking Brake, Full Comfortable Seat (not just a saddle) & Grips Extras Rack, Basket, & Fenders Rear Basket, Fenders, & Bell Front & Rear Rack, Fenders, Quick Release Seat Post Reflective Tires & Cargo Crates Rear Basket, Saddle Back Support, Fenders, UpRight Handlebars, & Quick Release Seat Post Clamp Rear Cargo Basket, Fenders, Chainguard, & Bell Rear Rack and Baskets, Adjustable Seat Height, Adjustable Stem, & Rear Suspension Made in Germany ✓ ✓ ✓ ✓ ✓ ✓ All pfautec products come with full customer support here in the heartland of the USA. Whether you have a technical question or just want to know more about your vehicle we are here to assist you. BikeAid stands for quality products from real people to support your needs. Read more "
    },
    {
      "docid": 1317354,
      "title": "SunF 30x10R14 30x10x14 All Terrain Tires ATV UTV 8 PR POWER I A033 - SET of 4",
      "text": "Product Description SunF Corporation has dedicated themselves to meeting their customer’s demands and needs. SunF develops and manufactures a wide variety of quality tires in the specialty market. Their line up includes ST trailer, lawn and garden, agriculture, golf cart, ATV Quad Motorcycle, UTV Side by Side, light truck & more! The SunF A033 is among the worlds most popular footprints. Its aggressive, non directional tread pattern maintains even braking and a smooth ride while providing maximum traction. For more details, see full description. If you have any questions or concerns, please contact us. Directional angled knobby tread design great in most terrain with high performance on trails and suitable for desert, mud, dirt and rock applications. Features premium rubber in our hard compound to withstand the harshest racing conditions. A perfect replacement tire for your quad ATV, UTV, Go Kart, Golf Cart or Lawn Mower.Heavy 8 ply rated construction resists punctures and abrasions.Lug depth and pattern offers enhanced skid and traction control, great in cross country or desert conditions. Aggressive shoulder knobs provide superb side bite and traction with added protection to rim and sidewall. Trully a great ALL TERRAIN tire at an affordable price (compared to Bighorn).Rim(s) NOT included. Please see full description for specifications. Contact us with any questions or concerns!Size 1: 30x10R14 Product Description SunF Corporation has dedicated themselves to meeting their customer’s demands and needs. SunF develops and manufactures a wide variety of quality tires in the specialty market. Their line up includes ST trailer, lawn and garden, agriculture, golf cart, ATV Quad Motorcycle, UTV Side by Side, light truck & more! The SunF A033 is among the worlds most popular footprints. Its aggressive, non directional tread pattern maintains even braking and a smooth ride while providing maximum traction. For more details, see full description. If you have any questions or concerns, please contact us. Directional angled knobby tread design great in most terrain with high performance on trails and suitable for desert, mud, dirt and rock applications. Features premium rubber in our hard compound to withstand the harshest racing conditions. A perfect replacement tire for your quad ATV, UTV, Go Kart, Golf Cart or Lawn Mower.Heavy 8 ply rated construction resists punctures and abrasions.Lug depth and pattern offers enhanced skid and traction control, great in cross country or desert conditions. Aggressive shoulder knobs provide superb side bite and traction with added protection to rim and sidewall. Trully a great ALL TERRAIN tire at an affordable price (compared to Bighorn).Rim(s) NOT included. Please see full description for specifications. Contact us with any questions or concerns!Size 1: 30x10R14"
    },
    {
      "docid": 837336,
      "title": "Carlisle Trac Chief Industrial Tire -12-16.5",
      "text": "Product Description Package Height: 12.0\" Product Description Package Height: 12.0\""
    },
    {
      "docid": 1294538,
      "title": "Meguiar's G-9524 Wheel Cleaner",
      "text": "Product Description Product Description With Meguiar's Hot Rims Wheel & Tire Cleaner you'll actually see the grime lift off your wheels and tires! Our Xtreme Cling foam is designed to cling vigorously to vertical surfaces and dissolve anything between your wheels and a brilliant shine! Safe on all clear coated wheels. Amazon.com Meguiar’s Hot Rims All Wheel and Tire Cleaner is designed to be safe on all clear coated wheels and wash grime with ease, leaving behind not only clean wheels, but clean tire sidewalls as well. Its unique foaming solution, Xtreme Cling is designed to cling to vertical surfaces and break down stubborn road residue from both metal and rubber. With Meguiar’s Hot Rims All Wheel and Tire Cleaner, car lovers can feel the satisfaction of a deep cleaning session by watching the Xtreme Cling solution foam, turning from white to brown as it grabs all brake dust build up and grime. What’s more, this unique product is safe to use on all factory-coated wheels, taking the stress of finding the right wheel cleaner out of the equation. Before Cleaning the Wheels Know that there is a variety: The first step in wheel care is recognizing that not all wheels are made the same. Wheels are made from different types of materials and coatings. The product used on the wheels is determined by the surface which can range anywhere from chrome, powder coated, painted, to polished aluminum and many more. Identify what is being driven on: The next step is to determine what kind of wheels on the vehicle. Most wheels that come with a factory-purchased vehicle are clear coated wheels. However if they have been replaced with aftermarket wheels, find out the surface material by contacting the manufacturer. Some wheels may even be coated with two or three different types of coatings, depending on how customized they are. Choosing The Right Wheel Cleaner When using a wheel cleaner to remove brake dust and grime there are three products Meguiar’s that are available to choose from: Meguiar’s Hot Rims Aluminum Wheel Cleaner, Meguiar’s Hot Rims All Wheel and Tire Cleaner, and Meguiar’s Hot Rims Chrome Wheel Cleaner. Meguiar’s Hot Rims Aluminum Wheel Cleaner is safe for uncoated or polished aluminum, anodized and powder coated wheels. This is the safest Meguiar’s wheel cleaner and is also recommended if the wheel type cannot be determined. Meguiar’s Hot Rims All Wheel and Tire Cleaner is safe for all factory coated wheels. Meguiar’s Hot Rims Chrome Wheel Cleaner is specifically designed for all chrome plated wheels, and is sure to give a mirror-like finish. Knowing the Consequences of Choosing the Incorrect Wheel Cleaner Using the wrong product with the wrong surface can potentially cause permanent damage to the surface of the wheels, brake or even suspension components. Make sure to read the label on any product used and check that it is meant to work with the wheels’ surface. If unsure of the wheel type and unable to contact the manufacturer, start with the most gentle wheel cleaner and testing a small area. Applying Meguiar’s Hot Rims All Wheel and Tire Cleaner For best results, apply in a well-ventilated area, one wheel at a time. It is not safe for motorcycle wheels or aftermarket, painted or colored brake components. 1. Rinse wheel thoroughly with cold water. 2. Coat wheels and tires with Meguiar’s Hot Rims All Wheel and Tire Cleaner holding bottle 6-8 inches away. Coat one wheel at a time. 3. Wait 15 seconds to allow foaming cleaners to penetrate and dissolve build-up. For heavy build-up, agitate surface with brush. 4. Rinse thoroughly with water. 5. Dry wheel with a clean towel or premium microfiber. Product Description Product Description With Meguiar's Hot Rims Wheel & Tire Cleaner you'll actually see the grime lift off your wheels and tires! Our Xtreme Cling foam is designed to cling vigorously to vertical surfaces and dissolve anything between your wheels and a brilliant shine! Safe on all clear coated wheels. Amazon.com Meguiar’s Hot Rims All Wheel and Tire Cleaner is designed to be safe on all clear coated wheels and wash grime with ease, leaving behind not only clean wheels, but clean tire sidewalls as well. Its unique foaming solution, Xtreme Cling is designed to cling to vertical surfaces and break down stubborn road residue from both metal and rubber. With Meguiar’s Hot Rims All Wheel and Tire Cleaner, car lovers can feel the satisfaction of a deep cleaning session by watching the Xtreme Cling solution foam, turning from white to brown as it grabs all brake dust build up and grime. What’s more, this unique product is safe to use on all factory-coated wheels, taking the stress of finding the right wheel cleaner out of the equation. Before Cleaning the Wheels Know that there is a variety: The first step in wheel care is recognizing that not all wheels are made the same. Wheels are made from different types of materials and coatings. The product used on the wheels is determined by the surface which can range anywhere from chrome, powder coated, painted, to polished aluminum and many more. Identify what is being driven on: The next step is to determine what kind of wheels on the vehicle. Most wheels that come with a factory-purchased vehicle are clear coated wheels. However if they have been replaced with aftermarket wheels, find out the surface material by contacting the manufacturer. Some wheels may even be coated with two or three different types of coatings, depending on how customized they are. Choosing The Right Wheel Cleaner When using a wheel cleaner to remove brake dust and grime there are three products Meguiar’s that are available to choose from: Meguiar’s Hot Rims Aluminum Wheel Cleaner, Meguiar’s Hot Rims All Wheel and Tire Cleaner, and Meguiar’s Hot Rims Chrome Wheel Cleaner. Meguiar’s Hot Rims Aluminum Wheel Cleaner is safe for uncoated or polished aluminum, anodized and powder coated wheels. This is the safest Meguiar’s wheel cleaner and is also recommended if the wheel type cannot be determined. Meguiar’s Hot Rims All Wheel and Tire Cleaner is safe for all factory coated wheels. Meguiar’s Hot Rims Chrome Wheel Cleaner is specifically designed for all chrome plated wheels, and is sure to give a mirror-like finish. Knowing the Consequences of Choosing the Incorrect Wheel Cleaner Using the wrong product with the wrong surface can potentially cause permanent damage to the surface of the wheels, brake or even suspension components. Make sure to read the label on any product used and check that it is meant to work with the wheels’ surface. If unsure of the wheel type and unable to contact the manufacturer, start with the most gentle wheel cleaner and testing a small area. Applying Meguiar’s Hot Rims All Wheel and Tire Cleaner For best results, apply in a well-ventilated area, one wheel at a time. It is not safe for motorcycle wheels or aftermarket, painted or colored brake components. 1. Rinse wheel thoroughly with cold water. 2. Coat wheels and tires with Meguiar’s Hot Rims All Wheel and Tire Cleaner holding bottle 6-8 inches away. Coat one wheel at a time. 3. Wait 15 seconds to allow foaming cleaners to penetrate and dissolve build-up. For heavy build-up, agitate surface with brush. 4. Rinse thoroughly with water. 5. Dry wheel with a clean towel or premium microfiber.From the manufacturer Meguiar’s tire and wheel cleaner powers through brake dust & grime If you have factory OEM clear coated wheels, Meguiar’sHot Rims Wheel & Tire Cleaner is the perfect solution for cleaning your wheels and getting them looking “like new” again. This formula is specifically designed to power through grimy brake dust on wheels and deep clean tires all in one product. The Xtreme Cling foam clings vigorously to vertical surfaces to maximize cleaning. Not for use on sensitive surfaces like uncoated aluminum, anodized, magnesium, powder coated, aftermarket or motorcycle wheels and painted or colored brake components. Wheel Type & Finish With all the different ways to manufacture a wheel, the use of different materials and various finishing processes, it can often make it really challenging to determine what your wheels are made of and what the surface is you’re working with. Ultimately using the wrong product on the wrong surface can quickly cause permanent damage to your wheels, brakes and even aftermarket suspension components. Read more Tips to get the best results using Meguiar’s Hot Rims Wheel & Tire Cleaner Be 100% sure that you are working with factory OEM clear coated wheels before using. Use in a well-ventilated area on a cool wheel in the shade. Consider using gloves and protective eyewear. Rinse wheel and tire thoroughly with cold water. Clean one wheel and tire at a time. Spray wheel & tire with product holding bottle 6-8 inches away. Wait a maximum of 30 seconds to allow foaming cleaners to penetrate & dissolve build-up. Do not allow product to dry. For heavy build-up, agitate surface with a premium gentle wheel brush. Rinse wheel and tire thoroughly with water. Dry wheel with a 100% cotton terry cloth towel or a premium microfiber, such as Meguiar’sSupreme Shine Microfiber Drying Towel to get the best appearance and prevent water spotting. Read more Different wheel cleaners for different surfaces Meguiar’s Hot Rims Aluminum Wheel Cleaner is engineered specifically for uncoated aluminum and other sensitive surfaces. An excellent choice to clean aftermarket wheels, this is Meguiar’s safest, least-aggressive wheel cleaner. Meguiar’s Hot Rims Wheel and Tire Cleaner is designed to foam away brake dust, dirt & grime, and is specifically formulated for factory OEM painted and clear coated rims. It also excels at cleaning tires. Meguiar’s Hot Rims Chrome Wheel Cleaner is a powerful formula that quickly removes grime, grit and stubborn brake dust from chrome wheels. Meguiar’s Ultimate All Wheel Cleaner is formulated to deliver powerful cleaning that is still gentle enough that it’s safe on all wheels. It’s acid free and pH balanced to prevent causing harm to wheels or aftermarket brake components. Read more For more than 115 years, Meguiar’s has provided Car Crazy people with specialized, state-of-the-art formulations for making every car’s appearance show car perfect. Meguiar’s provides high performance car care products for every automotive surface, both on the interior and exterior of cars. The car care experts at Meguiar’s are dedicated to making sure customers get the premium results they are looking for. Read more Consumer Meguiar’s has several lines of products designed for all aspects of at-home interior and exterior car care. With multiple product families, every customer is sure to find the right product for them, with options from the premium Ultimate line, Gold Class line, Classic Meguiar’s products, and more. From headlight care, to interior detailing, to all five steps of maintaining your paint (wash, clean, polish, protect, maintain), Meguiar’s has a premium product for every aspect of care. Mirror Glaze Meguiar’s Mirror Glaze products are ideal for the true car care professional. With products ranging from aggressive Detailing Clay, to Swirl Remover, various Compounds, Sealants, and more, detailing enthusiasts, professional detailers, and body shops professionals can find exactly what they need to get that show car shine. When walking around at some of your favorite car shows, such as the Pebble Beach Concours d’Elegance, you’ll find that many trust the Meguiar’s Mirror Glaze line to get their cars ready for the big day. Detailer Meguiar’s Detailer products are the perfect solution for anyone running a garage, washing and detailing several cars a week, and commercial car washes. With quality concentrate product provided in large containers (1-gallon and 5-gallon for many products), customers won’t be running to the store every other day for more of their favorite cleaning and detailing products. Meguiar’s also offers labeled and color-coded spray bottles for users to dilute the Detailer product in and use with ease. Marine / RV Meguiar’s Marine & RV products are ideal for boat and RV owners of all kinds. All the basic care products, such as Gel Wash, Vinyl and Rubber Cleaner, and Quik Wax, are included in the Classic Marine and RV line. For the most extreme watercrafts, Meguiar’s formulated the Extreme Marine line, with Water Spot Detailer, Multi-Surface Cleaner, and Vinyl & Rubber Protectant, in a sleek, spherical bottle. For your premium vessel, you can also look to Meguiar’s Flagship line to beautify and protect your boat. Read more "
    },
    {
      "docid": 632128,
      "title": "2-Pack of Premium 15x6.00-6 Inner Tubes with TR-13 Valve Stem - For Riding Mowers / Lawn Mowers, Go-Karts / Go Karts, Golf Carts and More",
      "text": "Product Description Read more Read more Replacement Tire Inner Tubes Replacement Tire Inner Tubes Replacement Tire Inner Tubes Tire Size Fitment 4.10/3.50-4\" 15/6.00-6\" 4.80/4.00-8\" Outer Diameter 10\" 15.5\" 15.5\" Quantity 2 Inner Tubes 2 Inner Tubes 2 Inner Tubes Ideal Usage Hand Trucks, Dollies, Wheelbarrows, Lawn Mowers & More Riding Mowers, Lawn Mowers, Go-Karts, Golf Carts & More Wheelbarrows, Lawn Mowers, Hand Trucks, Carts, Trailers & More Max Inflation 30 PSI 30 PSI 30 PSI Read more "
    },
    {
      "docid": 104906,
      "title": "3 New 3 Wheeler WANDA ATV Tires 22X11-8 4PR P322 Dimple Knobby - 10026",
      "text": "Product Description Features: Cupped knobby tread for maximum traction; Heavy sidewall resists punctures; Low profile design for controlled sliding and added comfort and stability; Tire Specifications TireSize: 22x11-8 Brand: WANDA Pattern: P322 Ply Rated: 4 Tread Depth: 0.55\" Rim Width: 9\" Max Load: 330lbs@5psi Load Speed Index: 43J Product Description Features: Cupped knobby tread for maximum traction; Heavy sidewall resists punctures; Low profile design for controlled sliding and added comfort and stability; Tire Specifications TireSize: 22x11-8 Brand: WANDA Pattern: P322 Ply Rated: 4 Tread Depth: 0.55\" Rim Width: 9\" Max Load: 330lbs@5psi Load Speed Index: 43J"
    },
    {
      "docid": 730401,
      "title": "Carlisle Trac Chief Industrial Tire -14-17.5",
      "text": "Product Description Carlisle Trac Chief Industrial Tire -14-17.5 Product Description Carlisle Trac Chief Industrial Tire -14-17.5"
    },
    {
      "docid": 1338326,
      "title": "Park Tool Valve Core Remover",
      "text": "Product Description Park Tool VC-1 Bicycle Valve Core Tool The Park Tool VC-1 is a small, handy tool designed to remove and install Schrader and Presta valve cores from bicycle tires, as well as Presta valve extenders with 5mm wrench flats. Helpful for setting up tubeless tires, replacing damaged or leaking valve cores, and rapidly letting air out of large-volume tires. Read more A LEVER FOR EVERY TIRE Park Tool also offers a full lineup of tire lever designs for every need, from portability to daily use to brute strength: TL-1.2 Tire Levers TL-4.2 Tire Levers TL-5 Heavy Duty Tire Levers TL-6.2 Steel Core Tire Levers Quantity 3 2 2 2 Length 4.5 inches 4.5 inches 8 inches 5 inches Weight (each) 13 grams 17 grams 167 grams 33 grams Material Composite Composite Steel Composite-Covered Steel TRUSTED SINCE 1963 Since our origins in the back of a bike shop in 1963, it has been our sole mission to design and manufacture high-quality tools that empower mechanics and riders of all skill levels to service their bicycles. As with our other 500+ tools, our tire levers are a product of our decades of experience and expertise in the industry, in the shop and on the trail. Read more "
    },
    {
      "docid": 1273011,
      "title": "SUPERTEAM 700c Carbon Bicycle Wheel Front 60mm Rear 88mm Clincher Wheelset with Transparent Decal",
      "text": "Product Description Type: Carbon Wheelset Rim Size: 700CxFront 60mm Rear 88mm Clincher Rim Finish: 3k Matte Basalt Braking Surface Rim Depth: Front 60mm Rear 88mm Rim Width: 23mm Spoke Holes: Front 20 holes + Rear 24 holes Feature: 12-layer carbon on brake track (6-layer carbon on rim body) Cassette Body: fit for Shiman0 8/9/10/11 speed Hubs: R13 Hub Black Spoke: Aero Spokes Black Nipple: CN Alloy External Nipple Black Included Accessories : Brake pads ,Quick release(Skewers) Black Max Recommend Rider Weight: 120KG Max Recommend Tire Pressure: 125PSI Weight of Wheelset: 1720g±30g/pair Logo Painting: Could be customized according to your need Warranty:2 years under normal usage Product Description Type: Carbon Wheelset Rim Size: 700CxFront 60mm Rear 88mm Clincher Rim Finish: 3k Matte Basalt Braking Surface Rim Depth: Front 60mm Rear 88mm Rim Width: 23mm Spoke Holes: Front 20 holes + Rear 24 holes Feature: 12-layer carbon on brake track (6-layer carbon on rim body) Cassette Body: fit for Shiman0 8/9/10/11 speed Hubs: R13 Hub Black Spoke: Aero Spokes Black Nipple: CN Alloy External Nipple Black Included Accessories : Brake pads ,Quick release(Skewers) Black Max Recommend Rider Weight: 120KG Max Recommend Tire Pressure: 125PSI Weight of Wheelset: 1720g±30g/pair Logo Painting: Could be customized according to your need Warranty:2 years under normal usage"
    },
    {
      "docid": 397673,
      "title": "Carlisle Trac Chief Industrial Tire -5.70-12",
      "text": "Product Description Carlisle Trac Chief Industrial Tire -5. 70-12 Product Description Carlisle Trac Chief Industrial Tire -5. 70-12"
    },
    {
      "docid": 63132,
      "title": "For 07-13 Chevrolet Avalanche 07-20 Tahoe 07-20 Escalade ESV 17 Inch Black Painted Steel Rim - OE Direct Replacement - Road Ready Car Wheel",
      "text": "Product Description Car Wheel for 2007-2013 Chevrolet Avalanche 17 inch Steel Black Rim Fits R17 Tire - Exact OEM Replacement Road Ready focuses on specific manufacturer design for a perfect car rim replacement. All of our rims come compatible with all factory equipment including TPMS sensors, lug nuts, valve stems, wheel covers, tires, and winter tires. Note: This purchase DOES NOT include TPMS sensors, lug nuts, valve stems, or wheel covers Car Wheel for 2007-2013 Chevrolet Avalanche 17 inch Steel Black Rim Fits R17 Tire - Exact OEM Replacement Road Ready focuses on specific manufacturer design for a perfect car rim replacement. All of our rims come compatible with all factory equipment including TPMS sensors, lug nuts, valve stems, wheel covers, tires, and winter tires. Note: This purchase DOES NOT include TPMS sensors, lug nuts, valve stems, or wheel covers Car Wheel for 2007-2013 Chevrolet Avalanche 17 inch Steel Black Rim Fits R17 Tire - Exact OEM Replacement Road Ready focuses on specific manufacturer design for a perfect car rim replacement. All of our rims come compatible with all factory equipment including TPMS sensors, lug nuts, valve stems, wheel covers, tires, and winter tires. Note: This purchase DOES NOT include TPMS sensors, lug nuts, valve stems, or wheel covers Car Wheel for 2007-2013 Chevrolet Avalanche 17 inch Steel Black Rim Fits R17 Tire - Exact OEM Replacement Road Ready focuses on specific manufacturer design for a perfect car rim replacement. All of our rims come compatible with all factory equipment including TPMS sensors, lug nuts, valve stems, wheel covers, tires, and winter tires. Note: This purchase DOES NOT include TPMS sensors, lug nuts, valve stems, or wheel covers Front image Back Image Front image Fitment image ITEM SPECIFICATIONS Fits 2007 2008 2009 2010 2011 2012 2013 Chevy Avalanche Cadillac Escalade EXT Fits 2010 2011 2012 2013 2014 Chevy Express 1500 GMC Savana 1500 Fits 2015 2016 2017 2018 2019 2020 Cadillac Escalade Escalade ESV GMC Yukon XL 1500 Fits 2014 2015 2016 2017 2018 Chevy Silverado 1500 Fits 2014 2015 2016 2017 2018 2019 2020 Chevy Suburban 1500 GMC Yukon Fits 2014 2015 2016 2017 2018 2019 GMC Sierra 1500 Fits 2015 2016 2017 2018 GMC Sierra Denali 1500 Model 560-8072 Size 17\"x7.5\" Color Black Number Of Lugs 6 Center-Bore 78.1mm Offset 30mm OEM Part Number 09596426 Bolt Pattern 6-139.7mm or 6-5.50\" Read more Read more "
    },
    {
      "docid": 420460,
      "title": "Dura-Coating Wheely Clean Professional Wheel Cleaner, 16 oz. – Ready-to-Use Car Wheel Cleaner, Highly Effective for Aluminum, Chrome and Clear Coated Wheels",
      "text": "Product Description Dura-Coating Wheely Clean is our most powerful and effective wheel and tire cleaner. The ultra-concentrated, high-performance tire cleaning formula does the hard work for you and easily removes brake dust and oxidation, restores the original finish, and melts embedded debris to brighten and shine your wheels and rims. It’s a versatile wheel and tire cleaner that can also be used as a pre-treatment before you polish to remove stains, reducing polish time and the amount of polish you need to use. Wheely Clean is safe for glass, non-painted & clear coat wheels. Fast and easy to use, simply spray Wheely Clean on and let dwell for 1-2 minutes without allowing the product to dry out. Scrub with a wheel brush and rinse thoroughly. Product Description Dura-Coating Wheely Clean is our most powerful and effective wheel and tire cleaner. The ultra-concentrated, high-performance tire cleaning formula does the hard work for you and easily removes brake dust and oxidation, restores the original finish, and melts embedded debris to brighten and shine your wheels and rims. It’s a versatile wheel and tire cleaner that can also be used as a pre-treatment before you polish to remove stains, reducing polish time and the amount of polish you need to use. Wheely Clean is safe for glass, non-painted & clear coat wheels. Fast and easy to use, simply spray Wheely Clean on and let dwell for 1-2 minutes without allowing the product to dry out. Scrub with a wheel brush and rinse thoroughly."
    },
    {
      "docid": 829768,
      "title": "Carlisle Links Golf Cart Tire - 18X8.5-8",
      "text": "Product Description The Carlisle brand of specialty tires and wheels provides a comprehensive product portfolio for lawn and garden, ATV/ UTV, trailers/haulers, agriculture, construction, industrial, and tube/flap market segments. Driven by ingenuity and innovation, our Carlisle branded tires deliver utility for your workday and performance for your adventures. Product Description The Carlisle brand of specialty tires and wheels provides a comprehensive product portfolio for lawn and garden, ATV/ UTV, trailers/haulers, agriculture, construction, industrial, and tube/flap market segments. Driven by ingenuity and innovation, our Carlisle branded tires deliver utility for your workday and performance for your adventures."
    },
    {
      "docid": 1584906,
      "title": "EBIKELING Waterproof Ebike Conversion Kit with Battery 20\" Fat Tire Direct Drive Front or Rear Wheel Electric Bike Conversion Kit Ebike Battery & Charger Included 1500W 1200W Electric Bike for Adults",
      "text": "From the brand Previous page Ebike Conversion Kits Visit the Store Conversion Kits with Battery Visit the Store Memory Foam Bike Seats Visit the Store Torque Arms Visit the Store Other Accessories Visit the Store Next page Product Description YOU CAN CONVERT ALMOST ANY BIKE INTO AN ELECTRIC BIKE Affordable and powerful kit options, the comfort of the smooth installation process are only a few good things to start explaining what we're offering here at Ebikeling. We are offering a variety of power options that suits your lifestyle. A commute, a day at the beach, or a late-night hangout with your buddies, you will enjoy the ride and make great memories on the way with Ebikeling. Choose your bicycle tire size, easily convert your bike and enjoy your ride! 48V 12.8Ah Dolphin Battery Battery Specifications LG Cell Model 3200mAh Comes with an XT60 female connector Max Charge Voltage 54.6V Min Discharge Voltage 39V Charging Mode CC/CV AC Input 100-240V, 50/60 Hz Charging Time 4.5 hours We take care of everything. All you have to do is hit the road and enjoy the ride! Ebike Conversion Kit Specifications Recommended tire width: 4\" Rim Width (Inner): 80mm Rim Diameter (Outer): 418mm Rim Diameter (Inner): 380mm Spoke: 78mm 12G Carbon Steel Copper Nipples Rear dropout: 175mm Rear Axle Length: 238.5mm Front dropout: 135mm Front Axle Length: 210mm Kit Weight: Rear 24.5lbs / Front 21.5lbs Motor Torque: 30Nm Efficiency >80% Motor RPM (Nominal): 430 Motor Hub Diameter: 242mm Motor Magnets: 46 Peak Power: 1.45kW Operating Mode: S1 Read more ENJOY THE COMFORT OF YOUR NEXT JOURNEY IN EVERY WEATHER CONDITION! The waterproof ebike conversion kits are more reliable than regular ebike conversion kits in difficult weather conditions. They are designed to take a ride in the rain or snow. Already have a battery? Check out our conversion kits without Battery! Ebike Conversion Kit 48V 1200W 20\" Ebike Conversion Kit 36V 500W 20\" Ebike Conversion Kit 48V 1200W 20\" FAT Tire Read more FEEL THE POWER! Still think you would struggle to ride in difficult conditions? Let us make your ride much easier. Oh did you say hills? Peh! Everybody loves to ride a bike down the hill, but have you ever enjoy the comfort of riding an uphill without a hustle? At eBikeling, we're offering you a nonstop adventure experience. The aluminum double-walled rim and hub motor are already attached in the box. Kits are ready to install right out of the box, all you need to do is replace them with the original tire. The wheel axle diameter is 10 mm. Steel forks can be filed If the axle does not fit into the dropout because of its slightly larger diameter. Please do not file more than necessary and make sure that it does not damage the forks. Aluminum forks can also be filed with extra caution. Aluminum rims have openings for a Schrader-type valve. The kit doesn't have a regen brake option. The controller comes with an SY60 male-type battery connector (Compatible with XT60 connectors). PAS/Brake Levers are optional. Kits will operate without them. You will be able to use your own brakes. WE ARE HERE TO BUILD YOUR WHOLE BIKE Phone Holder Bag Secure and reliable method to access your phone and a storage for your accessories. Saddle Bag Durable, compact, and waterproof bag strapped under the seat to carry essential items at all times. Comfort Seat Thick high-density memory foam with dual anti-shock absorbing springs under the seat prevents impacts and allows a smooth comfy ride. Front Headlight Extremely bright and fully waterproof 400 Lumens LED headlight will enlighten your night riding experience Read more "
    },
    {
      "docid": 1499382,
      "title": "Zipp Unisex's 404 Carbon Tubeless Disc Brake 6-Bolt 700C 177D Rear 24Spokes Convertible-Quick Release & 12X142mm Through Axle A1 Wheel, Black Decal, XDR",
      "text": "Product Description Zip: Disc-Brake era goes Aero road bikes are ever evolving and ever inspiring. The new 404 fire crest carbon clincher tubeless Disc-Brake wheel set offers cyclists everywhere The opportunity to experience superior braking and stopping power to match the Speed and stability of Our most popular and versatile 58mm rim depth. Aero has never been so affordable and attainable. The consistency and power of disc brakes provides precision modulation and stopping power, literally at your fingertips. As for speed, the 404 fire crest is where the fire crest revolution began. If you had to choose just one wheel, The 404 fire crest should be your Choice. With A depth and shape proven in all conditions, Its a classic all-around performer and the standard by which all other wheels are measured. At the centre of the 404 fire crest carbon clincher tubeless Disc-Brake is the durable and versatile 77/177D hub set, which offers options for riders to switch wheels from quick-release to thru-axle without tools. Things to remember Aero, durable, light weight 77/177 hub set thru-axle compatible features and benefits fire crest rim technology provides world class handling and stability 77/177D hub set, with its best-in-class durability and improved bearing protection, all with no pre-load adjustment needed Aero performance, durable and light weight to ensure compatibility with any bike, our Versatile 77/177D hubs come with swappable end caps to work with qtrs. and thru-axles tubeless ensuring secure performance even when ridden at lower tire pressures. Is 4210 compliant. Specifications Size (wheels): 700Crim construction: carbon tire compatibility: clincher tubeless ready brake compatibility: disc (6-bolt)rim - Inside width: 19Mmrim profile: symmetrical rim finish: UD fibre, adhesive de Ca ls colour (decal): Black, white nipple material: aluminium spoke type: cx-ray - black spoke count: 24spoke pattern: 2 cross driver body type: Campagnolo, SRAM XDR, SRAM/Shimano road axle type (wheels): conversion caps included bearings: cartridge - Carbon steel driver mechanism: 3 pawls leaf spring. Product Description Zip: Disc-Brake era goes Aero road bikes are ever evolving and ever inspiring. The new 404 fire crest carbon clincher tubeless Disc-Brake wheel set offers cyclists everywhere The opportunity to experience superior braking and stopping power to match the Speed and stability of Our most popular and versatile 58mm rim depth. Aero has never been so affordable and attainable. The consistency and power of disc brakes provides precision modulation and stopping power, literally at your fingertips. As for speed, the 404 fire crest is where the fire crest revolution began. If you had to choose just one wheel, The 404 fire crest should be your Choice. With A depth and shape proven in all conditions, Its a classic all-around performer and the standard by which all other wheels are measured. At the centre of the 404 fire crest carbon clincher tubeless Disc-Brake is the durable and versatile 77/177D hub set, which offers options for riders to switch wheels from quick-release to thru-axle without tools. Things to remember Aero, durable, light weight 77/177 hub set thru-axle compatible features and benefits fire crest rim technology provides world class handling and stability 77/177D hub set, with its best-in-class durability and improved bearing protection, all with no pre-load adjustment needed Aero performance, durable and light weight to ensure compatibility with any bike, our Versatile 77/177D hubs come with swappable end caps to work with qtrs. and thru-axles tubeless ensuring secure performance even when ridden at lower tire pressures. Is 4210 compliant. Specifications Size (wheels): 700Crim construction: carbon tire compatibility: clincher tubeless ready brake compatibility: disc (6-bolt)rim - Inside width: 19Mmrim profile: symmetrical rim finish: UD fibre, adhesive de Ca ls colour (decal): Black, white nipple material: aluminium spoke type: cx-ray - black spoke count: 24spoke pattern: 2 cross driver body type: Campagnolo, SRAM XDR, SRAM/Shimano road axle type (wheels): conversion caps included bearings: cartridge - Carbon steel driver mechanism: 3 pawls leaf spring."
    },
    {
      "docid": 821312,
      "title": "Superteam Carbon Fiber Road Disc Brake Wheelset 50mm Clincher Wheels 25mm Width",
      "text": "Product Description Type: Carbon Wheelset Rim Size: 700Cx50mm Clincher Rim Finish: 3k Matte(thirty percent matte) Rim Depth: 50mm Rim Width: 25mm Spoke Holes: Front 24 holes + Rear 24 holes Feature: 12-layer carbon on brake track (without braking line) Cassette Body: fit for Shiman0 8/9/10/11 speed Hubs: CX3 Road Bike Disc Brake Hub Black Hub Type: Six Bolt/Center Lock O.L.D: QR Type Front 9*100mm Rear 10*135mm Thru-Axle Type Front 15*100mm Rear 12*142mm Thru-Axle Type Front 12*100mm Rear 12*142mm Spoke: CN474 Spoke Black Nipple: CN Alloy External Nipple Black Included Accessories : Quick release(Skewers) Black Brake pads:No need Package included: 1 pair wheelset , 1 pair skewer , 1 pair rim tape ,extra spokes nipples Max Recommend Rider Weight: 120KG Max Recommend Tire Pressure: 125PSI Weight of Wheelset: 1780g±30g/pair Logo Painting: Could be customized according to your need Warranty:2 years under normal usage Product Description Type: Carbon Wheelset Rim Size: 700Cx50mm Clincher Rim Finish: 3k Matte(thirty percent matte) Rim Depth: 50mm Rim Width: 25mm Spoke Holes: Front 24 holes + Rear 24 holes Feature: 12-layer carbon on brake track (without braking line) Cassette Body: fit for Shiman0 8/9/10/11 speed Hubs: CX3 Road Bike Disc Brake Hub Black Hub Type: Six Bolt/Center Lock O.L.D: QR Type Front 9*100mm Rear 10*135mm Thru-Axle Type Front 15*100mm Rear 12*142mm Thru-Axle Type Front 12*100mm Rear 12*142mm Spoke: CN474 Spoke Black Nipple: CN Alloy External Nipple Black Included Accessories : Quick release(Skewers) Black Brake pads:No need Package included: 1 pair wheelset , 1 pair skewer , 1 pair rim tape ,extra spokes nipples Max Recommend Rider Weight: 120KG Max Recommend Tire Pressure: 125PSI Weight of Wheelset: 1780g±30g/pair Logo Painting: Could be customized according to your need Warranty:2 years under normal usage"
    },
    {
      "docid": 1110153,
      "title": "Bell Flat Defense Road Bike Tire",
      "text": "Product Description Bell flat Defense technology provides a protective layer with increased strength and extra puncture resistance. Road bike tires feature a new, optimized tread pattern for fast rolling and sure cornering. The inverted tread provides a sure grip but less rolling resistance for easier pedaling on pavement. A carbon steel BEAD allows the tire to be folded without damage for easy storage. Product Description Bell flat Defense technology provides a protective layer with increased strength and extra puncture resistance. Road bike tires feature a new, optimized tread pattern for fast rolling and sure cornering. The inverted tread provides a sure grip but less rolling resistance for easier pedaling on pavement. A carbon steel BEAD allows the tire to be folded without damage for easy storage.From the manufacturer Read more Durable Bell tires are ultra durable and made for adventure. The tires will stand the test of time, ride after ride. Optimized Tread Bell tires feature a smoother, rolling tread with superior traction for ultimate control. Our tires perform great on dirt as well as pavement. Flat Defense Puncture Resistance Flat Defense is a protective layer under the tread that provides more strength and extra puncture resistance to help protect against flats. Read more BMX Comfort Cruiser Kids Mountain Hybrid/Road Standard Tire ✓ ✓ ✓ ✓ ✓ ✓ Flat Defense Technology ✓ ✓ ✓ - ✓ ✓ Size Range 20\" 26\" 26\" 12.5\" up to 20\" 18\" up to 29\" 27\", 700 x 35c, 700 x 38c PSI Range 35-40 29-65 40-65 35-36 35-36 50-95 "
    },
    {
      "docid": 230085,
      "title": "Set of 2 WANDA UTV ATV Tires 22x11-8 22x11x8 4PR High Load -10141",
      "text": "Product Description HEAVY DUTY 1000lbs/tire capacity great for utility working ATV. With exceptional ride stability combined with great all terrain traction. The Python's proven tread design has low rolling resistance turning horsepower into forward motion. Heavy 4 ply rated construction resists punctures and abrasions. Tires only, rims are not included Tire Specifications Tire Size: 22X11-8 Brand: WANDA Tread Pattern: P334 Ply Rated: 4 Tread Depth: 0.63 Rim Width: 9 Max Load: 1000lbs@20psi Load Index: 80 Speed Rating: B Please note: fitment guide is for reference only and does not guarantee the tire will fit your specific model. Please check your owner's manual to ensure proper fitment. Product Description HEAVY DUTY 1000lbs/tire capacity great for utility working ATV. With exceptional ride stability combined with great all terrain traction. The Python's proven tread design has low rolling resistance turning horsepower into forward motion. Heavy 4 ply rated construction resists punctures and abrasions. Tires only, rims are not included Tire Specifications Tire Size: 22X11-8 Brand: WANDA Tread Pattern: P334 Ply Rated: 4 Tread Depth: 0.63 Rim Width: 9 Max Load: 1000lbs@20psi Load Index: 80 Speed Rating: B Please note: fitment guide is for reference only and does not guarantee the tire will fit your specific model. Please check your owner's manual to ensure proper fitment."
    },
    {
      "docid": 141712,
      "title": "Panaracer",
      "text": "Product Description Product Description Tour is our standard all around touring or urban commuting tire. Its comprehensive size range ensures that you can find a Tour for most any usage. Ride it and trust it From the Manufacturer Weight: 950g. Features an all-season tread pattern. Wire bead construction.. Product Description Product Description Tour is our standard all around touring or urban commuting tire. Its comprehensive size range ensures that you can find a Tour for most any usage. Ride it and trust it From the Manufacturer Weight: 950g. Features an all-season tread pattern. Wire bead construction.."
    },
    {
      "docid": 1060001,
      "title": "RockTrix RT105 17 inch Wheels Compatible with Jeep Wrangler JK JL 17x9 5x5 Wheels (+12mm Offset) 5.5in Backspace, 5x5 PCD, 71.5mm Bore, Black, Also fits Gladiator Commander Grand Cherokee (Set of 4)",
      "text": "From the brand Previous page Offering a wide line of offroad wheels and wheel accessories for your rig, including lug nuts and wheel spacers. RockTrix Offroad is your aftermarket wheel specialist with over 10 years of experience with in depth knowledge about not only our products, but the needs of our customers. We have everything we need for you to tackle the toughest trails and take on new adventures. RockTrix Customer Favorites Visit the Store RockTrix RT105 Created specifically for JK, JL, and JT Wrangler/Gladiator. Fits like OEM rims without the need of wheel spacers, adapters or hubrings. RockTrix RT113 The Rocktrix RT113 Multi Straight Spoke Design, Simulated Bead Lock Lip, Sporty yet Sophisticated. RockTrix RT1109 A timeless classic! This wheel is made for the Jeep Wrangler JK, JL and Jeep Gladiator JT, meaning a direct bolt on fit. RockTrix RT114 By adding aerofins around the 9 flat spokes, we were able to create something contemporary, but classically inspired. Shop RockTrix Wheels Visit the Store RockTrix RT116 Retro styled 8 Straight Spoke for your Toyota truck or SUV. Available in Matte Black and Matte Bronze. RockTrix RT115 We were able to incorporate an aerofin feature paired with 5 wide spokes to create a unique and head-turning combination. RockTrix RT112 A simple yet effective, modern 6 spoke design. These wheels are strong on the trails and easy to clean. RockTrix RT111 Classic teardrop multispoke style windows infused with a modern twist. Complete with 1\" lip and a simulated bead lock and steel rivets. What makes our products unique? Our wheel are made of aluminum and CNC machined to exact specifications. They are visually sleek, and modern, as well as scratch, rust, and corrosion resistant. About our Wheels Our wheels are machined to the exact specifications of your rig. The wheels will fit like a glove at the ideal backspacing, without any spacers, adapters or hubcentric rings. Our finish feature a clear coat that can endure the toughest weather conditions. Next page Product Description RockTrix Wheels We have in-depth knowledge of all of the products that we manufacture and carry. Over the years, we have developed a diverse line of products. We manufacture and sell a wide range of wheels, spacers & adapters, as well as suspension components. Read more Wheel Specifications: Wheel Size : 17x9 Wheel Offset : +12mm Backspace : 5.5\" Bolt Pattern (mm) : 5x127 Bolt Pattern (inches) : 5x5\" Wheel Centerbore : 71.5mm Load Rating : 2200 lbs RockTrix RT105 4pc 17\" Wheels Rims for 5x5\" Jeep | 17x9 | 71.5mm Bore | +12mm Offset (5.5\" Backspace) Uncompromising quality From mall crawling to 4 wheeling, these RockTrix RT105 wheels will let you ride around in style. Engineered to withstand the rigors of both on- and off-road use, our wheels are a great addition to any Jeep owner's mod list. With at least 1/2\" of additional inner clearance over factory wheels, you'll get some extra space for suspension components that you already have or plan to get. Why would you not want to separate yourself from the pack? See below for the application guide. 2018+ Jeep Wrangler (JL) 2007-2018 Jeep Wrangler (JK) 2019+ Jeep Gladiator (JT) 2005-2021 Jeep Grand Cherokee (WK / WK2) - Aggressive Sizing 2006-2010 Jeep Commander (XK) FITMENT NOTE: Wheels will extend past fenders. Read more Kit Contents Four (4) RT105 Wheels. Four (4) Center Caps. Valve stems NOT included. Construction One piece cast aluminum construction. CNC machined to exact specifications. Matte Black finish with tough clear coat to endure the toughest of weather conditions. Design 5 V-Spoke design with sporty styling. Designed with rigidity and durability in mind. Looks superb on any Jeep. Read more Verify Your Lug Nut Size and Seat Check your existing lug nuts for compatibility. Your lug nuts must be cone / conical / taper seat if you want to use them on these wheels. Your lug nuts must not be thicker/wider than 1.25\", or they will not fit in the lug holes of the wheels. Your lug socket must not be thicker/wider than 1.25\", or it will not fit in the lug holes. See ASIN B01M1ZG721 for nuts compatible with the Jeep Wrangler JK, Grand Cherokee WK, Commander. See ASIN B00OMMBGNW for nuts compatible with the Jeep Wrangler JL, Gladiator JT, or Grand Cherokee WK2 TIRE CHOICE IS IMPORTANT! Works with 29-35\" Tires. Refer to the diagram below of the most common tire size choices. Check with a qualified installer if your desired tire size is not listed. For installation, we highly recommend using a qualified shop that has experience with mounting truck/SUV/offroad tires. NOTE: Vehicles pictured are running the -12mm offset (4.5\" backspace) wheels. Tire Size Options "
    },
    {
      "docid": 49720,
      "title": "RockTrix RT105 17 inch Wheels Compatible with Jeep Wrangler JK JL 17x9 5x5 Wheels (-12mm Offset) 4.5in Backspace, 5x5 PCD, 71.5mm Bore, Black Wheels, Also fits Gladiator JT Rims (Set of 4)",
      "text": "From the brand Previous page Offering a wide line of offroad wheels and wheel accessories for your rig, including lug nuts and wheel spacers. RockTrix Offroad is your aftermarket wheel specialist with over 10 years of experience with in depth knowledge about not only our products, but the needs of our customers. We have everything we need for you to tackle the toughest trails and take on new adventures. RockTrix Customer Favorites Visit the Store RockTrix RT105 Created specifically for JK, JL, and JT Wrangler/Gladiator. Fits like OEM rims without the need of wheel spacers, adapters or hubrings. RockTrix RT113 The Rocktrix RT113 Multi Straight Spoke Design, Simulated Bead Lock Lip, Sporty yet Sophisticated. RockTrix RT1109 A timeless classic! This wheel is made for the Jeep Wrangler JK, JL and Jeep Gladiator JT, meaning a direct bolt on fit. RockTrix RT114 By adding aerofins around the 9 flat spokes, we were able to create something contemporary, but classically inspired. Shop RockTrix Wheels Visit the Store RockTrix RT116 Retro styled 8 Straight Spoke for your Toyota truck or SUV. Available in Matte Black and Matte Bronze. RockTrix RT115 We were able to incorporate an aerofin feature paired with 5 wide spokes to create a unique and head-turning combination. RockTrix RT112 A simple yet effective, modern 6 spoke design. These wheels are strong on the trails and easy to clean. RockTrix RT111 Classic teardrop multispoke style windows infused with a modern twist. Complete with 1\" lip and a simulated bead lock and steel rivets. What makes our products unique? Our wheel are made of aluminum and CNC machined to exact specifications. They are visually sleek, and modern, as well as scratch, rust, and corrosion resistant. About our Wheels Our wheels are machined to the exact specifications of your rig. The wheels will fit like a glove at the ideal backspacing, without any spacers, adapters or hubcentric rings. Our finish feature a clear coat that can endure the toughest weather conditions. Next page Product Description RockTrix Wheels We have in-depth knowledge of all of the products that we manufacture and carry. Over the years, we have developed a diverse line of products. We manufacture and sell a wide range of wheels, spacers & adapters, as well as suspension components. Read more Wheel Specifications: Wheel Size : 17x9 Wheel Offset : -12mm (4.5\" backspace) Bolt Pattern : 5x127 (5x5\") Wheel Centerbore : 71.5mm Load Rating : 2200 lbs RockTrix RT105 4pc 17\" Wheels Rims for 5x5\" Jeep | 17x9 | 71.5mm Bore | -12mm Offset (4.5\" Backspace) Uncompromising quality From mall crawling to 4 wheeling, these RockTrix RT105 wheels will let you ride around in style. Engineered to withstand the rigors of both on- and off-road use, our wheels are a great addition to any Jeep owner's mod list. With at least 1/2\" of additional inner clearance over factory wheels, you'll get some extra space for suspension components that you already have or plan to get. Why would you not want to separate yourself from the pack? See below for the application guide. 2018+ Jeep Wrangler (JL) 2007-2018 Jeep Wrangler (JK) 2019+ Jeep Gladiator (JT) FITMENT NOTE: Wheels will extend past fenders. Read more RT105 RT110 RT111 RT113 RT114 RT116 Color Black Black or Bronze Black or Bronze Black or Bronze Black or Bronze Black or Bronze Size 17x9 17x9 17x9 17x9 17x9 17x9 Offset -12mm -12mm -12mm -12mm -12mm -12mm Backspace 4.5 inches 4.5 inches 4.5 inches 4.5 inches 4.5 inches 4.5 inches Bolt Pattern 5x5\" (5x127mm) 5x5\" (5x127mm) 5x5\" (5x127mm) 5x5\" (5x127mm) 5x5\" (5x127mm) 5x5\" (5x127mm) Kit Contents Four (4) RT105 Wheels. Four (4) Center Caps. Valve stems NOT included. Construction One piece cast aluminum construction. CNC machined to exact specifications. Matte Black finish with tough clear coat to endure the toughest of weather conditions. Design 5 V-Spoke design with sporty styling. Designed with rigidity and durability in mind. Looks superb on any Jeep. Read more Verify Your Lug Nut Size and Seat Please double check your existing lug nuts for compatibility. Your lug nuts must be cone / conical / taper seat if you want to use them on these wheels. Your lug nuts must not be thicker/wider than 1.25\", or they will not fit in the lug holes of the wheels. Your lug socket must not be thicker/wider than 1.25\", or it will not fit in the lug holes. For nuts compatible with the Jeep Wrangler JK, see ASIN B01M1ZG721 For nuts compatible with the Jeep Wrangler JL or Gladiator JT, see ASIN B00OMMBGNW Tire Choice Information and Recommendations Works with 30-37\" Tires. Refer to the diagram below of the most common tire size choices. Check with a qualified installer if your desired tire size is not listed. For installation, we highly recommend using a qualified shop that has experience with mounting truck/SUV/offroad tires. "
    },
    {
      "docid": 1131165,
      "title": "TARAZON Supermoto 17\" & 17\" Complete Wheels Set Rims SX SXF EXC SXS XC XC-F XC-W EXC-F 125 150 200 250 300 350 400 450 500 505 525 530 540 Orange Hub",
      "text": "Product Description Item specifics Front wheel 3.5 \"x 17\" 36 holes with 22mm and 26mm wheel axle spacers Rear wheel 5.0 \"x 17\" 36 holes with 20mm and 25mm wheel axle spacers Color Orange hub / black rim Hub material 6061 T6 Aluminum CNC Machined Rim material 7116 T6 Alloy Spoke material 304 Stainless steel Rim Diameter 17in Rim Width 3.5'' + 5.0\" Safety Standard Certification DOT Certification Fit for SX 125 13-14 SX 125/150/250 15-19 XC 150/250/300 12-14, XC 250/300 15-16, XC 300 06-09 EXC 125/200/250 03-15 SX 200/450/525 03-06 XC-W 200 07-09, XC-W 200/500 2016 EXC-F 250 07-15 and 17-19 SX 150/250/350 12-14 SX-F 250/350/450 13-19 SXS-F 250 06-09 XC-F 250/505 07-09, XC-F 250 12-13, XC-F 250/350/450 15-19 XC-W 250/300 06-09 and 16-18 EXC 300 04-15, EXC 530 08-11 XC-W 300 6 days 17-18 EXC-F 350 12-19 XC-F 350 12-14 EXC-G 400 04-06 EXC 400 04-11 EXC-F 450 03-15 EXC-R/XC-F 450 08-09 SX-F 450 07-11 SXS/SXS-F 450 03-09 XC 450 QUAD 07-09 EXC-F 500 10-15 and 17-18 SX-F 505 07-09 EXC 525 03-07 XC-G/XC-W 525 06-08 SXS 540 03-06 Fit for HUSABERG ALL MODLES 04-13 Q&A Does this come with spacers bearings seals? Yes. Complete wheel set with 4 spacers and Bearing Seals Together, already assembled. Is it available in other hub color? Yes. We can custom the hub color,. Is this tubeles setup? No. The wheels can not use the tubeless tires. Tips Easy installation. Professional installation recommended Each wheel set have been tested, look and perform great Come with 4 size spacers, you just need to change the wheel spacers to make it fit Please confirm your model and year before purchasing Read more "
    },
    {
      "docid": 1019495,
      "title": "Jesdoo Solid Tire Replacement for Electric Scooter Xiaomi m365 / gotrax gxl V2,8.5 inches Scooter Wheel's Replacement Explosion-Proof Solid Tire.for Xiaomi M365 tire for scooter",
      "text": "Product Description Say goodbye to the trouble of broken tires If you have a flat tire while riding in a hurry, it will not only delay your important work or appointment, but also require you to spend a lot of time and energy to repair the inner tube. Not Afraid To Nail The solid tire don't have a tube and explosion-proof. Not afraid of nails, glass and other sharp objects. No need to maintenance, no need to pump and no need to patches. Say goodbye to tire repair! Technical Specifications: • Tyre Size: 8.1 inch • Tyre Material: Polyurethane rubber • Tyre Suitable: Xiaomi Mijia M365 scoote Read more Read more Step 1 You need to soften the tires: Before installation, you need to put the full honeycomb tire in boiling water for 20 minutes to soften it. Or put it in the microwave for 3 minutes to heat it, but in 3 times of 1 minutes of duration. Step 2 Cover the inside of the tire with soapy water or Vaseline (please avoid using the gasoline or lubricating oil, otherwise the tire will be damaged). Step 3 Place either side of the hub on the tire and step on this side (It is recommended to place another tire under this tire). Step 4 Use the professional tire levers to make the hub enter the tire. Read more Read more "
    },
    {
      "docid": 1095611,
      "title": "Tire Valve Stem Tool Remover & Installation - 4x Shorty BRASS Core Valve Stems, EASILY REPLACE Your Old Tubeless Valve Stems, 2x Valve Core Remover Caps, Removal & Installer Replacement Kit, OEM Grade",
      "text": "Product Description Complete kit for removing old leaky or faulty valves and installing new valves without marking or damaging your wheels. Perfect for ATVs, cars, pickups, trucks, ride on mowers, UTVs, hand trucks, tractors, motorcycles, 4x4s or any wheel using standard tubeless snap-in valves . This Bundle Pack Includes: ONE Valve Stem Puller/Installer/Remover Tool with Rubber Boot FOUR Shorty Black Rubber Valve Stems TWO Metal Valve Core Remover Valve Stem Caps --- Valve Stem Puller / Installer / Remover Tool ● Provides quick and easy installation and removal of valve stems ● Durable steel body with a knurled handle provides a secure non-slip grip even when wet or greasy ● Rubber over-mold protects expensive forged wheels and custom rims from possible marks or damage ● Pivoting head provides excellent leverage against the rim of the wheel and straightens for easy threading onto valve stem ● 12.5 inches long for maximum leverage makes this tool ideal for removing stubborn valve stems. 4x Short Black Rubber Valve Stems ● Low profile height is perfect for tight fitments and applications requiring maximum clearance such as ATVs, UTVs and offroading 4x4s ● 100% Leak tested, rubber snap-in valve stems ● Manufactured from brass and ozone-resistant rubber ● Designed for rim holes 11.5mm (.453\" diameter) 2x Valve Core Remover Stem Caps ● Incredibly handy combination metal valve stem covers AND valve core removers ● Never find yourself searching for that tiny little valve core remover tool again ● Nickel plated for years of corrosion free use "
    },
    {
      "docid": 1147827,
      "title": "Voyager Tools Flat-Free Tires 10\" Durable Wagon Dolly Cart Wheels (Black Red) 2pc Set",
      "text": "Product Description Durable and reliable! 10” flat free tire and wheel (colors: black, blue and grey), 5/8 Arbor. Provided by Voyager Tools. These tires are good for replacing hand truck wheels and tires, Special tread design provides added grip, we also sell tires in pairs for convenient rate! Product Description Durable and reliable! 10” flat free tire and wheel (colors: black, blue and grey), 5/8 Arbor. Provided by Voyager Tools. These tires are good for replacing hand truck wheels and tires, Special tread design provides added grip, we also sell tires in pairs for convenient rate!"
    },
    {
      "docid": 1043067,
      "title": "JIUWU 4 x Off-Road Wheels 12MM Hex Tires Crossing Tyre for RC 1:10 Cars (Black & red)",
      "text": "Product Description Suitable for RC 1/10 Off-road car, Truck,Monster Truck. Tires, rims without adhesive, You can be split Material: Plastic + Rubber Width: 26mm/1.02\"; Wheel Drive Hex:12 mm/0.47\" Outer Diameter: 52mm/2.05\"; Inner Diameter: 45mm/1.77\" Suitable for 1/10 on road RC cars and drift RC cars Product Description Suitable for RC 1/10 Off-road car, Truck,Monster Truck. Tires, rims without adhesive, You can be split Material: Plastic + Rubber Width: 26mm/1.02\"; Wheel Drive Hex:12 mm/0.47\" Outer Diameter: 52mm/2.05\"; Inner Diameter: 45mm/1.77\" Suitable for 1/10 on road RC cars and drift RC cars"
    },
    {
      "docid": 621443,
      "title": "WESTLAKE SA07 all_ Season Radial Tire-225/45ZR18 95W",
      "text": "Product Description Rim Width Range 7.5-7.5 The approved wheel rim width range this tire will support. Measured Rim Width 7.5 The recommended wheel width as recommended by the tire manufacturer to get the best wear us performance for this tire. Section Width 8.9 The measurement from sidewall to sidewall. Product Description Rim Width Range 7.5-7.5 The approved wheel rim width range this tire will support. Measured Rim Width 7.5 The recommended wheel width as recommended by the tire manufacturer to get the best wear us performance for this tire. Section Width 8.9 The measurement from sidewall to sidewall."
    },
    {
      "docid": 861848,
      "title": "Carlisle Trac Chief Industrial Tire -10-16.5",
      "text": "Product Description Brand: Carlisle Style: Trac Chief XT Size: 10-16. 5 Load Range: D Ply Rating: 8 Ply Sidewall: Black Sidewall. Product Description Brand: Carlisle Style: Trac Chief XT Size: 10-16. 5 Load Range: D Ply Rating: 8 Ply Sidewall: Black Sidewall."
    },
    {
      "docid": 512554,
      "title": "EBIKELING Waterproof Ebike Conversion Kit for Electric Bike 26\" Rear Wheel Electric Bicycle Hub Motor Kit with Mountain Bike Rim1500W 1200W 750W 500W Electric Bike Conversion Kit",
      "text": "From the brand Previous page Ebike Conversion Kits Visit the Store Conversion Kits with Battery Visit the Store Memory Foam Bike Seats Visit the Store Torque Arms Visit the Store Other Accessories Visit the Store Next page Product Description YOU CAN CONVERT ALMOST ANY BIKE INTO AN ELECTRIC BIKE Affordable and powerful kit options, the comfort of the smooth installation process are only a few good things to start explaining what we're offering here at Ebikeling. We are offering a variety of power options that suits your lifestyle. A commute, a day at the beach, or a late-night hangout with your buddies, you will enjoy the ride and make great memories on the way with Ebikeling. Choose your bicycle tire size, easily convert your bike and enjoy your ride! SPECIFICATIONS Recommended tire width 1.95\", 2.125\", 2.3\", 3\" Rim Width 39mm Rim Diameter (Outer) 572.5mm Rim Diameter (Inner) 517.5mm Spoke 159mm 12G Carbon Steel Copper Nipples Rear dropout 132mm Rear Axle Length 207mm Kit Weight 23lbs Motor Torque 30 Nm Efficiency > 82% Motor RPM (Nominal) 430 Motor Hub Diameter 242mm Motor Magnets 46 Peak Power 1.45kW Operating Mode Hall Sensor ENJOY THE COMFORT OF YOUR NEXT JOURNEY IN EVERY WEATHER CONDITION! The waterproof ebike conversion kits are more reliable than regular ebike conversion kits in difficult weather conditions. They are designed to take a ride in the rain or snow. Did you know we sell ebike conversion kits with batteries? Ebike Conversion Kit with 48V 12.8Ah Dolphin Battery Ebike Conversion Kit with 48V 14Ah Tiger Shark Battery Ebike Conversion Kit with 52V 16Ah Shark Battery Read more FEEL THE POWER! Still think you would struggle to ride in difficult conditions? Let us make your ride much easier. Oh did you say hills? Peh! Everybody loves to ride a bike down the hill, but have you ever enjoy the comfort of riding an uphill without a hustle? At eBikeling, we're offering you a nonstop adventure experience. The aluminum double-walled rim and hub motor are already attached in the box. Kits are ready to install right out of the box, all you need to do is replace them with the original tire. T he wheel axle diameter is 10 mm. Steel forks can be filed If the axle does not fit into the dropout because of its slightly larger diameter. Please do not file more than necessary and make sure that it does not damage the forks. Aluminum forks can also be filed with extra caution. Aluminum rims have openings for a Schrader-type valve. The kit doesn't have a regen brake option. The controller comes with an SY60 male-type battery connector (Compatible with XT60 connectors). PAS/Brake Levers are optional. Kits will operate without them. You will be able to use your own brakes. WE ARE HERE TO BUILD YOUR WHOLE BIKE Phone Holder Bag Secure and reliable method to access your phone and a storage for your accessories. Saddle Bag Durable, compact, and waterproof bag strapped under the seat to carry essential items at all times. Bike Pannier Bag Double sided large capacity storage for your oversized items with reflective corners for your safety. Front Headlight Extremely bright and fully waterproof 400 Lumens LED headlight will enlighten your night riding experience Read more "
    },
    {
      "docid": 113919,
      "title": "Mayflower Products 1.5 HP Automatic Tire Changer Wheel Balancer Combo 980 800 with 300 Assist Arm",
      "text": "Product Description Welcome to check our store for more items! : - 1 Year FULL ! When you choose us, you will get the BEST on Product Description: 980 Automatic Tire Changer with 300 Assist Arm Features: - Professional Assist Arm making machine easy to use with run flat tires - Rim clamping outside 13''-24'' - Rim clamping inside 15''-28'' - Motor Horsepower 1.5 HP Strong Motor - The bird head is designed with protector and claws are - Maximum Tire Diameter 49'' (1250mm) - Maximum wheel Width 13'' - Bead Break force 5600 lbs. pnuematic piston - Includes bead blast air blast - Operating pressure 120-145 psi (8-10 bar) - Quick Inflation (Bead Blaster) and Air reserve tank - Voltage 110V only - Includes 4 clamp protectors and Steel mount head(shown in picture) - 845 lbs. Shipping Weight - Red Powder Coat Finish 800 Electronic Wheel Balancer Features: - Rim diameter: 10'' - 24'' - Rim width: 1.5'' - 20'' - Max. wheel diameter: 44''(1117mm) - Max. wheel weight: 155 lbs - Pre set to American standard measurements - cycle time: 6-9 seconds - Balancing accuracy: -1g to +1g - Noise: <70 dB - Power supply: 110V - Max. Power: 180-250W - Standard Dynamic Mode, Static Mode, ALU 1-3 Mode, Motorcycle Mode - includes 3 centering cones - includes Quick Release Wing Nut - includes all accessories shown in the pictures - Red Powder Coat Finish Product Description Welcome to check our store for more items! : - 1 Year FULL ! When you choose us, you will get the BEST on Product Description: 980 Automatic Tire Changer with 300 Assist Arm Features: - Professional Assist Arm making machine easy to use with run flat tires - Rim clamping outside 13''-24'' - Rim clamping inside 15''-28'' - Motor Horsepower 1.5 HP Strong Motor - The bird head is designed with protector and claws are - Maximum Tire Diameter 49'' (1250mm) - Maximum wheel Width 13'' - Bead Break force 5600 lbs. pnuematic piston - Includes bead blast air blast - Operating pressure 120-145 psi (8-10 bar) - Quick Inflation (Bead Blaster) and Air reserve tank - Voltage 110V only - Includes 4 clamp protectors and Steel mount head(shown in picture) - 845 lbs. Shipping Weight - Red Powder Coat Finish 800 Electronic Wheel Balancer Features: - Rim diameter: 10'' - 24'' - Rim width: 1.5'' - 20'' - Max. wheel diameter: 44''(1117mm) - Max. wheel weight: 155 lbs - Pre set to American standard measurements - cycle time: 6-9 seconds - Balancing accuracy: -1g to +1g - Noise: <70 dB - Power supply: 110V - Max. Power: 180-250W - Standard Dynamic Mode, Static Mode, ALU 1-3 Mode, Motorcycle Mode - includes 3 centering cones - includes Quick Release Wing Nut - includes all accessories shown in the pictures - Red Powder Coat Finish"
    },
    {
      "docid": 1010447,
      "title": "Chemical Guys CLD_997_16 Diablo Wheel Gel Concentrated Wheel Cleaner (Safe on All Wheel & Rim Finishes), 16 oz.",
      "text": "Product Description Diablo Gel pH neutral wheel cleaner is safe enough to use on any and all OEM, after market wheels, painted and powder coated wheels, chrome, carbon fiber lips, decal wrapped wheels and lips and virtually all painted surfaces. Diablo Gel's suspension technology is oxygen rich infused. Concentrated suspension technology encapsulates dirt particles and rapidly lifts them away from the paint suspending them in a pH neutral slippery gelatin that easily rinses off wheels, leaving spot free results. The unique and unmatched gel consistency of Diablo enables it to stick to grime and brake dust filled wheels rapidly and efficiently loosening and lifting contaminants in suspension where they can be safely rinsed away from the surface, leaving wheels and tires spotless. Diablo Gel wheel and rim cleaner can be applied with a brush or sprayed on. Always dilute according to needs. For regular cleaning, dilute 1 part product to 6 parts water. For easy measurements in any bottle pour 1 inch Diablo and the rest of the bottle fill with water. For heavy duty cleaning Diablo can be left more concentrated 1:4 or 1:5. One 16 ounce bottle can make as many as 6 bottles of ready to use Diablo Gel. Safe for all wheels, non acid based, non caustic based, water based, extra slippery gel that safely cleans all wheels painted, clear coated, polished, chrome or anodized wheels. 100 percentage pH balanced and neutral so it's safe for delicate wheels. A single glance at Diablo wheel gel clearly shows how it holds the oxygen pockets inside of the products. Diablo wheel gel's unique extra slippery formulation lifts brake dust, dirt and contaminates away from any surface holding it in complete suspension so it can be safely rinsed off without staining any surface. Product Description Diablo Gel pH neutral wheel cleaner is safe enough to use on any and all OEM, after market wheels, painted and powder coated wheels, chrome, carbon fiber lips, decal wrapped wheels and lips and virtually all painted surfaces. Diablo Gel's suspension technology is oxygen rich infused. Concentrated suspension technology encapsulates dirt particles and rapidly lifts them away from the paint suspending them in a pH neutral slippery gelatin that easily rinses off wheels, leaving spot free results. The unique and unmatched gel consistency of Diablo enables it to stick to grime and brake dust filled wheels rapidly and efficiently loosening and lifting contaminants in suspension where they can be safely rinsed away from the surface, leaving wheels and tires spotless. Diablo Gel wheel and rim cleaner can be applied with a brush or sprayed on. Always dilute according to needs. For regular cleaning, dilute 1 part product to 6 parts water. For easy measurements in any bottle pour 1 inch Diablo and the rest of the bottle fill with water. For heavy duty cleaning Diablo can be left more concentrated 1:4 or 1:5. One 16 ounce bottle can make as many as 6 bottles of ready to use Diablo Gel. Safe for all wheels, non acid based, non caustic based, water based, extra slippery gel that safely cleans all wheels painted, clear coated, polished, chrome or anodized wheels. 100 percentage pH balanced and neutral so it's safe for delicate wheels. A single glance at Diablo wheel gel clearly shows how it holds the oxygen pockets inside of the products. Diablo wheel gel's unique extra slippery formulation lifts brake dust, dirt and contaminates away from any surface holding it in complete suspension so it can be safely rinsed off without staining any surface.From the manufacturer Safely clean any type of wheel with Diablo Wheel Gel! Previous page Easily removes dirt, brake dust, and more Diablo Gel Wheel and Rim Cleaner lifts away stuck-on brake dust and road grime with concentrated suspension technology. Oxygen infused deep cleaning power Oxygen-infused cleaners and slick lubricants guide filth off the wheel and into a foaming lather that will not scratch sensitive surfaces when scrubbing with a brush. High foaming deep cleaning action Diablo Wheel Gel produces tons of scrubbing bubbles to allow the deep penetrating formula to remove stubborn grime from the surface of the wheel. Safe for all types of wheel finishes Diablo Wheel Gel is gentle, non-caustic, and safe to use around any other car part in the vicinity of the wheel. Fast, easy, and fun to use! Diablo Wheel Gel is fast, fun, and easy to use! Don't know what type of wheel cleaner to use? Don't worry Diablo Wheel Gel cleans any type of wheel! Dilutable gel formula Diablo Wheel Gel can be diluted into a sprayer bottle to a 3:1 ratio or you can simply dilute it to your wheel bucket. Next page Diablo Wheel Gel is a pH balanced wheel and rim cleaner that uses gentle oxygen infused foam to safely clean any wheel finish. This non caustic formula is perfect for weekly maintenance washes! Clean Your Wheels With The Right Brushes Deep Clean Wheel Barrels Powerful Scrubbing Action Soft Touch On Wheels Clean Any Wheel Barrel Fast Red Rocket Brushes feature rubber tips and rubber-wrapped spines Reach Deep Into Pores Get rid of all that disgusting grime with the Big Blue Stiffy! Perfectly Flagged Tip Bristles It is tough enough to clean tough dirt and grime but gentle for rims and wheels. Gentle On Wheel Surfaces The soft bristles of the brush are sensitive enough for any painted wheel Scrub Away Dirt & Debris Big Blue Stiffy all combine to form the perfect tool to eliminate dirt and grime Avoid Scratches & Swirls It’s perfect for painted wheels, bare metal wheels, anodized wheels, and more! Previous page Thick fully-concentrated formula goes the distance Diablo Wheel Gel goes a long way! Chemical Guys Diablo Wheel Gel is fully concentrated and can be diluted to all you to clean many wheel with a single bottle! Easily and safely lifts brake dust and dirt Diablo Wheel Gel can clean and shine any type of wheels fast with the power of its oxygen-infused formula. Extreme lubrication on brushes Diablo Wheel Gel foams up amazingly which will cause extreme lubrication when using brushes. The high sudsing formula will prevent scratches on wheels. Efficiently loosens and lifts contaminants Brake dust can scratch or damage your wheels, but using the premium Diablo Wheel Gel it will efficiently help you remove brake dust and contaminates away from the surface safely. Ph balanced wheel cleaning formula Diablo Wheel Gel is a Ph-balanced cleaner which means it will not strip away waxes, sealants, or ceramic coatings. Next page Choosing The Right Dressing VRP Galactic Black Wet Look Nice & Wet Tire Dressing Water-Based Protectant Protect your interior and exterior vinyl, rubber, and plastic with one product! Oil-Based Dressing Restore heavily faded tires and trim to give your car a new look exterior! Aerosol Spray Shine Spray on instant shine and lasting protection to your tires and exterior trim! Fresh Crisp Finish Restore a crisp new shine with a dry-to-the-touch finish to tires, trim, & more! High-Gloss Appearance Enhance a high gloss shine to get your tires and trim looking like new again! Deep Wet Shine Achieve a deep wet shine to give your tires and trim a like new appearance! What types of wheels does Diablo Wheel Gel work on? Diablo Wheel Gel works amazing on all types of wheels. Can Diablo Wheel Gel be diluted? Yes, you may dilute it to a 3:1 ratio or you can add 1-2 ounces to your wheel buckets for best cleaning. Can Diablo Wheel Gel be used on tires and suspension? Yes, Diablo Wheel Gel also works amazing on tires and suspension pieces. I'm having issues with my Diablo Wheel Gel- who should I contact for help? Amazon's customer care can help with shipping issues, returns and replacements. If you are having technical issues with the product and need help using it or need replacement parts, contact the Chemical Guys Product Specialist Team Who We Are Join The Movement, Discover The Lifestyle, And Uncover The Culture Of Car Care Chemical Guys is more than a company, it’s a lifestyle. Join the movement and discover the culture of passion and dedication to all things car care that has garnered us a worldwide following. Learn to completely care for your vehicle and find the products you need to elevate your car from a lackluster ride to a statement that reveals your inner shine. Become a part of the Chemical Guys Family and uncover the true meaning of pride and passion! "
    },
    {
      "docid": 1564237,
      "title": "Chemical Guys CLD_997_16 Diablo Wheel Gel Concentrated Wheel Cleaner (Safe on All Wheel & Rim Finishes), 16 oz.",
      "text": "Product Description Diablo Gel pH neutral wheel cleaner is safe enough to use on any and all OEM, after market wheels, painted and powder coated wheels, chrome, carbon fiber lips, decal wrapped wheels and lips and virtually all painted surfaces. Diablo Gel's suspension technology is oxygen rich infused. Concentrated suspension technology encapsulates dirt particles and rapidly lifts them away from the paint suspending them in a pH neutral slippery gelatin that easily rinses off wheels, leaving spot free results. The unique and unmatched gel consistency of Diablo enables it to stick to grime and brake dust filled wheels rapidly and efficiently loosening and lifting contaminants in suspension where they can be safely rinsed away from the surface, leaving wheels and tires spotless. Diablo Gel wheel and rim cleaner can be applied with a brush or sprayed on. Always dilute according to needs. For regular cleaning, dilute 1 part product to 6 parts water. For easy measurements in any bottle pour 1 inch Diablo and the rest of the bottle fill with water. For heavy duty cleaning Diablo can be left more concentrated 1:4 or 1:5. One 16 ounce bottle can make as many as 6 bottles of ready to use Diablo Gel. Safe for all wheels, non acid based, non caustic based, water based, extra slippery gel that safely cleans all wheels painted, clear coated, polished, chrome or anodized wheels. 100 percentage pH balanced and neutral so it's safe for delicate wheels. A single glance at Diablo wheel gel clearly shows how it holds the oxygen pockets inside of the products. Diablo wheel gel's unique extra slippery formulation lifts brake dust, dirt and contaminates away from any surface holding it in complete suspension so it can be safely rinsed off without staining any surface. Product Description Diablo Gel pH neutral wheel cleaner is safe enough to use on any and all OEM, after market wheels, painted and powder coated wheels, chrome, carbon fiber lips, decal wrapped wheels and lips and virtually all painted surfaces. Diablo Gel's suspension technology is oxygen rich infused. Concentrated suspension technology encapsulates dirt particles and rapidly lifts them away from the paint suspending them in a pH neutral slippery gelatin that easily rinses off wheels, leaving spot free results. The unique and unmatched gel consistency of Diablo enables it to stick to grime and brake dust filled wheels rapidly and efficiently loosening and lifting contaminants in suspension where they can be safely rinsed away from the surface, leaving wheels and tires spotless. Diablo Gel wheel and rim cleaner can be applied with a brush or sprayed on. Always dilute according to needs. For regular cleaning, dilute 1 part product to 6 parts water. For easy measurements in any bottle pour 1 inch Diablo and the rest of the bottle fill with water. For heavy duty cleaning Diablo can be left more concentrated 1:4 or 1:5. One 16 ounce bottle can make as many as 6 bottles of ready to use Diablo Gel. Safe for all wheels, non acid based, non caustic based, water based, extra slippery gel that safely cleans all wheels painted, clear coated, polished, chrome or anodized wheels. 100 percentage pH balanced and neutral so it's safe for delicate wheels. A single glance at Diablo wheel gel clearly shows how it holds the oxygen pockets inside of the products. Diablo wheel gel's unique extra slippery formulation lifts brake dust, dirt and contaminates away from any surface holding it in complete suspension so it can be safely rinsed off without staining any surface.From the manufacturer Safely clean any type of wheel with Diablo Wheel Gel! Previous page Easily removes dirt, brake dust, and more Diablo Gel Wheel and Rim Cleaner lifts away stuck-on brake dust and road grime with concentrated suspension technology. Oxygen infused deep cleaning power Oxygen-infused cleaners and slick lubricants guide filth off the wheel and into a foaming lather that will not scratch sensitive surfaces when scrubbing with a brush. High foaming deep cleaning action Diablo Wheel Gel produces tons of scrubbing bubbles to allow the deep penetrating formula to remove stubborn grime from the surface of the wheel. Safe for all types of wheel finishes Diablo Wheel Gel is gentle, non-caustic, and safe to use around any other car part in the vicinity of the wheel. Fast, easy, and fun to use! Diablo Wheel Gel is fast, fun, and easy to use! Don't know what type of wheel cleaner to use? Don't worry Diablo Wheel Gel cleans any type of wheel! Dilutable gel formula Diablo Wheel Gel can be diluted into a sprayer bottle to a 3:1 ratio or you can simply dilute it to your wheel bucket. Next page Diablo Wheel Gel is a pH balanced wheel and rim cleaner that uses gentle oxygen infused foam to safely clean any wheel finish. This non caustic formula is perfect for weekly maintenance washes! Clean Your Wheels With The Right Brushes Deep Clean Wheel Barrels Powerful Scrubbing Action Soft Touch On Wheels Clean Any Wheel Barrel Fast Red Rocket Brushes feature rubber tips and rubber-wrapped spines Reach Deep Into Pores Get rid of all that disgusting grime with the Big Blue Stiffy! Perfectly Flagged Tip Bristles It is tough enough to clean tough dirt and grime but gentle for rims and wheels. Gentle On Wheel Surfaces The soft bristles of the brush are sensitive enough for any painted wheel Scrub Away Dirt & Debris Big Blue Stiffy all combine to form the perfect tool to eliminate dirt and grime Avoid Scratches & Swirls It’s perfect for painted wheels, bare metal wheels, anodized wheels, and more! Previous page Thick fully-concentrated formula goes the distance Diablo Wheel Gel goes a long way! Chemical Guys Diablo Wheel Gel is fully concentrated and can be diluted to all you to clean many wheel with a single bottle! Easily and safely lifts brake dust and dirt Diablo Wheel Gel can clean and shine any type of wheels fast with the power of its oxygen-infused formula. Extreme lubrication on brushes Diablo Wheel Gel foams up amazingly which will cause extreme lubrication when using brushes. The high sudsing formula will prevent scratches on wheels. Efficiently loosens and lifts contaminants Brake dust can scratch or damage your wheels, but using the premium Diablo Wheel Gel it will efficiently help you remove brake dust and contaminates away from the surface safely. Ph balanced wheel cleaning formula Diablo Wheel Gel is a Ph-balanced cleaner which means it will not strip away waxes, sealants, or ceramic coatings. Next page Choosing The Right Dressing VRP Galactic Black Wet Look Nice & Wet Tire Dressing Water-Based Protectant Protect your interior and exterior vinyl, rubber, and plastic with one product! Oil-Based Dressing Restore heavily faded tires and trim to give your car a new look exterior! Aerosol Spray Shine Spray on instant shine and lasting protection to your tires and exterior trim! Fresh Crisp Finish Restore a crisp new shine with a dry-to-the-touch finish to tires, trim, & more! High-Gloss Appearance Enhance a high gloss shine to get your tires and trim looking like new again! Deep Wet Shine Achieve a deep wet shine to give your tires and trim a like new appearance! What types of wheels does Diablo Wheel Gel work on? Diablo Wheel Gel works amazing on all types of wheels. Can Diablo Wheel Gel be diluted? Yes, you may dilute it to a 3:1 ratio or you can add 1-2 ounces to your wheel buckets for best cleaning. Can Diablo Wheel Gel be used on tires and suspension? Yes, Diablo Wheel Gel also works amazing on tires and suspension pieces. I'm having issues with my Diablo Wheel Gel- who should I contact for help? Amazon's customer care can help with shipping issues, returns and replacements. If you are having technical issues with the product and need help using it or need replacement parts, contact the Chemical Guys Product Specialist Team Who We Are Join The Movement, Discover The Lifestyle, And Uncover The Culture Of Car Care Chemical Guys is more than a company, it’s a lifestyle. Join the movement and discover the culture of passion and dedication to all things car care that has garnered us a worldwide following. Learn to completely care for your vehicle and find the products you need to elevate your car from a lackluster ride to a statement that reveals your inner shine. Become a part of the Chemical Guys Family and uncover the true meaning of pride and passion! "
    },
    {
      "docid": 1443603,
      "title": "MaxAuto 2 Pcs Lawn Mower Tires 15x6.00-6 with Wheel for Riding Mowers, 3\" Offset Hub Long with 3/4\" bearings, Pneumatic Tire",
      "text": "From the brand Previous page MaxAuto is a thriving brand which has been committed to meeting customer needs with high-quality tires. Our lineup include tires applied in Lawn & Garden, Agriculture, Golf Cart, ATV/UTV, ST Trailer, light truck, etc. We've obtained such certification as US DOT(2000),EU ECE(2006),Middle East SASO. The testing center has passed the CNAS(2017), German TÜV(2018), to ensure that all of our products are manufactured with the same quality standards. Zero Turn Mower Tire Wheel Kit Visit the Store Riding Mower Tire & Wheel Kit Visit the Store Riding Mower Tire & Wheel Kit Visit the Store Riding Mower Tire & Wheel Kit Visit the Store Next page Product Description About MaxAuto Brand >>Focus on high-quality speciality tire manufacturer In 1997, we began to invest in the development and production of ATV tires. Since then, we continue to expand our technical capabilities, production capacity and research and development. With a comprehensive range of applications and broad product line, and an annual output of 80 million sets, we highlight our industry leadership in the speciality tire and continue to maintain our innovation and creativity. >>Our Advantage We offer the best quality - worldwide. All major production technology and machines own designs; we have established production bases around the world. America, Australia, New Zealand and Asia This is how we ensure that all our products the same quality standards worldwide. How to Read a Tire? Tire & Wheel Specifications: Size:Tire 15X6-6 Wheels 6X4.50 Tire & Wheels Assembly Ply Rating:6PR TT/TL:TL Max Load(Lbs):595 PSI:45 Load/Speed Index:9A3 Tread Depth (mm):4.5 Rim Width (in):4.5 Section Width(mm):160 OD(mm):385 Wheel: 6x4.5 Wheel with bearings Color: John Deere Yellow 15X6.00-6 P332 15X6.00-6 P512 15X6.00-6 Fox 15X6.00-6 Wheels Ply Rating 4PR 4PR 4PR 6PR Tread Depth(mm) 6mm 4.5mm 4.5mm Max Load(Lbs) 570lbs 570lbs 570lbs 595lbs PSI 30 30 30 45 Why Choose Our Tire & Wheel Assembly? The role of unique pattern design Increase the tire and the ground friction; Reduce tire noise to enhance comfort; For the tire cooling, drainage; Improve vehicle handling performance; The advantages of our service 1.Our factory has the professional R&D team and strong production capacity. 2.Seller fulfilled Prime. The advantages of our brand tires 1.Our tires adopt a special rubber formula, wear resistance, anti-aging and heat resistance than other brands of tires 2.Unique pattern design "
    },
    {
      "docid": 1368863,
      "title": "MaxAuto Set of 4 Lawn Mower Turf Tires 15x6-6 Front & 20x10-8 Rear,4PR,Tubeless",
      "text": "From the brand Previous page MaxAuto is a thriving brand which has been committed to meeting customers’ needs with its vast array of high-quality tires in the specialty market. Our lineup has been expanded to include the tires applied in Lawn & Garden, Agriculture, Golf Cart, ATV/UTV, ST Trailer, etc. Our Tires are compatible with your John Deere, Cub Cadet, Husqvarna, Kubota, Arctic Cat, Can-Am, Honda, Kawasaki, Polaris, Suzuki off-road vehicle and many more models. Lawn & Garden Tire Visit the Store Lawn & Garden Tire Visit the Store Lawn & Garden Tire Visit the Store Lawn & Garden Tire Visit the Store Lawn & Garden Tire Visit the Store Next page Product Description About MaxAuto Brand >>Focus on high-quality speciality tire manufacturer In 1997, we began to invest in the development and production of ATV tires. Since then, we continue to expand our technical capabilities, production capacity and research and development. With a comprehensive range of applications and broad product line, and an annual output of 80 million sets, we highlight our industry leadership in the speciality tire and continue to maintain our innovation and creativity. >>Our Advantage We offer the best quality - worldwide. All major production technology and machines own designs; we have established production bases around the world. America, Australia, New Zealand and Asia This is how we ensure that all our products the same quality standards worldwide. How to Read a Tire? Front Tire Specifications: Size: 15X6.00-6 Pattern: P332 TT/TL: TL Tire Type: Lawn & Garden Tire Speed Rating: A3 Tire Load Range: B Section Width(mm):160 Rim Width(in): 4.5 Overall Diameter(mm):367 Tread Depth(mm):6 Max PSI:30 Load Index(lbs):570 Rear Tire Specifications: Size: 20x10.00-8 Section Width(mm):250 Rim Width(in):8 Overall Diameter(mm):500 Tread Depth(mm):7.1 Max PSI:22 Load Index(lbs):1190 Read more When to Replace? How to maintain your tires? Regular test of fetal pressure. Regularly check the wear of tires. Remove the small stones and other foreign objects in the tires. Rotation of tires on time. Timing four round positioning. Timely repair. Why Choose Our Tire? The role of unique pattern design Increase the tire and the ground friction; Reduce tire noise to enhance comfort; For the tire cooling, drainage; Improve vehicle handling performance; The advantages of our service 1.Our factory has the professional R&D team and strong production capacity. 2.Seller fulfilled Prime. The advantages of our brand tires 1.Our tires adopt a special rubber formula, wear resistance, anti-aging and heat resistance than other brands of tires 2.Unique pattern design "
    },
    {
      "docid": 454314,
      "title": "MASSFX Wheel & Tire Golf Cart Tire 18x8.5-8 with White MASSFX 8x7 4/4 Rim 2 PACK",
      "text": "Product Description Read more Alternating Low Profile Soft Tread With a low profile, soft, compact tread designed specifically for turf and the lushest of greens. The condensed compact tread gives a much wider and expansive surface area ensuring minimal lawn damage when turning. 4- PLY BIAs Rating With a 4 - Ply Bias rating you get the best of both worlds. Composed of 4 separate layers of reinforced, high-grade rubber, the MASSFX SL Golf Cart Series is durable, yet not as rigid as our other tires to ensure less tearing on grass and turf. Designed for the Lushest Greens and Fairways Low profile, soft, compact tread is a core feature and design element of our Golf Cart series. A wide surface area and no aggressive lugs ensure minimal to no damage to grass when turning or accelerating. Read more AVAILABLE SIZES Tire Height-Tire Width-Rim Size 18 x 8.5 -8 LOW PROFILE / NO GRASS DAMAGE Nothing is worse than seeing a torn up green or runway on a pristine golf course. The low, compact tread design was designed just for that. With a load rating of 851 lbs @ 22 PSI is noteworthy as well. Maximum fun, with minimal damage so you can focus on getting that hole in one. MASSFX - 18\" Golf Cart Above PAR than other guys. Paired best with your favorite 9-Iron the 18\" Gold Cart Tire from MASSFX is an affordable cost-efficient replacement for your current golf cart tires. Wide surface area and a low tread depth give high grip and traction without destroying the local gold course greens. WHAT DOES 4 - PLY BIAS RATING MEAN? 4 - represents the overall strength rating of the tire based upon the composition of the tire PLY - is used to represent the relative strength of the tire overall. BIAS - refers to the tires classification. Read more MASSFX GOLF 18\" - BLACK MASSFX GOLF 18\" - WHITE MASSFX GOLF 20\" MASSFX GOLF 22\" MASSFX GOLF 205mm Vehicle Type: Golf Cart Golf Cart Golf Cart Golf Cart Golf Cart PLY: 4 PLY 4 PLY 4 PLY 4 PLY 4 PLY Size: 18x8.5-8 18x8.5-8 20x10-10 22x11-10 205x50-10 Construction: BIAS BIAS BIAS BIAS BIAS Pre-Mounted ✓ ✓ Mountable: ✓ ✓ ✓ "
    },
    {
      "docid": 869331,
      "title": "Carlisle Trac Chief Industrial Tire -23/8.50-14",
      "text": "Product Description Carlisle Trac Chief Industrial Tire -23/8.50-14 Product Description Carlisle Trac Chief Industrial Tire -23/8.50-14"
    },
    {
      "docid": 346308,
      "title": "TAC 9 Bicycle Inner Tube, 26 x 1.95-2.125, Regular Schrader Valve 32mm - Bundle Options Available w/Rim Strips and Tire Levers",
      "text": "Product Description 26\" x 1.95-2.125\" Bicycle Inner Tube with 32mm Regular Schrader Valve. Select the bundle option you require. You must select the correct bundle if you're needing the rim strips and/or tire levers with your replacement inner tubes. This listing is to assist you in a one-stop-shop when you need more than just the inner tube. TAC-9 Bicycle Inner Tubes are manufactured with high quality butyl rubber. Our tubes are specifically engineered with a reinforced valve stem to prevent tearing or breaking. Each tube is quality control inspected at the factory. Product Description 26\" x 1.95-2.125\" Bicycle Inner Tube with 32mm Regular Schrader Valve. Select the bundle option you require. You must select the correct bundle if you're needing the rim strips and/or tire levers with your replacement inner tubes. This listing is to assist you in a one-stop-shop when you need more than just the inner tube. TAC-9 Bicycle Inner Tubes are manufactured with high quality butyl rubber. Our tubes are specifically engineered with a reinforced valve stem to prevent tearing or breaking. Each tube is quality control inspected at the factory."
    },
    {
      "docid": 1207982,
      "title": "Kenda Bear Claw EX 25x11-10 Rear ATV 6 PLY Tires Bearclaw 25x11x10 - 2 Pack",
      "text": "Product Description Read more Read more AVAILABLE SIZES TIre Height-Tire Width-Rim Size 21x7-10 // 22x11-10 22x7-10 // 22x8-10 23x8-10 // 22x8-11 23x10-10 // 24x8-11 24x10-11 // 24x11-10 25x8-12 // 25x11-10 25x10-12 // 26x10-12 26x12-12 KENDA BEARCLAW EX Putting the EX in EX-treme. One of, if not the most popular, treads under the Kenda Bearclaw style. The EX's aggressive S Tread is central to its viability in mixed terrain and overall toughness. With a 6Ply rating and tread lugs that extend over to the sidewall the risk of sidewall puncture is minimized when riding. Our Kenda Rim Saver Feature also protects against rocks and rut damage. WHAT DOES 6 - PLY BIAS RATING MEAN? 6 - represents the overall strength rating of the tire based upon the composition of the tire PLY - is used to represent the relative strength of the tire overall. BIAS - refers to the tires classification. Read more Read more Read more "
    },
    {
      "docid": 1115051,
      "title": "4PCS Short Course RC Truck Tires & Wheels - Miuezuth Ultra Soft 110mm 1/10 Tire for Traxxas HSP Tamiya HPI Kyosho RC Model Car Off-Road Truck Crawler Racing RC Car Model",
      "text": "Product Description Features Color: Black Wheel rim material: ABS Material: rubber tyre Quantity: 4 pcs Item weight:110g/piece Fit on Traxxas, Tamiya plasma eedge 2 and other 1:10 short course rc truck. Specifications: Wheel rim diameter: 81mm Wheel rim drive hex: 12mm Nut fixed hole: 4mm Tyre material: Rubber Tyre diameter: 108mm Tyre width: 53mm Package information: Package size:23* 23 * 6 cm Package weight: 458g Packing List: 4 X RC Short Course Tires. Customer Service 3 Years Warranty Time and Life Limited Friendly Customer Service. Note: there's some little error from human measuring. More options for you: 1.9\" 110mm Crawler Tires: B07PLLKHCT 2.2\" 130mm Rubber Tires: B07PHFX8BH 1.9\" 120mm Crawler Tires: B07PLJCD1W Product Description Features Color: Black Wheel rim material: ABS Material: rubber tyre Quantity: 4 pcs Item weight:110g/piece Fit on Traxxas, Tamiya plasma eedge 2 and other 1:10 short course rc truck. Specifications: Wheel rim diameter: 81mm Wheel rim drive hex: 12mm Nut fixed hole: 4mm Tyre material: Rubber Tyre diameter: 108mm Tyre width: 53mm Package information: Package size:23* 23 * 6 cm Package weight: 458g Packing List: 4 X RC Short Course Tires. Customer Service 3 Years Warranty Time and Life Limited Friendly Customer Service. Note: there's some little error from human measuring. More options for you: 1.9\" 110mm Crawler Tires: B07PLLKHCT 2.2\" 130mm Rubber Tires: B07PHFX8BH 1.9\" 120mm Crawler Tires: B07PLJCD1W"
    },
    {
      "docid": 650870,
      "title": "Mayflower - 1.5 HP Tire Changer Wheel Changers Machine Balancer Rim Clamp Combo 560 680/1 Year Full Warranty",
      "text": "Product Description Welcome to check our store for more items! Warranty: - 1 Year FULL warranty! When you choose us, you will get the BEST warranty on Amazon Product Description: 560 Semi Automatic Tire Changer Features: - Rim clamping outside 10\"-18\" - Rim clamping inside 12\"-21\" - Motor Horsepower 1.5 HP Strong Motor - The bird head is designed with protector and claws are lifetime warranty - Maximum Tire Diameter 35\" (900mm) - Maximum wheel Width 12\" - Bead Break force 5600 lbs. pneumatic piston - Operating pressure 120-145 psi (8-10 bar) - Voltage 110V only - Includes 4 clamp protectors and Steel mount head(shown in picture) - 500 lbs. Shipping Weight - Blue Powder Coat Finish 680 Electronic Wheel Balancer Features: - Rim diameter: 10\" - 24\" - Rim width: 1.5\" - 20\" - Max. wheel diameter: 44\"(1117mm) - Max. wheel weight: 155 lbs - Pre set to American standard measurements - cycle time: 6-9 seconds - Balancing accuracy: -1g to +1g - Noise: <70 dB - Power supply: 110V - Max. Power: 180-250W - Standard Dynamic Mode, Static Mode, ALU 1-3 Mode, Motorcycle Mode - includes 3 centering cones - includes Quick Release Wing Nut - includes all accessories shown in the pictures - Blue Powder Coat Finish Product Description Welcome to check our store for more items! Warranty: - 1 Year FULL warranty! When you choose us, you will get the BEST warranty on Amazon Product Description: 560 Semi Automatic Tire Changer Features: - Rim clamping outside 10\"-18\" - Rim clamping inside 12\"-21\" - Motor Horsepower 1.5 HP Strong Motor - The bird head is designed with protector and claws are lifetime warranty - Maximum Tire Diameter 35\" (900mm) - Maximum wheel Width 12\" - Bead Break force 5600 lbs. pneumatic piston - Operating pressure 120-145 psi (8-10 bar) - Voltage 110V only - Includes 4 clamp protectors and Steel mount head(shown in picture) - 500 lbs. Shipping Weight - Blue Powder Coat Finish 680 Electronic Wheel Balancer Features: - Rim diameter: 10\" - 24\" - Rim width: 1.5\" - 20\" - Max. wheel diameter: 44\"(1117mm) - Max. wheel weight: 155 lbs - Pre set to American standard measurements - cycle time: 6-9 seconds - Balancing accuracy: -1g to +1g - Noise: <70 dB - Power supply: 110V - Max. Power: 180-250W - Standard Dynamic Mode, Static Mode, ALU 1-3 Mode, Motorcycle Mode - includes 3 centering cones - includes Quick Release Wing Nut - includes all accessories shown in the pictures - Blue Powder Coat Finish"
    },
    {
      "docid": 531151,
      "title": "Kenda Bear Claw EX 22x11-10 Rear ATV 6 PLY Tires Bearclaw 22x11x10 - 2 Pack",
      "text": "Product Description Read more Read more AVAILABLE SIZES TIre Height-Tire Width-Rim Size 21x7-10 // 22x11-10 22x7-10 // 22x8-10 23x8-10 // 22x8-11 23x10-10 // 24x8-11 24x10-11 // 24x11-10 25x8-12 // 25x11-10 25x10-12 // 26x10-12 26x12-12 KENDA BEARCLAW EX Putting the EX in EX-treme. One of, if not the most popular, treads under the Kenda Bearclaw style. The EX's aggressive S Tread is central to its viability in mixed terrain and overall toughness. With a 6Ply rating and tread lugs that extend over to the sidewall the risk of sidewall puncture is minimized when riding. Our Kenda Rim Saver Feature also protects against rocks and rut damage. WHAT DOES 6 - PLY BIAS RATING MEAN? 6 - represents the overall strength rating of the tire based upon the composition of the tire PLY - is used to represent the relative strength of the tire overall. BIAS - refers to the tires classification. Read more Read more Read more "
    },
    {
      "docid": 1299163,
      "title": "Mayflower - 1.5 HP Automatic Tire Changer Wheel Changers Machine Rim Balancer Combo 960 680 Bead Blaster / 1 Year Full Warranty",
      "text": "Product Description Welcome to check our store for more items! Warranty: - 1 Year FULL warranty! When you choose us, you will get the BEST warranty on Amazon Product Description: 960 Automatic Tire Changer Features: - Professional Assist Arm making machine easy to use with run flat tires - Rim clamping outside 10\"-20\" - Rim clamping inside 12\"-24\" - Motor Horsepower 1.5 HP Strong Motor - The bird head is designed with protector and claws are lifetime warranty - Maximum Tire Diameter 37\" (960mm) - Maximum wheel Width 12\" - Bead Break force 5600 lbs. pnuematic piston - Includes bead blast air blast - Operating pressure 120-145 psi (8-10 bar) - Quick Inflation (Bead Blaster) and Air reserve tank - Voltage 110V only - Includes 4 clamp protectors and Steel mount head(shown in picture) - 880 lbs. Shipping Weight - 960 tire changer is combined by 950 tire changer and 300 assist arm - Blue Powder Coat Finish 680 Electronic Wheel Balancer Features: - Rim diameter: 10\" - 24\" - Rim width: 1.5\" - 20\" - Max. wheel diameter: 44\"(1117mm) - Max. wheel weight: 155 lbs - Pre set to American standard measurements - cycle time: 6-9 seconds - Balancing accuracy: -1g to +1g - Noise: <70 dB - Power supply: 110V - Max. Power: 180-250W - Standard Dynamic Mode, Static Mode, ALU 1-3 Mode, Motorcycle Mode - includes 3 centering cones - includes Quick Release Wing Nut - includes all accessories shown in the pictures - Blue Powder Coat Finish Product Description Welcome to check our store for more items! Warranty: - 1 Year FULL warranty! When you choose us, you will get the BEST warranty on Amazon Product Description: 960 Automatic Tire Changer Features: - Professional Assist Arm making machine easy to use with run flat tires - Rim clamping outside 10\"-20\" - Rim clamping inside 12\"-24\" - Motor Horsepower 1.5 HP Strong Motor - The bird head is designed with protector and claws are lifetime warranty - Maximum Tire Diameter 37\" (960mm) - Maximum wheel Width 12\" - Bead Break force 5600 lbs. pnuematic piston - Includes bead blast air blast - Operating pressure 120-145 psi (8-10 bar) - Quick Inflation (Bead Blaster) and Air reserve tank - Voltage 110V only - Includes 4 clamp protectors and Steel mount head(shown in picture) - 880 lbs. Shipping Weight - 960 tire changer is combined by 950 tire changer and 300 assist arm - Blue Powder Coat Finish 680 Electronic Wheel Balancer Features: - Rim diameter: 10\" - 24\" - Rim width: 1.5\" - 20\" - Max. wheel diameter: 44\"(1117mm) - Max. wheel weight: 155 lbs - Pre set to American standard measurements - cycle time: 6-9 seconds - Balancing accuracy: -1g to +1g - Noise: <70 dB - Power supply: 110V - Max. Power: 180-250W - Standard Dynamic Mode, Static Mode, ALU 1-3 Mode, Motorcycle Mode - includes 3 centering cones - includes Quick Release Wing Nut - includes all accessories shown in the pictures - Blue Powder Coat Finish"
    },
    {
      "docid": 1587531,
      "title": "Carlisle Trac Chief Industrial Tire -27/10.50-15",
      "text": "Product Description Carlisle Trac Chief Industrial Tire -27/10.50-15 Product Description Carlisle Trac Chief Industrial Tire -27/10.50-15"
    },
    {
      "docid": 1203772,
      "title": "Carlisle Trac Chief Bias Tire - 27x8.50-15",
      "text": "Product Description Carlisle Trac Chief Bias Tire - 27x8.50-15 Product Description Carlisle Trac Chief Bias Tire - 27x8.50-15"
    },
    {
      "docid": 197814,
      "title": "BLIAUTO Spare Tire Brake Light Jeep Wheel 3rd Third Brake Light Compatible with Jeep Wrangler 2007–2017 JK JKU,2018-2021 JL JLU LED Rear 16 to 20 inch Wheel Lights Third Tail Lamp Red Light",
      "text": "From the brand BLIAUTO LIGHTING Previous page BLIAUTO is a auto parts supplier integrating production, processing,sales. As a professional manufacturer of automotive products. To provides The high-quality products and service with reasonable prices to worldwide. To provide customers with more valuable products is our ultimate goal! To generate greater value for customers is our ultimate service goal. BLIAUTO Rock Lights White Kit Visit the Store Motorcycle Headlight&Fog Light Visit the Store R1 LED Rock Lights White Visit the Store R2 LED Rock Lights White Visit the Store 4x6 LED Headlights Visit the Store 5X7 7x6 LED Headlights Visit the Store R3 White LED Rock Lights Visit the Store LED Lights for Car In/Exterior Visit the Store Underglow 4x6 LED Headlights for Truck Next page Product Description Spare Tire Brake Light Specifications LED Quantity 85PCS LED Color Red Product Diameter 13.8inch Material ABS Plastic Frame Waterproof IP67 Operating Voltage 12V DC Lifespan Over 50,000 Hours Dimension 350mm(13.77in) x 23mm(0.9in) Read more Jeep Lights For Tire Super Bright Consist of 85 pieces high quality LEDs,Lights Up The Inside of Your Spare When Step On The Brake,output high bright red light for obvious and Fast Braking Durable Material Made of ABS plastic material, super durable, and high sealed for waterproof. Easy Installation Just remove the spare tire, connect the positive wire and negative wire of the brake light to the third brake light or tail light wire, and then install the spare tire back. Read more Read more Wide Application Compatible with 2007-2017 Jeep Wrangler JK JKU TJL Compatible with 2018-2021 Jeep Wrangler JLU JL With all 16 to 20 Inch Rim Diameter Wheels With 5x5, 5x4.5, 5x5.5 inch Lug Patterns. LED Rock Lights White 20PCS LED Rock Lights White 12PCS Car Underglow Lights 90X120cm Car Underglow Lights with APP Car Led Strip Lights 48LED Car Led Strip Lights 72LED Instalation Design Independent Independent All-In-One Outlet Parallel Double Outlet All-In-One Outlet All-In-One Outlet Length 2.75” 2.75” 2 x 36.6\"+ 2 x 48.4\" 2 x 24\"+ 2 x 35\" 4x0.72ft Strips 4x0.98ft Strips Color White White RGB RGB DIY Colors +16 Million Colors RGB RGB Control Method Not Not RF Remote APP/RF Remote IR Remote IR Remote "
    },
    {
      "docid": 1577747,
      "title": "Feedback Sports RAKK Bicycle Storage Stand",
      "text": "Product Description Product Description Because you love your bicycles, when you’re not riding them you want to protect them and you need a simple, non-permanent and effective bike parking solution. The often imitated, but never duplicated RAKK is a patented, versatile bike storage idea for front or rear wheel parking. Making contact with only your tire, the RAKK is an ideal bike parking solution for expensive road, cyclocross, mountain and electric bikes. And if you have several bikes, its modular design supports add-ons. Amazon.com The rack holds 20-millimeter road tires and up to 2.4-inch wide mountain bike tires between 20- and 29-inch wheel size. The Feedback Sports RAKK bicycle display rack is equally at home displaying new models in a retail location, and supporting your own bikes at home in the garage. For optimal versatility, the wheel slot quickly and easily accommodates all types of bikes from 20-millimeter road tires to 2.4-inch wide mountain bike tires. A spring-loaded arm easily holds either front or rear wheels without the risk of scratching the rim or spokes, and a hands-free design allows you to roll bike into the wheel slot for storage or display. A clever modular design supports multiple RAKKs connected together. Specifications Holds 20-millimeter road tires and up to 2.4-inch wide mountain bike tires between 20- and 29-inch wheel size Base footprint measures 13.5 by 16 inches (W x D) 3.2-inch folded height 5.9-pound weight Optional spacing of 12, 13.5, and 15 inches between stands A spring-loaded arm easily holds your front or rear wheel without scratching the rim or spokes. Warranty This Feedback Sports product includes a limited one-year warranty against defects in materials and workmanship. About Feedback Sports Based in Golden, Colorado, Feedback Sports was started by cyclist and racer Doug Hudson in 2004, when he developed the Alpine Digital Scale to weigh bicycles. Early on, the scales were successfully distributed through another Colorado company named Ultimate Bike Support, which Feedback Sports acquired in 2008 to add bicycle work stands and storage stands to the Feedback product mix. The company has since refined and continually improved its award-winning designs while also introducing new bicycle accessories. Product Description Product Description Because you love your bicycles, when you’re not riding them you want to protect them and you need a simple, non-permanent and effective bike parking solution. The often imitated, but never duplicated RAKK is a patented, versatile bike storage idea for front or rear wheel parking. Making contact with only your tire, the RAKK is an ideal bike parking solution for expensive road, cyclocross, mountain and electric bikes. And if you have several bikes, its modular design supports add-ons. Amazon.com The rack holds 20-millimeter road tires and up to 2.4-inch wide mountain bike tires between 20- and 29-inch wheel size. The Feedback Sports RAKK bicycle display rack is equally at home displaying new models in a retail location, and supporting your own bikes at home in the garage. For optimal versatility, the wheel slot quickly and easily accommodates all types of bikes from 20-millimeter road tires to 2.4-inch wide mountain bike tires. A spring-loaded arm easily holds either front or rear wheels without the risk of scratching the rim or spokes, and a hands-free design allows you to roll bike into the wheel slot for storage or display. A clever modular design supports multiple RAKKs connected together. Specifications Holds 20-millimeter road tires and up to 2.4-inch wide mountain bike tires between 20- and 29-inch wheel size Base footprint measures 13.5 by 16 inches (W x D) 3.2-inch folded height 5.9-pound weight Optional spacing of 12, 13.5, and 15 inches between stands A spring-loaded arm easily holds your front or rear wheel without scratching the rim or spokes. Warranty This Feedback Sports product includes a limited one-year warranty against defects in materials and workmanship. About Feedback Sports Based in Golden, Colorado, Feedback Sports was started by cyclist and racer Doug Hudson in 2004, when he developed the Alpine Digital Scale to weigh bicycles. Early on, the scales were successfully distributed through another Colorado company named Ultimate Bike Support, which Feedback Sports acquired in 2008 to add bicycle work stands and storage stands to the Feedback product mix. The company has since refined and continually improved its award-winning designs while also introducing new bicycle accessories.From the manufacturer Rakk Design Safe Contact Points The Rakk touches only the tire of your bike, leaving expensive components free from contact. This prevents scratches on your rims and frame. Front or Rear Wheel Entry The Rakk bike storage rack is designed so you can park your bike with the front or rear wheel depending on your needs! Modular Design The Rakk can be combined with an included bracket to provide plenty of parking and perfect spacing for your family bike collection. Read more Perfect for Mountain Bikes Nobody knows why your bike has a hollow crank spindle, but it does. Why not make the most of that space and use it to store and work on your bike? The Scorpion is compatible with 13, 18 and 20mm hollow crank spindles on either side of the bike. The design elevates the rear wheel and lends itself to lite bike maintenance, like chain lubrication and frame cleaning. As with all our products, when not being used it folds in to a compact, portable or stow-able footprint until it’s needed again. Available in Black, Red, and Turquoise. Feedback Sports Free Standing Bike Storage Collection Because you love your bicycles, when you’re not riding them you want to protect them and you need a simple, non-permanent and effective bike parking solution. The often imitated, but never duplicated RAKK is a patented, versatile bike storage idea for front or rear wheel parking. Making contact with only your tire, the RAKK is an ideal bike parking solution for expensive road, cyclocross, mountain and electric bikes. And if you have several bikes, its modular design supports add-ons. Available in Black, Silver and White. Our Most Elegant Storage & Display Option Because you love your bicycles, and you care about the visual cues of your living space, you need an elegant, non-permanent and stable bike storage solution. The Velo Cache is a timeless, high-quality, versatile bike storage idea. Soft rubber protects your bike’s finish, making the Velo Cache the best solution for expensive road, cyclocross, mountain and electric bikes. And if you have several bikes, its modular design supports up to 4 bikes. Add the Velo Cache Storage Basket to keep extra cycling equipment in its place. Large Capacity Event Bike Storage It’s a race day, a gran fondo, or maybe just a ride day – regardless, there’s bikes everywhere and a need for mass bike storage. And because you love bicycles, you want to protect them and you need a simple, non-permanent and effective bike parking solution. The A-Frame is a versatile bike storage idea for hanging up to 8 bikes, and as the industry standard you’ll see the A-Frame at every type of cycling event. Making contact with only the bottom of your seat, the A-Frame is the best bike parking solution for road, cyclocross, mountain bikes, electric bikes and even kids bikes. And when the day is done it folds up and stores easily in a compact travel bag. With recently updated hardware, setting up has never been faster or simpler. Scorpion Bike Stand Rakk Bike Storage Velo Cache Bike Storage A-Frame Event Bike Storage Stand Feedback Sports Innovative Bike Storage Designs Innovative Designs All our products are engineered in Golden, Colorado, USA. Our designs are a result of nearly 100 years of combined expertise - we ride and we race, and we wrench on bikes. We prioritize designs that make cycling just a little easier - we Simplify Your Cycling. Adaptable & On-Trend Because we engineer our products, we create features with real user benefits. Our elegant home and commercial bike storage options evolve with bicycle manufacturing standards, so our stands always match your bike's unique specifications. Modular & Thoughtful Concepts One, two, three or four bikes? Accessory basket? Many of our home bike storage products are engineered with modular designs, allowing you to decide how many bikes you need to display and where to put your helmet, shoes, gloves or hydration pack. Our Velo Cache, Rakk, and Rakk XL each have the ability to adapt to your bike storage needs. Protective Designs We love our bikes, just like you. So we design our products to make displaying your bike easy, and ensure the way your bike is supported is safe, because that's what we want for ours. Read more ABOUT US Headquartered in Golden, Colorado, Feedback Sports offers a full line of professional grade bicycle repair stands, precision bike tools, elegant bicycle storage products and innovative bike trainers. Our products are a reflection of our internal passion as dedicated cyclists, racers and skilled mechanics. With products in use at the Tour de France, World Championships, and the highest level of every discipline of cycling, our products are the choice of discerning cyclists globally. With a priority on customer experience, the dependability and durability of our products are reinforced with our service department located in Colorado, USA. WHY US Every day we work hard and play hard. We design premium products for discerning cyclists and focus on precision, durability and uncompromising quality. We support our customers, our community and our industry. We strive to be good stewards of cycling. Feedback Sports aspires to be a known and respected brand in the cycling industry, but more importantly, we aim to be a company that others want to work with. Today, our products are found in over 50 countries around the world, and we’re just getting started. We invite you to join our ride. "
    },
    {
      "docid": 207351,
      "title": "SunRise Bike 1 Pair of Road Bike Carbon 700C Clincher Wheelset Super Light Bicycle Wheels 38mm Depth (fit for Shiman0 Cassette)",
      "text": "Product Description Rim: Material: Carbon Fiber-Toray T700 Brake surface: Basalt Rim Finish: 3k Matte Size: 700C Rim depth: 38mm Rim width: 23mm Type: Clincher Hub: Model:R13(black) Type: J-bend Bearing: Front: 2 sealed bearings, Rear: 4 sealed bearings Front Hub: O.L.D: 9*100mm, 20 spoke holes, weight: 74.3g Rear Hub: O.L.D: 10*130mm, 24 spoke holes, weight: 212.9g Spokes: Model: TaiWan Aero Spokes (black) Spoke tension: Front: 90kgf Rear drive side: 130kgf Rear Non-drive side: 80kgf Hole: Front 20H, Rear 24H Lacing: Front : Radial, Rear: 2X cross drive side, Radial Non-drive side Nipples: Material: TaiWan alloy external nipple (black) Max Recommend Rider Weight: 130kg/286lbs Max Recommend Tire Pressure: 125psi/8.6bar Recommended Tire Width: 700Cx23 or 700Cx25 Weight: 1505g±20g/pair Package Including: 1x Wheelset, rim tape, skewers, brake pads, extra spokes+nipples Product Description Rim: Material: Carbon Fiber-Toray T700 Brake surface: Basalt Rim Finish: 3k Matte Size: 700C Rim depth: 38mm Rim width: 23mm Type: Clincher Hub: Model:R13(black) Type: J-bend Bearing: Front: 2 sealed bearings, Rear: 4 sealed bearings Front Hub: O.L.D: 9*100mm, 20 spoke holes, weight: 74.3g Rear Hub: O.L.D: 10*130mm, 24 spoke holes, weight: 212.9g Spokes: Model: TaiWan Aero Spokes (black) Spoke tension: Front: 90kgf Rear drive side: 130kgf Rear Non-drive side: 80kgf Hole: Front 20H, Rear 24H Lacing: Front : Radial, Rear: 2X cross drive side, Radial Non-drive side Nipples: Material: TaiWan alloy external nipple (black) Max Recommend Rider Weight: 130kg/286lbs Max Recommend Tire Pressure: 125psi/8.6bar Recommended Tire Width: 700Cx23 or 700Cx25 Weight: 1505g±20g/pair Package Including: 1x Wheelset, rim tape, skewers, brake pads, extra spokes+nipples"
    },
    {
      "docid": 1358034,
      "title": "EBIKELING Waterproof Ebike Conversion Kit for Electric Bike 29\" Front or Rear Wheel Electric Bicycle Hub Motor Kit 1500W 1200W 750W 500W Electric Bike Conversion Kit",
      "text": "From the brand Previous page Ebike Conversion Kits Visit the Store Conversion Kits with Battery Visit the Store Memory Foam Bike Seats Visit the Store Torque Arms Visit the Store Other Accessories Visit the Store Next page Product Description YOU CAN CONVERT ALMOST ANY BIKE INTO AN ELECTRIC BIKE Affordable and powerful kit options, the comfort of the smooth installation process are only a few good things to start explaining what we're offering here at Ebikeling. We are offering a variety of power options that suits your lifestyle. A commute, a day at the beach, or a late-night hangout with your buddies, you will enjoy the ride and make great memories on the way with Ebikeling. Choose your bicycle tire size, easily convert your bike and enjoy your ride! SPECIFICATIONS Recommended tire width 28C, 32C Rim Width 19mm Rim Diameter (Outer) 633mm Rim Diameter (Inner) 583mm Spoke 188mm 12G Carbon Steel Copper Nipples Rear dropout 132mm Rear Axle Length 207mm Front Axle Length 173mm Front Dropout 98mm Kit Weight 23lbs Motor Torque 30 Nm Efficiency > 82% Motor RPM (Nominal) 430 Motor Hub Diameter 242mm Motor Magnets 46 Peak Power 1.45kW Operating Mode S1 ENJOY THE COMFORT OF YOUR NEXT JOURNEY IN EVERY WEATHER CONDITION! The waterproof ebike conversion kits are more reliable than regular ebike conversion kits in difficult weather conditions. They are designed to take a ride in the rain or snow. Did you know we sell ebike conversion kits with batteries? Ebike Conversion Kit with 48V 12.8Ah Dolphin Battery Ebike Conversion Kit with 48V 14Ah Tiger Shark Battery Ebike Conversion Kit with 52V 16Ah Shark Battery Read more FEEL THE POWER! Still think you would struggle to ride in difficult conditions? Let us make your ride much easier. Oh did you say hills? Peh! Everybody loves to ride a bike down the hill, but have you ever enjoy the comfort of riding an uphill without a hustle? At eBikeling, we're offering you a nonstop adventure experience. The aluminum double-walled rim and hub motor are already attached in the box. Kits are ready to install right out of the box, all you need to do is replace them with the original tire. T he wheel axle diameter is 10 mm. Steel forks can be filed If the axle does not fit into the dropout because of its slightly larger diameter. Please do not file more than necessary and make sure that it does not damage the forks. Aluminum forks can also be filed with extra caution. Aluminum rims have openings for a Schrader-type valve. The kit doesn't have a regen brake option. The controller comes with an SY60 male-type battery connector (Compatible with XT60 connectors). PAS/Brake Levers are optional. Kits will operate without them. You will be able to use your own brakes. WE ARE HERE TO BUILD YOUR WHOLE BIKE Phone Holder Bag Secure and reliable method to access your phone and a storage for your accessories. Saddle Bag Durable, compact, and waterproof bag strapped under the seat to carry essential items at all times. Bike Pannier Bag Double sided large capacity storage for your oversized items with reflective corners for your safety. Front Headlight Extremely bright and fully waterproof 400 Lumens LED headlight will enlighten your night riding experience Read more "
    },
    {
      "docid": 864892,
      "title": "EBIKELING Waterproof Ebike Conversion Kit for Electric Bike 29\" Front or Rear Wheel Electric Bicycle Hub Motor Kit 1500W 1200W 750W 500W Electric Bike Conversion Kit",
      "text": "From the brand Previous page Ebike Conversion Kits Visit the Store Conversion Kits with Battery Visit the Store Memory Foam Bike Seats Visit the Store Torque Arms Visit the Store Other Accessories Visit the Store Next page Product Description YOU CAN CONVERT ALMOST ANY BIKE INTO AN ELECTRIC BIKE Affordable and powerful kit options, the comfort of the smooth installation process are only a few good things to start explaining what we're offering here at Ebikeling. We are offering a variety of power options that suits your lifestyle. A commute, a day at the beach, or a late-night hangout with your buddies, you will enjoy the ride and make great memories on the way with Ebikeling. Choose your bicycle tire size, easily convert your bike and enjoy your ride! SPECIFICATIONS Recommended tire width 28C, 32C Rim Width 19mm Rim Diameter (Outer) 633mm Rim Diameter (Inner) 583mm Spoke 188mm 12G Carbon Steel Copper Nipples Rear dropout 132mm Rear Axle Length 207mm Front Axle Length 173mm Front Dropout 98mm Kit Weight 23lbs Motor Torque 30 Nm Efficiency > 82% Motor RPM (Nominal) 430 Motor Hub Diameter 242mm Motor Magnets 46 Peak Power 1.45kW Operating Mode S1 ENJOY THE COMFORT OF YOUR NEXT JOURNEY IN EVERY WEATHER CONDITION! The waterproof ebike conversion kits are more reliable than regular ebike conversion kits in difficult weather conditions. They are designed to take a ride in the rain or snow. Did you know we sell ebike conversion kits with batteries? Ebike Conversion Kit with 48V 12.8Ah Dolphin Battery Ebike Conversion Kit with 48V 14Ah Tiger Shark Battery Ebike Conversion Kit with 52V 16Ah Shark Battery Read more FEEL THE POWER! Still think you would struggle to ride in difficult conditions? Let us make your ride much easier. Oh did you say hills? Peh! Everybody loves to ride a bike down the hill, but have you ever enjoy the comfort of riding an uphill without a hustle? At eBikeling, we're offering you a nonstop adventure experience. The aluminum double-walled rim and hub motor are already attached in the box. Kits are ready to install right out of the box, all you need to do is replace them with the original tire. T he wheel axle diameter is 10 mm. Steel forks can be filed If the axle does not fit into the dropout because of its slightly larger diameter. Please do not file more than necessary and make sure that it does not damage the forks. Aluminum forks can also be filed with extra caution. Aluminum rims have openings for a Schrader-type valve. The kit doesn't have a regen brake option. The controller comes with an SY60 male-type battery connector (Compatible with XT60 connectors). PAS/Brake Levers are optional. Kits will operate without them. You will be able to use your own brakes. WE ARE HERE TO BUILD YOUR WHOLE BIKE Phone Holder Bag Secure and reliable method to access your phone and a storage for your accessories. Saddle Bag Durable, compact, and waterproof bag strapped under the seat to carry essential items at all times. Bike Pannier Bag Double sided large capacity storage for your oversized items with reflective corners for your safety. Front Headlight Extremely bright and fully waterproof 400 Lumens LED headlight will enlighten your night riding experience Read more "
    }
  ]
}